INSERT INTO "public.Genres" (name) VALUES
	('Комедия'),
	('Мультфильмы'),
	('Ужасы'),
	('Фантастика'),
	('Триллеры'),
	('Боевики'),
	('Мелодрамы'),
	('Детективы'),
	('Приключения'),
	('Фэнтези'),
	('Военные'),
	('Семейные'),
	('Аниме'),
	('Исторические'),
	('Драмы'),
	('Документальные'),
	('Детские'),
	('Криминал'),
	('Биографии'),
	('Вестерны'),
	('Фильмы-нуар'),
	('Спортивные'),
	('Реальное ТВ'),
	('Короткометражки'),
	('Музыкальные'),
	('Мюзиклы'),
	('Ток-шоу'),
	('Игры');


INSERT INTO "public.Movies" (name, release_date, duration, mpaa, rating, kp_id, description) VALUES
	('Сила страны','1976-01-27','2:20:00','NC-17',7.7,'770',
		'Встать полевой спасть помимо. Заплакать заведение экзамен изучить господь. Заложить изучить отъезд нервно лететь тревога.'),
	('Включая','2011-02-25','2:02:00','R',8.0,'9809',
		'Функция проход другой табак ложиться ломать. Даль кожа роскошный приятель. Тревога находить угроза заплакать факультет.'),
	('Бал год','1975-07-18','2:46:00','R',9.9,'4860',
		'Рай интеллектуальный передо тута выразить. Издали актриса ученый означать.'),
	('Определять','2005-04-30','1:10:00','PG-13',8.8,'5035',
		'Нервно налево господь народ радость. Терапия виднеться заработать монета.'),
	('Офицер вполне','1976-10-26','2:41:00','NC-17',8.8,'1050',
		'Командующий куча космос через плавно намерение. Райком пропадать поймать изображать аллея тесно рис. Наткнуться дыхание горький коллектив.'),
	('Последний официальный точно','1983-11-02','1:20:00','PG',7.2,'6620',
		'Плясать жить спасть сходить ложиться. Постоянный мальчишка желание задержать о монета танцевать мальчишка.'),
	('За организационным искусством','1986-03-12','2:13:00','PG-13',8.9,'2963',
		'Возможно отметить нервно рот. Редактор выгнать райком поздравлять.'),
	('Тип семейства','2002-11-07','2:28:00','NC-17',8.4,'3679',
		'Указанный решетка мгновение провинция.'),
	('Отец смены станции','2023-09-13','2:45:00','PG-13',9.9,'6328',
		'Светило тревога армейский плясать мимо прежний о. Карман результат новый четко передо соответствие.'),
	('Запад','2012-10-24','1:54:00','R',9.0,'9060',
		'Роса да тесно вскинуть полоска указанный кузнец хлеб. Услать поезд написать рис задержать хозяйка волк. Угроза один ботинок пастух остановить космос. За вздрогнуть господь коммунизм недостаток освободить передо жестокий.'),
	('Знакомство с природой','2005-06-02','2:34:00','NC-17',9.4,'8431',
		'Очутиться место факультет слишком сынок коллектив вывести носок.'),
	('Теперь даже','2013-05-20','1:03:00','NC-17',9.5,'5493',
		'Заплакать мучительно четыре премьера левый человечек пробовать. Прощение господь виднеться интернет товар эффект тесно. Следовательно печатать очутиться применяться приходить. Оборот пламя соответствие место костер.'),
	('Другие тоже сами','1976-07-12','2:01:00','R',5.3,'2084',
		'Степь ставить дрогнуть тревога пространство темнеть дорогой. Выражаться медицина покинуть оставить. Нервно освободить танцевать лететь.'),
	('Этот адвокат по заданию','1988-09-11','2:37:00','R',9.9,'6062',
		'Анализ прежний дурацкий ломать висеть следовательно командир. Коллектив засунуть точно остановить коммунизм.'),
	('Окно сто индивидуальное','2006-07-13','1:05:00','NC-17',8.3,'6384',
		'Слать ремень низкий построить пробовать даль.'),
	('Встряхнуть администрацию','1992-01-26','1:37:00','PG-13',7.4,'3182',
		'Висеть степь выразить вообще витрина. Освободить какой иной поздравлять непривычный. Зачем грустный смеяться издали приходить.'),
	('Школа разумного возраста','1992-05-30','1:26:00','PG',5.7,'2587',
		'Очко подземный при понятный перебивать. Нож деловой солнце актриса решение приходить что. Костер факультет рабочий очко. Свежий пробовать тесно песенка скользить иной танцевать.'),
	('Усилие определенного ветра','2010-01-14','2:18:00','PG',8.0,'3764',
		'Демократия ручей забирать невыносимый. Ложиться приличный руководитель неправда понятный прощение.'),
	('Прогулочное стекло','1995-03-04','2:24:00','R',8.4,'7296',
		'Табак приличный перебивать пробовать висеть социалистический. Да медицина печатать хозяйка сверкать. Пробовать достоинство прежний коричневый кидать хозяйка бетонный. Природа оборот возбуждение изображать призыв обида.'),
	('К','1986-06-09','1:17:00','G',9.8,'6301',
		'Ручей вообще вообще жестокий. Построить костер вздрогнуть неудобно лететь еврейский. Даль дошлый человечек бабочка ныне кожа приличный князь.'),
	('Достигать','1982-10-05','1:05:00','PG-13',7.7,'7818',
		'А какой манера блин следовательно. Функция услать палата дрогнуть.'),
	('Место, желающее место','1994-03-11','1:28:00','PG-13',6.3,'6087',
		'Ленинград указанный собеседник материя цвет намерение плясать.'),
	('Религиозный демократ','2012-07-20','2:25:00','PG',9.6,'852',
		'Приличный природа подземный пол коробка. Солнце направо плод приятель ставить.'),
	('Позволять','1991-01-12','2:43:00','PG',7.1,'8418',
		'Монета заявление растеряться мимо применяться бабочка вздрогнуть.'),
	('Брат часть средняя','1981-10-02','2:50:00','R',7.3,'3551',
		'Рот услать миллиард куча. Потом мгновение палка постоянный научить. Неправда скрытый каюта развитый господь витрина. Оборот вообще промолчать.'),
	('Семья','2018-01-21','1:44:00','NC-17',6.7,'5905',
		'Болото угроза коричневый увеличиваться монета.'),
	('Эксперт','2019-01-14','1:45:00','PG-13',8.1,'3785',
		'Вздрогнуть академик один порядок танцевать бок полностью. Важный другой приятель куча заработать плавно изба. Головка редактор тесно приходить поймать издали процесс кидать.'),
	('Означает поддержку когда-либо','1976-12-27','1:02:00','G',7.4,'9960',
		'Падать трясти хотеть вряд табак решение правление. Дальний еврейский кпсс конференция цель привлекать. Пространство мягкий функция какой способ.'),
	('Определить, определить вид','2002-11-30','2:44:00','PG',5.3,'9187',
		'Неправда соответствие изображать поздравлять. Дорогой приличный четко командир.'),
	('Земля','2004-11-14','1:33:00','PG-13',5.3,'8629',
		'Неправда командование лиловый полевой смеяться ярко пища. Развернуться кпсс роса приятель художественный прощение запустить. Одиннадцать лиловый провал возмутиться. Бок невозможно свежий развитый.'),
	('Особо светлый','1993-09-21','2:43:00','PG-13',10.0,'4964',
		'Возникновение спешить развитый мягкий естественный район заработать. Наступать прощение тесно невыносимый.'),
	('Ничего не упоминай, наш','2013-10-12','2:36:00','NC-17',8.9,'3803',
		'Пробовать механический советовать. Трясти бочок потянуться.'),
	('Добрый или','1986-12-26','1:49:00','G',7.9,'7256',
		'Функция командующий советовать развитый полевой появление. Даль что мелькнуть.'),
	('Знак суммы момента','1993-12-12','1:07:00','R',5.8,'7979',
		'Место ложиться зачем пересечь багровый блин плавно. Около редактор экзамен коробка житель горький разводить лапа. Означать единый коричневый бегать.'),
	('Все вылезает наружу','1977-12-22','2:12:00','G',7.7,'6699',
		'Сопровождаться одиннадцать дорогой слать. Цель июнь вообще господь. Господь дошлый через кожа ученый второй. Домашний прелесть тусклый дружно пища.'),
	('Простая кампания','1995-12-28','1:11:00','PG',6.1,'5642',
		'Оборот лететь бочок желание поздравлять. Услать вперед вздрогнуть господь возмутиться.'),
	('Существующее решение','2022-04-04','2:34:00','PG-13',5.2,'1922',
		'Мучительно даль потянуться медицина тута. Танцевать спешить инвалид художественный интеллектуальный.'),
	('Обращаться','2021-07-10','2:16:00','NC-17',9.2,'5662',
		'Реклама провал зачем исполнять танцевать ботинок. Мягкий возникновение актриса сомнительный очутиться команда. При князь нервно мусор функция кожа.'),
	('Поздно счастлив','1983-08-03','1:32:00','NC-17',5.5,'3828',
		'Багровый демократия крутой естественный руководитель карандаш. Перебивать один уронить пространство о что.'),
	('Середина','2020-09-04','1:36:00','NC-17',6.2,'623',
		'Назначить тусклый монета салон покидать приятель. Войти райком издали холодно направо.'),
	('Работа','1996-12-03','1:26:00','NC-17',8.3,'8090',
		'Рот следовательно приятель актриса. Цепочка бегать разводить пропасть поставить пасть плод. Дружно войти приятель смертельный лапа.'),
	('Никогда не режь','1995-03-26','2:00:00','G',9.8,'5032',
		'Монета ведь пламя вскинуть затянуться тысяча ленинград. Мимо вытаскивать серьезный космос аллея неправда.'),
	('Введите другой','2006-06-25','1:14:00','PG',9.6,'6512',
		'Чувство медицина командующий. Выражаться пасть цепочка покинуть интернет упор серьезный.'),
	('Признайся во всем','2002-02-01','1:27:00','R',7.4,'5432',
		'Написать вариант возмутиться указанный дорогой факультет. Протягивать холодно встать. Второй скользить возмутиться падаль успокоиться.'),
	('Муж','2022-06-20','2:21:00','R',9.1,'9566',
		'Вообще пламя появление холодно слишком. Левый сынок экзамен похороны вообще. Порядок тысяча равнодушный тяжелый спорт невозможно приходить.'),
	('Если страдать','1984-04-09','2:23:00','PG',8.1,'1275',
		'Очко подробность задержать правый вскинуть приходить возникновение. Что печатать уронить сомнительный вывести. Собеседник упорно серьезный совет успокоиться печатать.'),
	('Возможно, сначала','2009-08-25','1:18:00','PG',5.2,'9642',
		'Вскинуть легко посвятить угроза страсть. Вывести вообще ставить хозяйка развитый ребятишки указанный.'),
	('Набор отчетов','1978-04-19','1:56:00','PG',6.4,'9029',
		'Прелесть равнодушный порядок чувство выраженный. Пища слишком изредка. Карман хозяйка художественный совет одиннадцать потом отдел собеседник.'),
	('С','1995-09-29','2:21:00','PG',5.3,'2482',
		'Поставить мусор салон.'),
	('Влияние на сайт','1993-08-22','2:36:00','NC-17',6.3,'1820',
		'Страсть инструкция горький. Издали руководитель плод постоянный ученый выразить кузнец.'),
	('По появлению','2004-11-09','1:22:00','NC-17',7.7,'9308',
		'Неожиданно угодный строительство интеллектуальный витрина разуметься. Смелый куча поколение потом рассуждение сутки результат. Сверкать дошлый пятеро аллея слишком рассуждение.'),
	('Все вызывают','1977-10-25','2:14:00','G',7.6,'8808',
		'Шлем пропаганда очутиться выдержать некоторый разнообразный коричневый. Возмутиться хотеть трубка мгновение поговорить.'),
	('Часовое здание','2020-07-17','2:46:00','NC-17',7.0,'6962',
		'Салон редактор райком намерение. Привлекать рассуждение собеседник пища. Строительство радость изредка головной засунуть. Запретить монета поколение точно.'),
	('Ответь хотя подумай','2004-03-11','1:14:00','NC-17',5.4,'5505',
		'Протягивать неожиданно армейский вообще домашний тревога. Полюбить мелочь плясать сверкающий другой. Самостоятельно бегать издали князь естественный.'),
	('Надеяться','1996-03-30','1:53:00','G',5.0,'1884',
		'Советовать провал космос находить проход трясти строительство. Ремень кольцо прежде другой заплакать выдержать материя. Бочок привлекать умирать угроза монета расстройство прелесть.'),
	('Разница','1975-08-18','1:18:00','NC-17',5.7,'6663',
		'Мелькнуть граница господь число функция новый. Потом плясать художественный слать важный кольцо проход цель. Налоговый витрина магазин сопровождаться.'),
	('Позже','2013-05-06','1:01:00','NC-17',6.9,'5752',
		'Инвалид мусор порог. Багровый сынок правильный изменение возбуждение интеллектуальный.'),
	('Все может быть','2012-08-10','2:07:00','NC-17',6.0,'2190',
		'Уронить мягкий металл домашний труп. Тысяча команда правильный. Носок выраженный угодный функция слишком за.'),
	('Север','2001-11-17','2:22:00','G',7.6,'8630',
		'Рассуждение граница казнь развитый зеленый труп очередной. Ставить коллектив миллиард эффект плясать волк секунда.'),
	('Голосуйте за ту же часть','2016-05-05','1:42:00','NC-17',5.3,'8631',
		'Мелочь самостоятельно выраженный точно добиться правление дрогнуть факультет. Райком металл тысяча ночь космос вскакивать.'),
	('Поинт-команда','1999-10-29','1:39:00','R',5.9,'8895',
		'Картинка цель болото вчера космос потом народ. Единый забирать витрина коммунизм роскошный зима похороны.'),
	('Расходы','2014-11-09','2:02:00','R',5.2,'5307',
		'Потрясти один правление. Покидать исследование анализ рабочий успокоиться жестокий палец. Выражаться обида провал изба.'),
	('Одно целое раскрытие','2012-04-11','2:04:00','R',9.6,'2010',
		'Другой число боец рассуждение порядок багровый. Поймать господь применяться аллея сомнительный порядок.'),
	('Трудно идентифицировать','1996-07-21','1:34:00','PG',5.0,'7937',
		'Ребятишки следовательно зима выдержать. Дрогнуть результат уничтожение запретить.'),
	('Беспокоите нас','2022-10-12','2:03:00','NC-17',8.5,'6023',
		'Процесс изображать ремень указанный мгновение картинка. Правление оборот ленинград команда пробовать расстройство. Кпсс пастух беспомощный костер.'),
	('Еще','2013-09-25','1:35:00','G',6.3,'7382',
		'Достоинство танцевать очередной заработать привлекать. При построить еврейский расстегнуть. Применяться тревога князь банда да пятеро металл.'),
	('Один раз','1980-05-14','1:40:00','G',8.9,'5562',
		'Инфекция парень заведение провал. Заложить ботинок функция палец господь. Девка порог вздрогнуть вскинуть зачем.'),
	('Иностранный довольно','1984-01-01','2:35:00','NC-17',9.6,'6496',
		'Встать неожиданный порт серьезный. Зеленый отметить совещание покинуть бетонный порт одиннадцать. Столетие горький головка неправда вскакивать район плясать угодный.'),
	('Беспокойство','2013-04-03','2:54:00','PG',5.7,'1816',
		'Житель ягода наткнуться материя. Плод спасть порядок конференция предоставить спорт вариант. Головка ломать премьера ленинград пробовать.'),
	('Чувство атаки читать','2021-12-13','1:46:00','R',8.2,'1714',
		'Запеть интернет зима деньги. Настать жидкий набор.'),
	('Явный рост производства','2022-02-01','1:28:00','PG-13',6.5,'741',
		'Означать спасть развернуться. Бегать низкий правление счастье.'),
	('Миссис Мейн Муха','1995-12-20','2:41:00','NC-17',9.8,'6132',
		'Поколение подземный полностью дурацкий неожиданный бабочка. Поздравлять непривычный провинция июнь банда мальчишка решетка.'),
	('Вытащите студента','1998-08-16','1:43:00','NC-17',5.9,'6896',
		'Правильный тута космос житель школьный приличный сопровождаться. Расстройство кузнец сынок.'),
	('Фонд мира','1994-10-22','1:56:00','PG',5.7,'4997',
		'Очко чем назначить лететь скрытый инфекция. Мимо мера очко четко функция потом. Второй секунда казнь тяжелый белье космос.'),
	('Требовать','1986-10-30','1:47:00','PG-13',7.2,'1274',
		'Прежде подземный валюта желание смертельный неправда витрина. Ленинград ход чем изучить ведь штаб степь.'),
	('Купить','1981-08-27','2:07:00','G',5.3,'9784',
		'Оставить хлеб теория возмутиться пространство. Избегать изба кольцо присесть покидать медицина столетие. Зима мальчишка покинуть передо.'),
	('Современные другие учат','1988-05-30','2:01:00','PG-13',5.9,'5835',
		'Невозможно порог помолчать горький социалистический аж тысяча. Снимать поезд правильный жить июнь термин вперед. Висеть бригада привлекать манера уничтожение упор. Зато поколение беспомощный неправда манера функция.'),
	('Люди','1987-12-28','2:50:00','R',7.9,'8458',
		'Растеряться солнце одиннадцать. Мучительно означать мимо исполнять крутой. Песня неудобно плавно командование помолчать новый.'),
	('Медицинский брат, да','1987-10-21','2:04:00','PG-13',8.4,'1004',
		'Ягода порог уточнить невыносимый. Прошептать степь достоинство вряд пища изучить.'),
	('Медицинское сообщество','1978-02-28','2:43:00','G',8.9,'8567',
		'Сбросить способ сомнительный спасть заработать освободить.'),
	('Вообще-то, отдохни после обеда','2001-01-04','2:36:00','PG',9.7,'6928',
		'Около сохранять пропадать ночь плавно плод. Эффект естественный приятель мрачно сустав неожиданный проход.'),
	('Служить','1975-12-20','2:34:00','PG',7.2,'3122',
		'Пятеро порог коллектив совещание возмутиться правление развернуться пища. Проход ремень премьера посидеть уронить бочок интеллектуальный решение. Носок инфекция около порог изображать разуметься материя.'),
	('Нация его поперек','1999-05-12','1:14:00','R',7.2,'3994',
		'Функция выражение песня неожиданный невозможно смеяться. Лететь неправда горький багровый. Одиннадцать темнеть а изба куча.'),
	('Живой мальчик, звук','1977-04-06','2:40:00','R',6.4,'1131',
		'Четыре мальчишка командующий спорт поставить затянуться издали сопровождаться. Похороны даль ночь находить висеть торопливый. Мотоцикл о хозяйка бригада изображать выбирать предоставить триста.'),
	('Большой','1982-11-06','1:48:00','G',7.8,'8163',
		'Выраженный ученый единый применяться. Указанный четыре холодно казнь заплакать.'),
	('Агент по отцу','2021-08-08','1:16:00','R',8.5,'5604',
		'Затянуться угол костер пламя. Пересечь граница выраженный коричневый. Печатать прелесть выражаться близко призыв жестокий.'),
	('Медицинский там, потому что','1977-07-03','1:11:00','G',6.7,'5509',
		'Художественный жидкий выраженный интеллектуальный успокоиться смертельный более.'),
	('Синие наши они','2007-07-29','1:18:00','G',6.0,'5406',
		'Развитый палата идея командование миф житель. Сверкающий граница функция решетка написать бетонный.'),
	('Вести','1995-08-20','2:19:00','PG',7.8,'2239',
		'Монета шлем отъезд падать армейский. Отметить демократия пробовать пропасть конференция мотоцикл.'),
	('Потерять магазин вечером','2018-08-25','1:46:00','R',6.5,'9848',
		'Подземный следовательно монета. Очко полюбить картинка предоставить.'),
	('Характер','2015-06-02','2:01:00','PG',6.2,'8974',
		'Горький роса дошлый поговорить порог неудобно бегать. Крыса совещание за очко.'),
	('Кровать говорит бит','2023-03-21','2:22:00','R',8.0,'6009',
		'Сравнение госпожа космос лапа. Факультет грудь сопровождаться неожиданно функция лететь.'),
	('Вскоре компьютер и','1975-03-20','1:30:00','PG-13',7.2,'5592',
		'Дрогнуть господь угол левый неудобно способ. Даль поймать отъезд выкинуть а дошлый. Тусклый табак число налоговый уточнить магазин падаль.'),
	('Две войны','1980-02-23','1:28:00','PG',6.0,'8153',
		'Зима ломать развернуться низкий рот соответствие падать. Сбросить блин славный бабочка коллектив покинуть цепочка.'),
	('Мог распознать','2022-05-07','2:23:00','NC-17',9.6,'9804',
		'Советовать встать хотеть. Вытаскивать естественный иной реклама нервно. Граница заведение мгновение кпсс экзамен потрясти.'),
	('Поднимись, слушай','1996-11-07','1:51:00','PG',9.8,'5818',
		'Потом перебивать помолчать неправда появление расстегнуть советовать. Уронить что заявление покидать плясать провинция промолчать горький. Тысяча сомнительный мальчишка.'),
	('День национального генерала','2016-06-26','1:37:00','PG-13',8.9,'9508',
		'Бетонный цвет человечек скользить обида граница. Ход термин кольцо. Светило строительство неожиданный коричневый уронить коммунизм ботинок палец.'),
	('Петь','2020-03-14','2:08:00','G',6.1,'6324',
		'При блин валюта степь армейский. Правление пища умирать.'),
	('Каждое близкое открытие','2002-06-04','1:01:00','R',6.2,'9103',
		'Ход подземный ломать чувство. Пропаганда невыносимый какой собеседник роскошный порядок.'),
	('Угроза, которой мы служим','2019-08-21','2:14:00','G',8.1,'4323',
		'Рабочий очко разнообразный научить коллектив школьный. Ручей мелочь жестокий терапия тусклый. Ботинок непривычный наслаждение.'),
	('Мировая сумка-машина','1995-10-11','2:21:00','PG-13',8.1,'2716',
		'Услать мальчишка помолчать возникновение инвалид. Инфекция ставить академик обида зима. Мелочь еврейский мера материя поставить руководитель правление наслаждение.'),
	('Бесплатно','2012-09-02','2:31:00','NC-17',5.9,'2246',
		'Багровый адвокат советовать. При заложить зачем район успокоиться эффект неудобно. Правление а мера эпоха порт забирать.'),
	('Коробка','2012-02-18','1:12:00','NC-17',6.0,'1917',
		'Роса бочок неожиданный манера радость. Хлеб заведение пасть четыре салон.'),
	('Вода','1986-05-24','2:42:00','NC-17',9.7,'8125',
		'Мера дружно товар расстегнуть провал мрачно сомнительный назначить. Освободить вздрогнуть порода прежний лететь командующий. Адвокат бровь товар подземный.'),
	('Класс закрыть','2005-07-04','2:47:00','PG',9.9,'2832',
		'Тута неправда каюта наткнуться один. Дурацкий заплакать разнообразный слать космос отъезд командование выраженный. Зеленый естественный мгновение.'),
	('Энергия','2023-03-27','2:31:00','R',6.3,'1115',
		'Вскинуть затянуться потянуться дальний госпожа лететь возникновение. Другой отъезд мелочь голубчик командование чувство еврейский призыв. Человечек похороны невозможно другой слишком посидеть протягивать.'),
	('Впереди опыт брата','1984-12-12','1:50:00','R',6.4,'6557',
		'Зато упорно очко рай мрачно возможно. Намерение желание господь. Солнце табак грудь пересечь поймать невозможно кпсс.'),
	('Различный','2011-01-11','1:25:00','PG',5.7,'8645',
		'Гулять табак выражаться предоставить пропасть чувство ход. Магазин домашний правильный сомнительный забирать славный падаль.'),
	('Никогда','2006-07-03','2:09:00','PG-13',9.1,'821',
		'Уточнить слать издали наступать постоянный палец. Покидать поставить реклама означать. Кпсс понятный монета процесс. Засунуть скрытый академик багровый слишком выраженный заложить.'),
	('Вещи','2018-07-03','2:36:00','NC-17',8.4,'8979',
		'Поезд подземный ярко мелькнуть непривычный зачем. Угол мелочь ребятишки термин. Левый прежний вряд пятеро.'),
	('Почувствуйте, опишите производство','1990-06-22','2:57:00','G',6.7,'3983',
		'Товар командование отъезд домашний.'),
	('Ударять','1976-08-30','2:24:00','G',5.0,'2606',
		'Порт падать школьный монета нажать. Указанный печатать чувство запеть пища возникновение бегать.'),
	('Сами благодарю','1980-05-13','2:10:00','PG',7.2,'7784',
		'Секунда вариант гулять функция мотоцикл инвалид. Отражение о отметить рабочий. Неожиданно уничтожение спичка коробка видимо сбросить наступать.'),
	('Кажется, имя успешное','2022-03-21','1:14:00','PG',7.1,'7766',
		'Иной житель интеллектуальный приходить забирать расстегнуть что. Поздравлять применяться сынок жить непривычный.'),
	('Рынок другой','2021-10-15','1:01:00','PG-13',7.0,'4183',
		'Поставить естественный товар налево вытаскивать упор крутой. Сустав отметить мимо возможно угроза издали.'),
	('Колледжский мяч.','2017-03-08','2:07:00','PG',6.0,'1754',
		'Основание проход столетие посидеть металл тревога запустить что. Вывести июнь пятеро расстройство отметить прощение.'),
	('До','1976-07-17','2:41:00','NC-17',9.4,'8805',
		'Затянуться миллиард сустав разуметься пространство салон. Через исполнять волк поставить помолчать роскошный.'),
	('Помнить','1979-10-10','2:33:00','NC-17',5.4,'8433',
		'Иной еврейский зеленый инвалид идея рай. Тесно прошептать присесть порядок прощение а.'),
	('Дом','1980-01-19','1:34:00','G',9.8,'3413',
		'Возможно пропасть витрина еврейский дурацкий радость. Собеседник близко результат полюбить мелочь выбирать спасть. Запеть банк нож коллектив. Граница командующий ход коллектив.'),
	('Каждому достаточно, как','2001-09-17','2:51:00','G',9.9,'6860',
		'Заявление потянуться танцевать издали ныне результат. Тысяча лапа намерение изменение ученый. Райком снимать неправда.'),
	('Сохранить пропуск','2001-04-11','1:27:00','R',8.4,'7055',
		'Промолчать тусклый тяжелый изучить.'),
	('Общество войной','2011-06-13','1:44:00','PG-13',6.3,'7420',
		'Адвокат место да а написать неудобно. Протягивать художественный левый.'),
	('Сегодня вечером','1980-02-04','1:44:00','G',6.1,'2028',
		'Бегать увеличиваться означать низкий выраженный теория конференция. Поезд предоставить рабочий что. Ярко вперед порог. Передо разнообразный отражение монета.'),
	('Цена двух попыток','2010-11-10','1:32:00','G',5.3,'4846',
		'Упорно крутой космос конференция построить. Вряд слишком одиннадцать анализ.'),
	('Сад','2014-04-18','2:56:00','PG-13',7.4,'3066',
		'Вытаскивать вообще опасность затянуться. Угроза передо нож аллея понятный хотеть оборот. Необычный забирать боец пространство грудь промолчать.'),
	('Готовься пиши','1998-04-12','1:08:00','R',5.3,'3226',
		'Снимать товар дремать танцевать. Цель казнь изредка совещание руководитель. Правильный проход поезд отметить песенка прелесть слать.'),
	('До внимания','2004-04-17','2:36:00','G',8.7,'8360',
		'Ручей жестокий поздравлять. Степь полевой один песенка. Серьезный кпсс запеть поздравлять салон.'),
	('Спорить, раскрывать','2023-04-04','2:57:00','PG',9.6,'5113',
		'Плод добиться основание результат радость функция пропаганда. Запретить присесть упорно провинция изменение пространство. Присесть какой бегать вскакивать порода очутиться вздрогнуть.'),
	('Церковь','1976-06-13','1:14:00','PG',5.9,'7703',
		'Танцевать зато монета еврейский ложиться фонарик. Материя эпоха ленинград ремень.'),
	('Как оставаться политикой','1983-02-26','1:34:00','PG',8.3,'4313',
		'Приятель командир выражаться прощение посвятить выбирать. Песня девка налево. Валюта изображать ставить проход научить.'),
	('Конец','1988-12-11','1:23:00','PG',9.1,'3464',
		'Решение соответствие нажать функция. Задержать демократия задержать направо забирать зеленый. Иной ботинок а лететь полевой цель выгнать лететь.'),
	('Служить производительности создавать','2006-05-08','2:42:00','NC-17',7.9,'8075',
		'Второй угодный бетонный полоска четко заявление. Призыв разуметься задержать ягода скользить. Изредка дорогой сынок инвалид ручей.'),
	('Красивый подъем','1991-05-22','2:17:00','NC-17',7.4,'6061',
		'Девка коллектив штаб посвятить жидкий. Багровый гулять эпоха написать пропаганда тусклый товар. Функция банда решетка прежде головной важный естественный.'),
	('Готовый','1990-02-26','1:51:00','PG-13',8.7,'8961',
		'Совет танцевать ночь около очутиться горький пол. Багровый ленинград мера ребятишки непривычный металл художественный мелькнуть.'),
	('Вариант генерала его','2001-02-12','2:16:00','G',5.9,'8224',
		'Холодно горький нож угроза порог пятеро налево равнодушный. Премьера нервно природа палец команда расстройство. Бочок труп райком плясать выражение шлем спасть.'),
	('Жестко их','2000-10-10','2:55:00','NC-17',6.0,'2782',
		'Вряд космос налоговый уточнить настать зима. Спешить рота отметить полностью мелькнуть куча столетие граница. Горький единый палата.'),
	('Кусочек','2008-05-12','2:22:00','G',5.3,'6772',
		'Салон терапия полоска порода. Провал легко пища ставить приятель картинка. Научить багровый лиловый один дрогнуть.'),
	('Навык кровати поздно','2001-09-27','2:15:00','PG-13',5.8,'6458',
		'Другой сверкать вряд разводить. Ремень передо задержать отъезд висеть поставить соответствие.'),
	('Продолжить аналогичную сторону','2007-07-01','1:24:00','R',7.9,'8076',
		'Бетонный намерение освобождение инфекция.'),
	('Авторитетное присоединение','2001-08-03','2:15:00','PG-13',8.4,'3389',
		'Сынок гулять крыса висеть решетка головка. Достоинство степь освободить художественный.'),
	('Причина кожи','1981-08-15','1:36:00','PG',6.4,'8975',
		'За коммунизм протягивать спорт актриса командир. Выраженный грустный белье зато волк пространство прежний. Легко выраженный процесс зима промолчать при некоторый мотоцикл.'),
	('Беспокойство','2013-10-06','2:28:00','R',8.8,'7814',
		'Расстегнуть покидать заплакать труп пространство волк находить. Чем висеть правый скрытый угроза левый.'),
	('Сестре конец, потому что','2004-08-24','1:27:00','R',9.3,'2264',
		'Передо зарплата костер граница демократия означать степь. Добиться дошлый выдержать коллектив рот задержать сустав.'),
	('Дизайн друга','1986-02-09','2:53:00','PG-13',9.7,'1525',
		'Снимать секунда остановить актриса посидеть прошептать мелочь. Поставить прелесть карман мальчишка поезд потрясти привлекать. Применяться зеленый ботинок провинция тревога художественный. Товар намерение космос спичка беспомощный.'),
	('Музыка Миссис','1982-02-03','1:09:00','PG-13',5.6,'5399',
		'Четыре запретить роскошный горький равнодушный постоянный наткнуться доставать. Ведь посвятить заведение хлеб освободить.'),
	('Количество','2014-04-07','2:22:00','NC-17',5.4,'7485',
		'Рабочий возможно пастух пятеро перебивать смеяться. Процесс роскошный сопровождаться роса заработать приятель радость секунда.'),
	('Предлагать','1992-12-01','1:46:00','PG-13',6.3,'8755',
		'Рис ремень зарплата медицина выраженный горький.'),
	('Ну представьте себе','2011-12-13','1:19:00','NC-17',7.8,'7870',
		'Демократия кольцо сутки миф зачем. Опасность граница сынок тусклый радость ход дурацкий.'),
	('Особенно','2022-01-19','2:05:00','R',6.1,'6716',
		'Космос коробка порог трясти.');



DO $$
DECLARE id_movie_0 INT;
DECLARE id_movie_1 INT;
DECLARE id_movie_2 INT;
DECLARE id_movie_3 INT;
DECLARE id_movie_4 INT;
DECLARE id_movie_5 INT;
DECLARE id_movie_6 INT;
DECLARE id_movie_7 INT;
DECLARE id_movie_8 INT;
DECLARE id_movie_9 INT;
DECLARE id_movie_10 INT;
DECLARE id_movie_11 INT;
DECLARE id_movie_12 INT;
DECLARE id_movie_13 INT;
DECLARE id_movie_14 INT;
DECLARE id_movie_15 INT;
DECLARE id_movie_16 INT;
DECLARE id_movie_17 INT;
DECLARE id_movie_18 INT;
DECLARE id_movie_19 INT;
DECLARE id_movie_20 INT;
DECLARE id_movie_21 INT;
DECLARE id_movie_22 INT;
DECLARE id_movie_23 INT;
DECLARE id_movie_24 INT;
DECLARE id_movie_25 INT;
DECLARE id_movie_26 INT;
DECLARE id_movie_27 INT;
DECLARE id_movie_28 INT;
DECLARE id_movie_29 INT;
DECLARE id_movie_30 INT;
DECLARE id_movie_31 INT;
DECLARE id_movie_32 INT;
DECLARE id_movie_33 INT;
DECLARE id_movie_34 INT;
DECLARE id_movie_35 INT;
DECLARE id_movie_36 INT;
DECLARE id_movie_37 INT;
DECLARE id_movie_38 INT;
DECLARE id_movie_39 INT;
DECLARE id_movie_40 INT;
DECLARE id_movie_41 INT;
DECLARE id_movie_42 INT;
DECLARE id_movie_43 INT;
DECLARE id_movie_44 INT;
DECLARE id_movie_45 INT;
DECLARE id_movie_46 INT;
DECLARE id_movie_47 INT;
DECLARE id_movie_48 INT;
DECLARE id_movie_49 INT;
DECLARE id_movie_50 INT;
DECLARE id_movie_51 INT;
DECLARE id_movie_52 INT;
DECLARE id_movie_53 INT;
DECLARE id_movie_54 INT;
DECLARE id_movie_55 INT;
DECLARE id_movie_56 INT;
DECLARE id_movie_57 INT;
DECLARE id_movie_58 INT;
DECLARE id_movie_59 INT;
DECLARE id_movie_60 INT;
DECLARE id_movie_61 INT;
DECLARE id_movie_62 INT;
DECLARE id_movie_63 INT;
DECLARE id_movie_64 INT;
DECLARE id_movie_65 INT;
DECLARE id_movie_66 INT;
DECLARE id_movie_67 INT;
DECLARE id_movie_68 INT;
DECLARE id_movie_69 INT;
DECLARE id_movie_70 INT;
DECLARE id_movie_71 INT;
DECLARE id_movie_72 INT;
DECLARE id_movie_73 INT;
DECLARE id_movie_74 INT;
DECLARE id_movie_75 INT;
DECLARE id_movie_76 INT;
DECLARE id_movie_77 INT;
DECLARE id_movie_78 INT;
DECLARE id_movie_79 INT;
DECLARE id_movie_80 INT;
DECLARE id_movie_81 INT;
DECLARE id_movie_82 INT;
DECLARE id_movie_83 INT;
DECLARE id_movie_84 INT;
DECLARE id_movie_85 INT;
DECLARE id_movie_86 INT;
DECLARE id_movie_87 INT;
DECLARE id_movie_88 INT;
DECLARE id_movie_89 INT;
DECLARE id_movie_90 INT;
DECLARE id_movie_91 INT;
DECLARE id_movie_92 INT;
DECLARE id_movie_93 INT;
DECLARE id_movie_94 INT;
DECLARE id_movie_95 INT;
DECLARE id_movie_96 INT;
DECLARE id_movie_97 INT;
DECLARE id_movie_98 INT;
DECLARE id_movie_99 INT;
DECLARE id_movie_100 INT;
DECLARE id_movie_101 INT;
DECLARE id_movie_102 INT;
DECLARE id_movie_103 INT;
DECLARE id_movie_104 INT;
DECLARE id_movie_105 INT;
DECLARE id_movie_106 INT;
DECLARE id_movie_107 INT;
DECLARE id_movie_108 INT;
DECLARE id_movie_109 INT;
DECLARE id_movie_110 INT;
DECLARE id_movie_111 INT;
DECLARE id_movie_112 INT;
DECLARE id_movie_113 INT;
DECLARE id_movie_114 INT;
DECLARE id_movie_115 INT;
DECLARE id_movie_116 INT;
DECLARE id_movie_117 INT;
DECLARE id_movie_118 INT;
DECLARE id_movie_119 INT;
DECLARE id_movie_120 INT;
DECLARE id_movie_121 INT;
DECLARE id_movie_122 INT;
DECLARE id_movie_123 INT;
DECLARE id_movie_124 INT;
DECLARE id_movie_125 INT;
DECLARE id_movie_126 INT;
DECLARE id_movie_127 INT;
DECLARE id_movie_128 INT;
DECLARE id_movie_129 INT;
DECLARE id_movie_130 INT;
DECLARE id_movie_131 INT;
DECLARE id_movie_132 INT;
DECLARE id_movie_133 INT;
DECLARE id_movie_134 INT;
DECLARE id_movie_135 INT;
DECLARE id_movie_136 INT;
DECLARE id_movie_137 INT;
DECLARE id_movie_138 INT;
DECLARE id_movie_139 INT;
DECLARE id_movie_140 INT;
DECLARE id_movie_141 INT;
DECLARE id_movie_142 INT;
DECLARE id_movie_143 INT;
DECLARE id_movie_144 INT;
DECLARE id_movie_145 INT;
DECLARE id_movie_146 INT;
DECLARE id_movie_147 INT;

BEGIN
	SELECT m.id INTO id_movie_0
	FROM "public.Movies" m
	WHERE m.name = 'Сила страны';

	SELECT m.id INTO id_movie_1
	FROM "public.Movies" m
	WHERE m.name = 'Включая';

	SELECT m.id INTO id_movie_2
	FROM "public.Movies" m
	WHERE m.name = 'Бал год';

	SELECT m.id INTO id_movie_3
	FROM "public.Movies" m
	WHERE m.name = 'Определять';

	SELECT m.id INTO id_movie_4
	FROM "public.Movies" m
	WHERE m.name = 'Офицер вполне';

	SELECT m.id INTO id_movie_5
	FROM "public.Movies" m
	WHERE m.name = 'Последний официальный точно';

	SELECT m.id INTO id_movie_6
	FROM "public.Movies" m
	WHERE m.name = 'За организационным искусством';

	SELECT m.id INTO id_movie_7
	FROM "public.Movies" m
	WHERE m.name = 'Тип семейства';

	SELECT m.id INTO id_movie_8
	FROM "public.Movies" m
	WHERE m.name = 'Отец смены станции';

	SELECT m.id INTO id_movie_9
	FROM "public.Movies" m
	WHERE m.name = 'Запад';

	SELECT m.id INTO id_movie_10
	FROM "public.Movies" m
	WHERE m.name = 'Знакомство с природой';

	SELECT m.id INTO id_movie_11
	FROM "public.Movies" m
	WHERE m.name = 'Теперь даже';

	SELECT m.id INTO id_movie_12
	FROM "public.Movies" m
	WHERE m.name = 'Другие тоже сами';

	SELECT m.id INTO id_movie_13
	FROM "public.Movies" m
	WHERE m.name = 'Этот адвокат по заданию';

	SELECT m.id INTO id_movie_14
	FROM "public.Movies" m
	WHERE m.name = 'Окно сто индивидуальное';

	SELECT m.id INTO id_movie_15
	FROM "public.Movies" m
	WHERE m.name = 'Встряхнуть администрацию';

	SELECT m.id INTO id_movie_16
	FROM "public.Movies" m
	WHERE m.name = 'Школа разумного возраста';

	SELECT m.id INTO id_movie_17
	FROM "public.Movies" m
	WHERE m.name = 'Усилие определенного ветра';

	SELECT m.id INTO id_movie_18
	FROM "public.Movies" m
	WHERE m.name = 'Прогулочное стекло';

	SELECT m.id INTO id_movie_19
	FROM "public.Movies" m
	WHERE m.name = 'К';

	SELECT m.id INTO id_movie_20
	FROM "public.Movies" m
	WHERE m.name = 'Достигать';

	SELECT m.id INTO id_movie_21
	FROM "public.Movies" m
	WHERE m.name = 'Место, желающее место';

	SELECT m.id INTO id_movie_22
	FROM "public.Movies" m
	WHERE m.name = 'Религиозный демократ';

	SELECT m.id INTO id_movie_23
	FROM "public.Movies" m
	WHERE m.name = 'Позволять';

	SELECT m.id INTO id_movie_24
	FROM "public.Movies" m
	WHERE m.name = 'Брат часть средняя';

	SELECT m.id INTO id_movie_25
	FROM "public.Movies" m
	WHERE m.name = 'Семья';

	SELECT m.id INTO id_movie_26
	FROM "public.Movies" m
	WHERE m.name = 'Эксперт';

	SELECT m.id INTO id_movie_27
	FROM "public.Movies" m
	WHERE m.name = 'Означает поддержку когда-либо';

	SELECT m.id INTO id_movie_28
	FROM "public.Movies" m
	WHERE m.name = 'Определить, определить вид';

	SELECT m.id INTO id_movie_29
	FROM "public.Movies" m
	WHERE m.name = 'Земля';

	SELECT m.id INTO id_movie_30
	FROM "public.Movies" m
	WHERE m.name = 'Особо светлый';

	SELECT m.id INTO id_movie_31
	FROM "public.Movies" m
	WHERE m.name = 'Ничего не упоминай, наш';

	SELECT m.id INTO id_movie_32
	FROM "public.Movies" m
	WHERE m.name = 'Добрый или';

	SELECT m.id INTO id_movie_33
	FROM "public.Movies" m
	WHERE m.name = 'Знак суммы момента';

	SELECT m.id INTO id_movie_34
	FROM "public.Movies" m
	WHERE m.name = 'Все вылезает наружу';

	SELECT m.id INTO id_movie_35
	FROM "public.Movies" m
	WHERE m.name = 'Простая кампания';

	SELECT m.id INTO id_movie_36
	FROM "public.Movies" m
	WHERE m.name = 'Существующее решение';

	SELECT m.id INTO id_movie_37
	FROM "public.Movies" m
	WHERE m.name = 'Обращаться';

	SELECT m.id INTO id_movie_38
	FROM "public.Movies" m
	WHERE m.name = 'Поздно счастлив';

	SELECT m.id INTO id_movie_39
	FROM "public.Movies" m
	WHERE m.name = 'Середина';

	SELECT m.id INTO id_movie_40
	FROM "public.Movies" m
	WHERE m.name = 'Работа';

	SELECT m.id INTO id_movie_41
	FROM "public.Movies" m
	WHERE m.name = 'Никогда не режь';

	SELECT m.id INTO id_movie_42
	FROM "public.Movies" m
	WHERE m.name = 'Введите другой';

	SELECT m.id INTO id_movie_43
	FROM "public.Movies" m
	WHERE m.name = 'Признайся во всем';

	SELECT m.id INTO id_movie_44
	FROM "public.Movies" m
	WHERE m.name = 'Муж';

	SELECT m.id INTO id_movie_45
	FROM "public.Movies" m
	WHERE m.name = 'Если страдать';

	SELECT m.id INTO id_movie_46
	FROM "public.Movies" m
	WHERE m.name = 'Возможно, сначала';

	SELECT m.id INTO id_movie_47
	FROM "public.Movies" m
	WHERE m.name = 'Набор отчетов';

	SELECT m.id INTO id_movie_48
	FROM "public.Movies" m
	WHERE m.name = 'С';

	SELECT m.id INTO id_movie_49
	FROM "public.Movies" m
	WHERE m.name = 'Влияние на сайт';

	SELECT m.id INTO id_movie_50
	FROM "public.Movies" m
	WHERE m.name = 'По появлению';

	SELECT m.id INTO id_movie_51
	FROM "public.Movies" m
	WHERE m.name = 'Все вызывают';

	SELECT m.id INTO id_movie_52
	FROM "public.Movies" m
	WHERE m.name = 'Часовое здание';

	SELECT m.id INTO id_movie_53
	FROM "public.Movies" m
	WHERE m.name = 'Ответь хотя подумай';

	SELECT m.id INTO id_movie_54
	FROM "public.Movies" m
	WHERE m.name = 'Надеяться';

	SELECT m.id INTO id_movie_55
	FROM "public.Movies" m
	WHERE m.name = 'Разница';

	SELECT m.id INTO id_movie_56
	FROM "public.Movies" m
	WHERE m.name = 'Позже';

	SELECT m.id INTO id_movie_57
	FROM "public.Movies" m
	WHERE m.name = 'Все может быть';

	SELECT m.id INTO id_movie_58
	FROM "public.Movies" m
	WHERE m.name = 'Север';

	SELECT m.id INTO id_movie_59
	FROM "public.Movies" m
	WHERE m.name = 'Голосуйте за ту же часть';

	SELECT m.id INTO id_movie_60
	FROM "public.Movies" m
	WHERE m.name = 'Поинт-команда';

	SELECT m.id INTO id_movie_61
	FROM "public.Movies" m
	WHERE m.name = 'Расходы';

	SELECT m.id INTO id_movie_62
	FROM "public.Movies" m
	WHERE m.name = 'Одно целое раскрытие';

	SELECT m.id INTO id_movie_63
	FROM "public.Movies" m
	WHERE m.name = 'Трудно идентифицировать';

	SELECT m.id INTO id_movie_64
	FROM "public.Movies" m
	WHERE m.name = 'Беспокоите нас';

	SELECT m.id INTO id_movie_65
	FROM "public.Movies" m
	WHERE m.name = 'Еще';

	SELECT m.id INTO id_movie_66
	FROM "public.Movies" m
	WHERE m.name = 'Один раз';

	SELECT m.id INTO id_movie_67
	FROM "public.Movies" m
	WHERE m.name = 'Иностранный довольно';

	SELECT m.id INTO id_movie_68
	FROM "public.Movies" m
	WHERE m.name = 'Беспокойство';

	SELECT m.id INTO id_movie_69
	FROM "public.Movies" m
	WHERE m.name = 'Чувство атаки читать';

	SELECT m.id INTO id_movie_70
	FROM "public.Movies" m
	WHERE m.name = 'Явный рост производства';

	SELECT m.id INTO id_movie_71
	FROM "public.Movies" m
	WHERE m.name = 'Миссис Мейн Муха';

	SELECT m.id INTO id_movie_72
	FROM "public.Movies" m
	WHERE m.name = 'Вытащите студента';

	SELECT m.id INTO id_movie_73
	FROM "public.Movies" m
	WHERE m.name = 'Фонд мира';

	SELECT m.id INTO id_movie_74
	FROM "public.Movies" m
	WHERE m.name = 'Требовать';

	SELECT m.id INTO id_movie_75
	FROM "public.Movies" m
	WHERE m.name = 'Купить';

	SELECT m.id INTO id_movie_76
	FROM "public.Movies" m
	WHERE m.name = 'Современные другие учат';

	SELECT m.id INTO id_movie_77
	FROM "public.Movies" m
	WHERE m.name = 'Люди';

	SELECT m.id INTO id_movie_78
	FROM "public.Movies" m
	WHERE m.name = 'Медицинский брат, да';

	SELECT m.id INTO id_movie_79
	FROM "public.Movies" m
	WHERE m.name = 'Медицинское сообщество';

	SELECT m.id INTO id_movie_80
	FROM "public.Movies" m
	WHERE m.name = 'Вообще-то, отдохни после обеда';

	SELECT m.id INTO id_movie_81
	FROM "public.Movies" m
	WHERE m.name = 'Служить';

	SELECT m.id INTO id_movie_82
	FROM "public.Movies" m
	WHERE m.name = 'Нация его поперек';

	SELECT m.id INTO id_movie_83
	FROM "public.Movies" m
	WHERE m.name = 'Живой мальчик, звук';

	SELECT m.id INTO id_movie_84
	FROM "public.Movies" m
	WHERE m.name = 'Большой';

	SELECT m.id INTO id_movie_85
	FROM "public.Movies" m
	WHERE m.name = 'Агент по отцу';

	SELECT m.id INTO id_movie_86
	FROM "public.Movies" m
	WHERE m.name = 'Медицинский там, потому что';

	SELECT m.id INTO id_movie_87
	FROM "public.Movies" m
	WHERE m.name = 'Синие наши они';

	SELECT m.id INTO id_movie_88
	FROM "public.Movies" m
	WHERE m.name = 'Вести';

	SELECT m.id INTO id_movie_89
	FROM "public.Movies" m
	WHERE m.name = 'Потерять магазин вечером';

	SELECT m.id INTO id_movie_90
	FROM "public.Movies" m
	WHERE m.name = 'Характер';

	SELECT m.id INTO id_movie_91
	FROM "public.Movies" m
	WHERE m.name = 'Кровать говорит бит';

	SELECT m.id INTO id_movie_92
	FROM "public.Movies" m
	WHERE m.name = 'Вскоре компьютер и';

	SELECT m.id INTO id_movie_93
	FROM "public.Movies" m
	WHERE m.name = 'Две войны';

	SELECT m.id INTO id_movie_94
	FROM "public.Movies" m
	WHERE m.name = 'Мог распознать';

	SELECT m.id INTO id_movie_95
	FROM "public.Movies" m
	WHERE m.name = 'Поднимись, слушай';

	SELECT m.id INTO id_movie_96
	FROM "public.Movies" m
	WHERE m.name = 'День национального генерала';

	SELECT m.id INTO id_movie_97
	FROM "public.Movies" m
	WHERE m.name = 'Петь';

	SELECT m.id INTO id_movie_98
	FROM "public.Movies" m
	WHERE m.name = 'Каждое близкое открытие';

	SELECT m.id INTO id_movie_99
	FROM "public.Movies" m
	WHERE m.name = 'Угроза, которой мы служим';

	SELECT m.id INTO id_movie_100
	FROM "public.Movies" m
	WHERE m.name = 'Мировая сумка-машина';

	SELECT m.id INTO id_movie_101
	FROM "public.Movies" m
	WHERE m.name = 'Бесплатно';

	SELECT m.id INTO id_movie_102
	FROM "public.Movies" m
	WHERE m.name = 'Коробка';

	SELECT m.id INTO id_movie_103
	FROM "public.Movies" m
	WHERE m.name = 'Вода';

	SELECT m.id INTO id_movie_104
	FROM "public.Movies" m
	WHERE m.name = 'Класс закрыть';

	SELECT m.id INTO id_movie_105
	FROM "public.Movies" m
	WHERE m.name = 'Энергия';

	SELECT m.id INTO id_movie_106
	FROM "public.Movies" m
	WHERE m.name = 'Впереди опыт брата';

	SELECT m.id INTO id_movie_107
	FROM "public.Movies" m
	WHERE m.name = 'Различный';

	SELECT m.id INTO id_movie_108
	FROM "public.Movies" m
	WHERE m.name = 'Никогда';

	SELECT m.id INTO id_movie_109
	FROM "public.Movies" m
	WHERE m.name = 'Вещи';

	SELECT m.id INTO id_movie_110
	FROM "public.Movies" m
	WHERE m.name = 'Почувствуйте, опишите производство';

	SELECT m.id INTO id_movie_111
	FROM "public.Movies" m
	WHERE m.name = 'Ударять';

	SELECT m.id INTO id_movie_112
	FROM "public.Movies" m
	WHERE m.name = 'Сами благодарю';

	SELECT m.id INTO id_movie_113
	FROM "public.Movies" m
	WHERE m.name = 'Кажется, имя успешное';

	SELECT m.id INTO id_movie_114
	FROM "public.Movies" m
	WHERE m.name = 'Рынок другой';

	SELECT m.id INTO id_movie_115
	FROM "public.Movies" m
	WHERE m.name = 'Колледжский мяч.';

	SELECT m.id INTO id_movie_116
	FROM "public.Movies" m
	WHERE m.name = 'До';

	SELECT m.id INTO id_movie_117
	FROM "public.Movies" m
	WHERE m.name = 'Помнить';

	SELECT m.id INTO id_movie_118
	FROM "public.Movies" m
	WHERE m.name = 'Дом';

	SELECT m.id INTO id_movie_119
	FROM "public.Movies" m
	WHERE m.name = 'Каждому достаточно, как';

	SELECT m.id INTO id_movie_120
	FROM "public.Movies" m
	WHERE m.name = 'Сохранить пропуск';

	SELECT m.id INTO id_movie_121
	FROM "public.Movies" m
	WHERE m.name = 'Общество войной';

	SELECT m.id INTO id_movie_122
	FROM "public.Movies" m
	WHERE m.name = 'Сегодня вечером';

	SELECT m.id INTO id_movie_123
	FROM "public.Movies" m
	WHERE m.name = 'Цена двух попыток';

	SELECT m.id INTO id_movie_124
	FROM "public.Movies" m
	WHERE m.name = 'Сад';

	SELECT m.id INTO id_movie_125
	FROM "public.Movies" m
	WHERE m.name = 'Готовься пиши';

	SELECT m.id INTO id_movie_126
	FROM "public.Movies" m
	WHERE m.name = 'До внимания';

	SELECT m.id INTO id_movie_127
	FROM "public.Movies" m
	WHERE m.name = 'Спорить, раскрывать';

	SELECT m.id INTO id_movie_128
	FROM "public.Movies" m
	WHERE m.name = 'Церковь';

	SELECT m.id INTO id_movie_129
	FROM "public.Movies" m
	WHERE m.name = 'Как оставаться политикой';

	SELECT m.id INTO id_movie_130
	FROM "public.Movies" m
	WHERE m.name = 'Конец';

	SELECT m.id INTO id_movie_131
	FROM "public.Movies" m
	WHERE m.name = 'Служить производительности создавать';

	SELECT m.id INTO id_movie_132
	FROM "public.Movies" m
	WHERE m.name = 'Красивый подъем';

	SELECT m.id INTO id_movie_133
	FROM "public.Movies" m
	WHERE m.name = 'Готовый';

	SELECT m.id INTO id_movie_134
	FROM "public.Movies" m
	WHERE m.name = 'Вариант генерала его';

	SELECT m.id INTO id_movie_135
	FROM "public.Movies" m
	WHERE m.name = 'Жестко их';

	SELECT m.id INTO id_movie_136
	FROM "public.Movies" m
	WHERE m.name = 'Кусочек';

	SELECT m.id INTO id_movie_137
	FROM "public.Movies" m
	WHERE m.name = 'Навык кровати поздно';

	SELECT m.id INTO id_movie_138
	FROM "public.Movies" m
	WHERE m.name = 'Продолжить аналогичную сторону';

	SELECT m.id INTO id_movie_139
	FROM "public.Movies" m
	WHERE m.name = 'Авторитетное присоединение';

	SELECT m.id INTO id_movie_140
	FROM "public.Movies" m
	WHERE m.name = 'Причина кожи';

	SELECT m.id INTO id_movie_141
	FROM "public.Movies" m
	WHERE m.name = 'Сестре конец, потому что';

	SELECT m.id INTO id_movie_142
	FROM "public.Movies" m
	WHERE m.name = 'Дизайн друга';

	SELECT m.id INTO id_movie_143
	FROM "public.Movies" m
	WHERE m.name = 'Музыка Миссис';

	SELECT m.id INTO id_movie_144
	FROM "public.Movies" m
	WHERE m.name = 'Количество';

	SELECT m.id INTO id_movie_145
	FROM "public.Movies" m
	WHERE m.name = 'Предлагать';

	SELECT m.id INTO id_movie_146
	FROM "public.Movies" m
	WHERE m.name = 'Ну представьте себе';

	SELECT m.id INTO id_movie_147
	FROM "public.Movies" m
	WHERE m.name = 'Особенно';

	INSERT INTO "public.Pictures_movie" (movie_id, "isMain", ref) VALUES
		(id_movie_0, 'True', 'https://dummyimage.com/673x734'),
		(id_movie_1, 'True', 'https://placekitten.com/911/1'),
		(id_movie_2, 'True', 'https://placekitten.com/493/405'),
		(id_movie_3, 'True', 'https://placekitten.com/453/97'),
		(id_movie_4, 'True', 'https://picsum.photos/612/744'),
		(id_movie_5, 'True', 'https://dummyimage.com/112x970'),
		(id_movie_6, 'True', 'https://picsum.photos/674/411'),
		(id_movie_7, 'True', 'https://placekitten.com/713/494'),
		(id_movie_8, 'True', 'https://dummyimage.com/654x347'),
		(id_movie_9, 'True', 'https://dummyimage.com/725x847'),
		(id_movie_10, 'True', 'https://placekitten.com/954/480'),
		(id_movie_11, 'True', 'https://placekitten.com/239/110'),
		(id_movie_12, 'True', 'https://picsum.photos/640/988'),
		(id_movie_13, 'True', 'https://dummyimage.com/490x667'),
		(id_movie_14, 'True', 'https://dummyimage.com/367x129'),
		(id_movie_15, 'True', 'https://dummyimage.com/679x413'),
		(id_movie_16, 'True', 'https://dummyimage.com/583x660'),
		(id_movie_17, 'True', 'https://picsum.photos/391/194'),
		(id_movie_18, 'True', 'https://placekitten.com/358/109'),
		(id_movie_19, 'True', 'https://dummyimage.com/432x736'),
		(id_movie_20, 'True', 'https://placekitten.com/904/983'),
		(id_movie_21, 'True', 'https://placekitten.com/535/567'),
		(id_movie_22, 'True', 'https://picsum.photos/10/426'),
		(id_movie_23, 'True', 'https://picsum.photos/966/909'),
		(id_movie_24, 'True', 'https://picsum.photos/879/802'),
		(id_movie_25, 'True', 'https://placekitten.com/168/787'),
		(id_movie_26, 'True', 'https://picsum.photos/688/753'),
		(id_movie_27, 'True', 'https://dummyimage.com/718x178'),
		(id_movie_28, 'True', 'https://picsum.photos/84/128'),
		(id_movie_29, 'True', 'https://placekitten.com/110/264'),
		(id_movie_30, 'True', 'https://picsum.photos/662/105'),
		(id_movie_31, 'True', 'https://placekitten.com/404/800'),
		(id_movie_32, 'True', 'https://dummyimage.com/872x704'),
		(id_movie_33, 'True', 'https://placekitten.com/979/432'),
		(id_movie_34, 'True', 'https://placekitten.com/17/91'),
		(id_movie_35, 'True', 'https://picsum.photos/234/166'),
		(id_movie_36, 'True', 'https://dummyimage.com/500x45'),
		(id_movie_37, 'True', 'https://dummyimage.com/156x798'),
		(id_movie_38, 'True', 'https://placekitten.com/801/799'),
		(id_movie_39, 'True', 'https://dummyimage.com/199x257'),
		(id_movie_40, 'True', 'https://placekitten.com/40/729'),
		(id_movie_41, 'True', 'https://picsum.photos/61/699'),
		(id_movie_42, 'True', 'https://dummyimage.com/844x154'),
		(id_movie_43, 'True', 'https://dummyimage.com/234x553'),
		(id_movie_44, 'True', 'https://placekitten.com/924/765'),
		(id_movie_45, 'True', 'https://placekitten.com/729/979'),
		(id_movie_46, 'True', 'https://dummyimage.com/564x291'),
		(id_movie_47, 'True', 'https://placekitten.com/54/753'),
		(id_movie_48, 'True', 'https://dummyimage.com/404x997'),
		(id_movie_49, 'True', 'https://placekitten.com/442/86'),
		(id_movie_50, 'True', 'https://placekitten.com/968/486'),
		(id_movie_51, 'True', 'https://dummyimage.com/894x55'),
		(id_movie_52, 'True', 'https://dummyimage.com/92x111'),
		(id_movie_53, 'True', 'https://picsum.photos/192/637'),
		(id_movie_54, 'True', 'https://picsum.photos/718/762'),
		(id_movie_55, 'True', 'https://placekitten.com/936/632'),
		(id_movie_56, 'True', 'https://picsum.photos/816/105'),
		(id_movie_57, 'True', 'https://placekitten.com/59/663'),
		(id_movie_58, 'True', 'https://placekitten.com/37/108'),
		(id_movie_59, 'True', 'https://picsum.photos/35/973'),
		(id_movie_60, 'True', 'https://dummyimage.com/329x1018'),
		(id_movie_61, 'True', 'https://placekitten.com/822/358'),
		(id_movie_62, 'True', 'https://dummyimage.com/691x215'),
		(id_movie_63, 'True', 'https://dummyimage.com/978x189'),
		(id_movie_64, 'True', 'https://dummyimage.com/566x936'),
		(id_movie_65, 'True', 'https://placekitten.com/649/755'),
		(id_movie_66, 'True', 'https://dummyimage.com/886x17'),
		(id_movie_67, 'True', 'https://picsum.photos/390/82'),
		(id_movie_68, 'True', 'https://dummyimage.com/520x587'),
		(id_movie_69, 'True', 'https://picsum.photos/103/938'),
		(id_movie_70, 'True', 'https://dummyimage.com/226x630'),
		(id_movie_71, 'True', 'https://placekitten.com/741/933'),
		(id_movie_72, 'True', 'https://placekitten.com/294/68'),
		(id_movie_73, 'True', 'https://picsum.photos/942/851'),
		(id_movie_74, 'True', 'https://placekitten.com/929/909'),
		(id_movie_75, 'True', 'https://placekitten.com/250/987'),
		(id_movie_76, 'True', 'https://picsum.photos/658/401'),
		(id_movie_77, 'True', 'https://placekitten.com/844/141'),
		(id_movie_78, 'True', 'https://placekitten.com/471/241'),
		(id_movie_79, 'True', 'https://dummyimage.com/40x304'),
		(id_movie_80, 'True', 'https://placekitten.com/800/822'),
		(id_movie_81, 'True', 'https://placekitten.com/259/855'),
		(id_movie_82, 'True', 'https://placekitten.com/978/517'),
		(id_movie_83, 'True', 'https://dummyimage.com/122x949'),
		(id_movie_84, 'True', 'https://placekitten.com/509/309'),
		(id_movie_85, 'True', 'https://picsum.photos/927/72'),
		(id_movie_86, 'True', 'https://dummyimage.com/199x451'),
		(id_movie_87, 'True', 'https://dummyimage.com/823x998'),
		(id_movie_88, 'True', 'https://picsum.photos/154/607'),
		(id_movie_89, 'True', 'https://dummyimage.com/958x966'),
		(id_movie_90, 'True', 'https://placekitten.com/669/696'),
		(id_movie_91, 'True', 'https://dummyimage.com/819x253'),
		(id_movie_92, 'True', 'https://placekitten.com/791/731'),
		(id_movie_93, 'True', 'https://dummyimage.com/997x39'),
		(id_movie_94, 'True', 'https://placekitten.com/989/231'),
		(id_movie_95, 'True', 'https://picsum.photos/881/459'),
		(id_movie_96, 'True', 'https://placekitten.com/783/268'),
		(id_movie_97, 'True', 'https://dummyimage.com/86x665'),
		(id_movie_98, 'True', 'https://picsum.photos/785/321'),
		(id_movie_99, 'True', 'https://picsum.photos/843/971'),
		(id_movie_100, 'True', 'https://dummyimage.com/555x323'),
		(id_movie_101, 'True', 'https://placekitten.com/537/237'),
		(id_movie_102, 'True', 'https://placekitten.com/150/847'),
		(id_movie_103, 'True', 'https://picsum.photos/909/679'),
		(id_movie_104, 'True', 'https://placekitten.com/642/168'),
		(id_movie_105, 'True', 'https://placekitten.com/747/628'),
		(id_movie_106, 'True', 'https://placekitten.com/963/52'),
		(id_movie_107, 'True', 'https://placekitten.com/956/613'),
		(id_movie_108, 'True', 'https://placekitten.com/363/746'),
		(id_movie_109, 'True', 'https://picsum.photos/217/446'),
		(id_movie_110, 'True', 'https://placekitten.com/529/614'),
		(id_movie_111, 'True', 'https://placekitten.com/471/262'),
		(id_movie_112, 'True', 'https://dummyimage.com/403x960'),
		(id_movie_113, 'True', 'https://dummyimage.com/712x96'),
		(id_movie_114, 'True', 'https://picsum.photos/288/762'),
		(id_movie_115, 'True', 'https://dummyimage.com/451x778'),
		(id_movie_116, 'True', 'https://placekitten.com/302/238'),
		(id_movie_117, 'True', 'https://picsum.photos/189/13'),
		(id_movie_118, 'True', 'https://dummyimage.com/581x543'),
		(id_movie_119, 'True', 'https://picsum.photos/658/663'),
		(id_movie_120, 'True', 'https://dummyimage.com/506x526'),
		(id_movie_121, 'True', 'https://picsum.photos/106/866'),
		(id_movie_122, 'True', 'https://placekitten.com/595/435'),
		(id_movie_123, 'True', 'https://dummyimage.com/924x266'),
		(id_movie_124, 'True', 'https://dummyimage.com/1011x535'),
		(id_movie_125, 'True', 'https://picsum.photos/34/14'),
		(id_movie_126, 'True', 'https://dummyimage.com/598x43'),
		(id_movie_127, 'True', 'https://dummyimage.com/224x355'),
		(id_movie_128, 'True', 'https://picsum.photos/917/807'),
		(id_movie_129, 'True', 'https://placekitten.com/374/380'),
		(id_movie_130, 'True', 'https://picsum.photos/733/233'),
		(id_movie_131, 'True', 'https://dummyimage.com/879x581'),
		(id_movie_132, 'True', 'https://picsum.photos/690/20'),
		(id_movie_133, 'True', 'https://dummyimage.com/545x1013'),
		(id_movie_134, 'True', 'https://placekitten.com/75/201'),
		(id_movie_135, 'True', 'https://placekitten.com/459/354'),
		(id_movie_136, 'True', 'https://placekitten.com/872/492'),
		(id_movie_137, 'True', 'https://picsum.photos/313/922'),
		(id_movie_138, 'True', 'https://placekitten.com/905/237'),
		(id_movie_139, 'True', 'https://dummyimage.com/391x960'),
		(id_movie_140, 'True', 'https://picsum.photos/262/768'),
		(id_movie_68, 'True', 'https://placekitten.com/248/482'),
		(id_movie_141, 'True', 'https://placekitten.com/851/489'),
		(id_movie_142, 'True', 'https://dummyimage.com/770x643'),
		(id_movie_143, 'True', 'https://dummyimage.com/617x409'),
		(id_movie_144, 'True', 'https://dummyimage.com/288x980'),
		(id_movie_145, 'True', 'https://dummyimage.com/1000x107'),
		(id_movie_146, 'True', 'https://placekitten.com/740/184'),
		(id_movie_147, 'True', 'https://picsum.photos/713/515');
END $$;


INSERT INTO "public.Film_crew_members" (name, birthday, birthplace, height) VALUES
	('Мисти Бун','1970-05-13','Екатеринфурт, Черногория',146),
	('Роберт Тайлер','1949-03-13','Кассандрашир, Албания',178),
	('Мари Меркадо','1971-10-10','Чапманстад, Гондурас',169),
	('Рассел Адамс','1977-04-09','Бинхейвен, Зимбабве',152),
	('Майкл Уэйд','2000-11-08','Западный Эндрюленд, Уоллис и Футуна',146),
	('Эми Гилл','1959-06-22','Вест-Стейси, Камерун',192),
	('Лиза Валенсуэла','1985-03-09','Франсистаун, Колумбия',204),
	('Лори Джордан','1983-05-05','Маршаллмут, Южная Африка',187),
	('Дэниел Джонсон','1997-03-29','Винсентбург, Панама',210),
	('Дэвид Диас','1958-03-21','Восточный Джошуа, Нигерия',162),
	('Тоня Родригес','1957-08-14','Дженниферпорт, Йемен',192),
	('Алекс Гарза','1961-12-10','Брайанмут, Острова Кука',143),
	('Сара Чавес','1991-04-15','Порт Доннамут, Турция',140),
	('Джошуа Фелпс','1977-08-03','Вест-Марк, Лаосская Народно-Демократическая Республика',186),
	('Джереми Хэнсон','1994-10-26','Западный Николеленд, Сент-Китс и Невис',151),
	('Дженнифер Вебер','1978-06-09','Ризтон, Остров Буве (Буветойя)',189),
	('Маргарет Майлз','1977-02-11','Клементстон, Ливан',144),
	('Бриана Гарретт','1964-05-18','Дженнатон, Гондурас',205),
	('Реджина Фелпс','1965-10-17','Уэст-Закари, Кот-дИвуар',194),
	('Джейми Браун','1972-04-13','Порт-Даррелл, Малави',191),
	('Габриэль Гонсалес','1994-08-20','Южный Джоннихейвен, Мавритания',198),
	('Томас Ли','1962-05-26','Холденмут, Ирландия',174),
	('Элизабет Хендерсон','1950-07-22','Роуччестер, Молдова',194),
	('Томас Медина','1946-09-05','Сандратаун, Лаосская Народно-Демократическая Республика',143),
	('Кристин Кальдерон','1997-05-15','Южный Шон, Чили',169),
	('Тимоти Моралес','1959-04-29','Корисайд, Остров Буве (Буветойя)',177),
	('Марк Дэвис','1984-06-29','Гонсалесстад, Джорджия',195),
	('Кортни Купер','1968-02-22','Озеро Майклшир, Монтсеррат',176),
	('Робин Гудман','1975-06-15','Озеро Мариаленд, Словакия (Словацкая Республика)',163),
	('Шелли Вагнер','1983-07-18','Колонмут, Новая Каледония',157),
	('Дерек Бонд','1986-05-20','Вильянуэвапорт, Ямайка',154),
	('Эрин Буш','1956-08-09','Перезшир, остров Мэн',208),
	('Кортни Эллиотт','1946-06-20','Памелапорт, Бурунди',146),
	('Мелисса Роу','1993-04-29','Нью-Шаронстад, Гана',162),
	('Джерри Родригес','1955-09-20','Норт-Эшлипорт, Филиппины',174),
	('Бенджамин Буш','1977-08-03','Аннаборо, Бермуды',145),
	('Майкл Батлер','1966-06-26','Восточный Кристианхейвен, Эстония',145),
	('Алан Аллен','1981-11-04','Джонсонмут, Либерия',202),
	('Джейкоб Принс','1977-05-21','Северный Адамфурт, Мозамбик',155),
	('Джанет Шепард','1968-10-03','Нью-Закари, Того',206),
	('Кайла Комбс','1945-10-08','Вест Роберт, Эритрея',150),
	('Бенджамин Чен','1954-12-07','Северный Чадборо, остров Норфолк',174),
	('Роберт Майкл','1961-07-30','Джамифурт, Кипр',160),
	('Ребекка Шаффер','1976-02-03','Келлишир, Габон',143),
	('Мария Келлер','1991-04-26','Норт-Холли, Вануату',156),
	('Диана Андерсон','1965-05-29','Дрейкмут, Острова Кука',198),
	('Майкл Кабрера','1974-05-25','Джойбург, Чад',171),
	('Келли Баллок','1961-07-21','Вест-Джеймс, Хорватия',165),
	('Мишель Джонсон','1994-06-02','Южный Келсиберг, Тувалу',186),
	('Кэрри Генри','1996-03-02','Озеро Кассандра, Гвинея',174),
	('Паула Стронг','1969-01-15','Северный Закари, Антарктида (территория южнее 60 град. ю.ш.)',157),
	('Дэвид Адамс','1966-02-18','Вильянуэвамут, Гаити',148),
	('Лиза Торрес','1972-02-28','Восточный Натан, Фолклендские (Мальвинские) острова',178),
	('Кристал Лоу','1963-11-08','Домингесбери, Франция',170),
	('Эмили Галлахер','1990-07-26','Меганбери, Турция',190),
	('Уильям Уильямс','1958-09-20','Ротфорт, Тунис',177),
	('Грегори Мартинес','1969-02-25','Южный Холливиль, Камерун',150),
	('Маргарет Райт','1962-12-27','Озеро Шаронфурт, Казахстан',144),
	('Патрисия Кросби','1958-12-07','Нью-Денизленд, Греция',185),
	('Кайла Янг','1994-10-27','Норт-Донна, Тувалу',183),
	('Алан Грин','1990-05-10','Джонсонвью, Эстония',156),
	('Эдуардо Джонсон','1975-10-21','Уилсоншир, Палестинская территория',147),
	('Линда Филлипс','1994-06-28','Ороскохавен, Тувалу',179),
	('Кэтрин Холт','1947-12-22','Томасленд, Сейшельские острова',187),
	('Кристофер Тейлор','1946-06-25','Южный Робертвью, Северная Македония',183),
	('Джессика Дэвис','1986-01-15','Нью-Закари, Филиппины',202),
	('Джилл Томас','1967-05-13','Эндрюленд, Коста-Рика',145),
	('Рене Дэвис','1964-02-25','Озеро Майклленд, Замбия',167),
	('Стивен Купер','1984-02-02','Тройстад, Тонга',187),
	('Скотт Стэнли','1987-10-10','Сандичестер, Австрия',145),
	('Тэмми Ким','1977-04-20','Джастинхейвен, Пуэрто-Рико',179),
	('Венди Эскобар','1967-11-05','Анитахавен, Суринам',164),
	('Роберт Петерсон','1956-06-14','Шаронберг, Лесото',174),
	('Джордж Франк','1994-05-22','Дебравиль, Острова Кука',173),
	('Дэниел Родригес мл.','1974-06-18','Янгстад, Таиланд',190),
	('Лэнс Брайан','1963-04-03','Озеро Майкл, Французская Гвиана',165),
	('Бет Гарсия','1992-12-23','Кристоферстад, Афганистан',176),
	('Кеннет Харви','1948-01-14','Санчесмут, Франция',148),
	('Эдвард Холмс','1956-02-18','Уоллесестад, Нидерландские Антильские острова',208),
	('Александра Мартинес','1995-11-22','Даниэльланд, Финляндия',202),
	('Мелисса Вуд','1995-04-15','Дженкинсмут, Никарагуа',204),
	('Джастин Уокер','1998-04-09','Бендермут, Камбоджа',159),
	('Филип Петерсон','1969-08-25','Бауэрсленд, остров Норфолк',190),
	('Рэнди Дженкинс','1988-01-25','Ист-Мишельхейвен, Палестинская территория',150),
	('Натаниэль Монтгомери','1979-03-13','Нью-Джон, Мальдивы',210),
	('Виктория Миллер','1996-05-01','Озеро Кристен, Камбоджа',202),
	('Линда Макинтайр','1988-07-14','Кайлмут, Египет',196),
	('Стивен Джонсон','1995-09-12','Спенсерборо, Турция',170),
	('Сара Сильва','1986-03-21','Линнланд, Монако',168),
	('Дэвид Уилсон','1997-11-26','Северный Лауренберг, Святой Престол (государство Ватикан)',194),
	('Кейтлин Коллиер','1993-08-26','Вест-Эндрю, Беларусь',143),
	('Майкл Джонсон','1988-09-16','Бэнксбери, Сан-Марино',193),
	('Маргарет Вагнер','1958-05-07','Озеро Амандачестер, Таиланд',182),
	('Майкл Камачо','1986-12-24','Нью-Кэтринвью, Самоа',156),
	('Джошуа Николсон','1972-07-06','Ист-Джоан, Венесуэла',185),
	('Стивен Салливан','1983-05-13','Озеро Сараленд, Маврикий',168),
	('Джеффри Фуллер','1997-12-19','Мелиссамут, Ямайка',202),
	('Мелисса Райт','1995-11-01','Кристинтаун, Монтсеррат',188),
	('Пол Джонс','1990-02-13','Южная Ребекка, Португалия',145),
	('Джордж Онейл','1964-12-25','Южный Джерритон, Антарктида (территория южнее 60 град. ю.ш.)',142),
	('Дуглас Миллер','1952-06-09','Остинфурт, Сен-Мартен',200),
	('Андре Джексон','1950-12-17','Озеро Джон, Зимбабве',169),
	('Дженис Перес','1979-01-06','Ангелачестер, Гана',141),
	('Чейз Уолтерс','1996-06-06','Ренемут, Американское Самоа',186),
	('Кэти Леон','1980-02-17','Новый Каренфорт, Сербия',156),
	('Бриттани Фицджеральд','1992-03-27','Новый Роберт, Польша',176),
	('Шон Гонсалес','1949-03-24','Сантон, Коста-Рика',154),
	('Джозеф Уильямсон','1989-01-20','Питтспорт, Науру',194),
	('Уитни Эрнандес','1945-04-03','Вест-Джонбери, Гватемала',199),
	('Элисон Лайонс','1952-03-16','Порт-Ройфорт, Науру',156),
	('Кэролин Моралес','1976-11-17','Южная Патрисия, Индия',167),
	('Кэтрин Трэвис','1951-03-17','Андреамут, Судан',205),
	('Даниэль Эверетт','1959-02-08','Южный Кристианфорт, Гамбия',196),
	('Кэссиди Блейк','1978-07-13','Дженниферберг, Доминика',181),
	('Хуан Бриджес','1999-09-04','Ист-Донбург, Мексика',158),
	('Майкл Уоттс','1972-08-08','Западный Трависфурт, Кения',163),
	('Эмили Хаффман','1999-05-20','Стивенленд, Сент-Люсия',170),
	('Брэндон Хайден','1984-02-10','Джонстад, Сомали',190),
	('Эшли Адамс','1967-10-19','Восточный Томасфурт, Мозамбик',187),
	('Питер Бест','1973-07-06','Порт-Кристофер, Тайвань',154),
	('Бриттни Филлипс','1955-07-15','Колинтаун, США',174),
	('Альберт Вудс','1976-01-22','Вест-Стефани, Замбия',197),
	('Роберт Пейдж','1996-04-22','Холландмут, Монако',147),
	('Закари Бартлетт','1972-11-29','Южный Джессикафорт, Сен-Бартелеми',206),
	('Эмбер Ривера','1967-05-03','Лимут, Швейцария',144),
	('Кэрол Торрес','1984-06-16','Южный Омарланд, Венесуэла',182),
	('Кэти Бак','1961-07-23','Нью-Сонтон, Тувалу',169),
	('Джеймс Уайт','1953-08-19','Южный Кристенпорт, Сен-Мартен',210),
	('Мишель Кляйн','1992-05-08','Попебург, Малайзия',143),
	('Шон Тейт','1983-09-29','Северный Бетланд, Руанда',169),
	('Дэвид Галлоуэй','1959-10-25','Анджелашир, Тонга',143),
	('Мишель Вудс','1984-09-20','Полхейвен, Филиппины',164),
	('Келли Гордон','1978-04-04','Вест-Майкл, Бруней-Даруссалам',201),
	('Кори Джордан','1964-01-08','Порт Кимберли, Беларусь',149),
	('Чарльз Нельсон','1983-10-16','Кимберличестер, Палестинская территория',158),
	('Меган Кларк','1975-12-13','Кайлбург, Мадагаскар',198),
	('Бэйли Уотсон','1950-07-21','Порт-Шерри, остров Мэн',201),
	('Кари Грин','1992-06-18','Эмимут, Буркина-Фасо',142),
	('Дэвид Коллинз','1992-02-18','Джонсонсайд, Монако',206),
	('Джесси Соса','1999-01-15','Вест-Мэри, Израиль',203),
	('Джессика Эдвардс','1961-06-18','Восточный Энтонивилл, Иран',193),
	('Эрик Янг','1963-06-08','Фишертаун, Южные территории Франции',174),
	('Гленн Паркс','1951-05-22','Карпентерстад, остров Херд и острова Макдональда',163),
	('Маркус Росалес','1969-04-14','Мэтьюшир, Российская Федерация',202),
	('Чад Мэйс','1954-08-21','Нью-Марк, Израиль',145),
	('Томми Уильямс','1953-06-22','Озеро Кэтрин, Западная Сахара',183),
	('Джошуа Клэй','1998-11-14','Лангчестер, Гамбия',165),
	('Дэвид Бонд','1968-12-07','Ингрэмхейвен, Италия',156),
	('Фрэнсис Хаус','1987-09-05','Челситон, Пакистан',186),
	('Кристен Мартин','1965-02-24','Додсонмут, Польша',161),
	('Венди Филлипс','1951-04-11','Анначестер, Южная Георгия и Южные Сандвичевы острова',160),
	('Алисса Эдвардс','1961-10-30','Восточный Анитабург, Швейцария',162),
	('Хосе Мартин','1970-07-14','Смитстад, Тринидад и Тобаго',209),
	('Анна Хоу','1954-09-08','Карменпорт, Мальдивы',148),
	('Омар Вудард','1954-09-23','Восточный Бриттнейстад, Британские Виргинские острова',209),
	('Остин Робинсон','1948-08-16','Восточный Джозеф, Судан',143),
	('Марк Джонсон','1986-06-14','Дайертаун, Аруба',148),
	('Рита Макдональд','1957-08-06','Новый Ариэльфорт, Литва',193),
	('Эшли Дэниелс','1991-02-18','Вест-Ричардчестер, Гернси',185),
	('Трэвис Харрис','1981-08-08','Гонсалестаун, Остров Буве (Буветойя)',171),
	('Андре Морс','1981-04-08','Нью-Дэниэлтаун, Виргинские острова США',194),
	('Кэтрин Додсон','1985-10-06','Нансистад, острова Тёркс и Кайкос',159),
	('Джордан Эндрюс','1953-06-22','Хуаресфурт, Словакия (Словацкая Республика)',145),
	('Джейсон Грей','1948-12-15','Норт-Эшли, Гренада',150),
	('Джеймс Хейли','1980-01-01','Уильямбери, Гайана',159),
	('Алекса Браун','1968-03-07','Восточная Натали, Острова Питкэрн',144),
	('Эндрю Хансен','1954-12-29','Рэйчелсайд, Таиланд',188),
	('Кейт Обрайен','1957-12-29','Новая Тереза, Хорватия',209),
	('Донна Гузман','1999-11-06','Шейламут, Мали',170),
	('Кристина Лайонс','1981-09-15','Джонсленд, Таиланд',175),
	('Тара Диас','1960-11-25','Западный Жасминфурт, Острова Питкэрн',161),
	('Лиза Орр','1984-03-29','Озеро Уэслибург, Польша',180),
	('Мелисса Уокер','1962-06-03','Харвейберг, Дания',158),
	('Меган Агирре','1978-02-21','Нью-Аманда, Гватемала',209),
	('Кристофер Барнс','1968-02-04','Восточная Бретаньфурт, Гренада',189),
	('Джошуа Оливер','1989-03-26','Дэррилвью, Сан-Марино',174),
	('Меган Финли','1960-03-04','Мейерсбург, Палау',185),
	('Родни Бреннан','1962-03-05','Паркертон, Северные Марианские острова',140),
	('Лора Джейкобсон','1952-08-17','Нью-Джеймчестер, Тувалу',203),
	('Кэти Хикман','1989-02-18','Вест-Бенджаминтаун, Шри-Ланка',210),
	('Джеффри Уиллис','1981-02-07','Вест Энтони, Гернси',180),
	('Энн Андерсон','1983-06-28','Лориленд, Буркина-Фасо',200),
	('Чарльз Хортон','1946-11-07','Сюзанстад, Маршалловы острова',170),
	('Брук Вудард','1970-02-04','Восточный Хосе, Корея',143),
	('Мишель Кук','1974-04-16','Анджелавью, Мали',153),
	('Брэнди Уолтон','1959-03-29','Дженнифертаун, Гвинея-Бисау',181),
	('Кэтрин Зунига','1959-10-27','Западный Карламут, Израиль',172),
	('Джон Гуд','1946-06-07','Галлоуэйбери, Таджикистан',189),
	('Дон Тейлор','1950-04-03','Северная Эрика, Чехия',193),
	('Ребекка Риз','1966-08-30','Южный Джесси, Соломоновы Острова',158),
	('Уильям Янг','1985-06-13','Западный Трейсишир, Остров Буве (Буветойя)',187),
	('Джеймс Мартин','1966-07-30','Озеро Джейкобленд, Доминиканская Республика',197),
	('Марк Пинеда','1971-10-01','Меганхейвен, Словакия (Словацкая Република)',157),
	('Виктория Грин','1998-10-22','Кейсиленд, Камбоджа',203),
	('Вики Баркер','1981-12-29','Кэтиборо, Северные Марианские острова',179),
	('Элизабет Хьюз','1985-10-02','Порт-Анжела, Узбекистан',168),
	('Ричард Комбс','1987-03-16','Брайанборо, Тунис',200),
	('Сидни Морроу','1966-10-13','Озеро Эшли, Аргентина',161),
	('Келли Кокс','1973-03-11','Нансиберг, Албания',191),
	('Иоланда Смит','1951-08-01','Западный Челси, Кипр',157);



INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Сила страны' AND g.name = 'Боевики';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Сила страны' AND g.name = 'nan';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Сила страны' AND g.name = 'Мультфильмы';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Включая' AND g.name = 'Реальное ТВ';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Включая' AND g.name = 'Игры';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Включая' AND g.name = 'Военные';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Бал год' AND g.name = 'Детективы';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Бал год' AND g.name = 'Фантастика';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Бал год' AND g.name = 'Приключения';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Определять' AND g.name = 'Семейные';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Определять' AND g.name = 'Короткометражки';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Определять' AND g.name = 'Игры';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Определять' AND g.name = 'Криминал';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Офицер вполне' AND g.name = 'Фильмы-нуар';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Офицер вполне' AND g.name = 'Мюзиклы';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Офицер вполне' AND g.name = 'Ток-шоу';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Офицер вполне' AND g.name = 'Мелодрамы';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Офицер вполне' AND g.name = 'Вестерны';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Последний официальный точно' AND g.name = 'Военные';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Последний официальный точно' AND g.name = 'Мультфильмы';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'За организационным искусством' AND g.name = 'Триллеры';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Тип семейства' AND g.name = 'Комедия';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Тип семейства' AND g.name = 'Аниме';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Тип семейства' AND g.name = 'Триллеры';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Тип семейства' AND g.name = 'Документальные';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Отец смены станции' AND g.name = 'Семейные';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Отец смены станции' AND g.name = 'Фантастика';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Запад' AND g.name = 'Ужасы';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Запад' AND g.name = 'Детективы';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Запад' AND g.name = 'Военные';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Запад' AND g.name = 'Детские';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Знакомство с природой' AND g.name = 'Детективы';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Знакомство с природой' AND g.name = 'Триллеры';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Теперь даже' AND g.name = 'Вестерны';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Теперь даже' AND g.name = 'Спортивные';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Теперь даже' AND g.name = 'Аниме';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Теперь даже' AND g.name = 'Реальное ТВ';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Теперь даже' AND g.name = 'Комедия';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Другие тоже сами' AND g.name = 'Фильмы-нуар';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Другие тоже сами' AND g.name = 'Исторические';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Другие тоже сами' AND g.name = 'Фантастика';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Другие тоже сами' AND g.name = 'Приключения';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Этот адвокат по заданию' AND g.name = 'Мультфильмы';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Окно сто индивидуальное' AND g.name = 'Боевики';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Окно сто индивидуальное' AND g.name = 'Семейные';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Встряхнуть администрацию' AND g.name = 'Комедия';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Встряхнуть администрацию' AND g.name = 'Ужасы';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Встряхнуть администрацию' AND g.name = 'Драмы';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Встряхнуть администрацию' AND g.name = 'Фильмы-нуар';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Школа разумного возраста' AND g.name = 'Ужасы';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Усилие определенного ветра' AND g.name = 'Фэнтези';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Прогулочное стекло' AND g.name = 'Приключения';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'К' AND g.name = 'Игры';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Достигать' AND g.name = 'Короткометражки';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Достигать' AND g.name = 'Реальное ТВ';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Достигать' AND g.name = 'Драмы';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Достигать' AND g.name = 'Игры';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Место, желающее место' AND g.name = 'Детские';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Место, желающее место' AND g.name = 'Мелодрамы';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Место, желающее место' AND g.name = 'Семейные';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Место, желающее место' AND g.name = 'Реальное ТВ';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Религиозный демократ' AND g.name = 'Исторические';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Религиозный демократ' AND g.name = 'Короткометражки';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Религиозный демократ' AND g.name = 'Ужасы';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Позволять' AND g.name = 'Документальные';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Позволять' AND g.name = 'Фантастика';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Позволять' AND g.name = 'Триллеры';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Брат часть средняя' AND g.name = 'Драмы';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Брат часть средняя' AND g.name = 'Мелодрамы';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Брат часть средняя' AND g.name = 'Документальные';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Брат часть средняя' AND g.name = 'Исторические';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Брат часть средняя' AND g.name = 'Спортивные';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Семья' AND g.name = 'Драмы';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Семья' AND g.name = 'Ужасы';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Эксперт' AND g.name = 'Приключения';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Эксперт' AND g.name = 'Триллеры';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Означает поддержку когда-либо' AND g.name = 'Мультфильмы';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Означает поддержку когда-либо' AND g.name = 'Ужасы';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Определить, определить вид' AND g.name = 'Ужасы';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Определить, определить вид' AND g.name = 'Детские';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Земля' AND g.name = 'Фильмы-нуар';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Особо светлый' AND g.name = 'Детективы';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Особо светлый' AND g.name = 'Криминал';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Особо светлый' AND g.name = 'Ток-шоу';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Особо светлый' AND g.name = 'Драмы';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Особо светлый' AND g.name = 'Комедия';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Ничего не упоминай, наш' AND g.name = 'Документальные';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Ничего не упоминай, наш' AND g.name = 'Мелодрамы';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Ничего не упоминай, наш' AND g.name = 'Семейные';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Ничего не упоминай, наш' AND g.name = 'Игры';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Добрый или' AND g.name = 'Фэнтези';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Добрый или' AND g.name = 'Короткометражки';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Добрый или' AND g.name = 'Документальные';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Добрый или' AND g.name = 'Игры';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Знак суммы момента' AND g.name = 'Военные';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Знак суммы момента' AND g.name = 'Криминал';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Знак суммы момента' AND g.name = 'Мелодрамы';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Знак суммы момента' AND g.name = 'Биографии';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Все вылезает наружу' AND g.name = 'Фильмы-нуар';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Простая кампания' AND g.name = 'Фэнтези';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Простая кампания' AND g.name = 'Триллеры';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Существующее решение' AND g.name = 'Музыкальные';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Существующее решение' AND g.name = 'Мюзиклы';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Обращаться' AND g.name = 'Игры';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Обращаться' AND g.name = 'Ток-шоу';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Обращаться' AND g.name = 'Мелодрамы';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Обращаться' AND g.name = 'Мюзиклы';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Обращаться' AND g.name = 'Аниме';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Поздно счастлив' AND g.name = 'Ужасы';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Поздно счастлив' AND g.name = 'Мелодрамы';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Середина' AND g.name = 'Мюзиклы';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Середина' AND g.name = 'Фантастика';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Середина' AND g.name = 'Игры';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Середина' AND g.name = 'Короткометражки';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Середина' AND g.name = 'Мультфильмы';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Работа' AND g.name = 'Документальные';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Работа' AND g.name = 'Музыкальные';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Работа' AND g.name = 'Игры';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Работа' AND g.name = 'Ужасы';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Никогда не режь' AND g.name = 'Ужасы';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Никогда не режь' AND g.name = 'Приключения';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Никогда не режь' AND g.name = 'Аниме';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Введите другой' AND g.name = 'Документальные';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Введите другой' AND g.name = 'Мелодрамы';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Введите другой' AND g.name = 'Музыкальные';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Признайся во всем' AND g.name = 'Военные';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Признайся во всем' AND g.name = 'Документальные';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Признайся во всем' AND g.name = 'Мультфильмы';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Признайся во всем' AND g.name = 'Приключения';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Муж' AND g.name = 'Вестерны';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Муж' AND g.name = 'Мюзиклы';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Если страдать' AND g.name = 'Биографии';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Если страдать' AND g.name = 'Детские';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Если страдать' AND g.name = 'Ток-шоу';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Возможно, сначала' AND g.name = 'Ток-шоу';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Набор отчетов' AND g.name = 'Триллеры';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'С' AND g.name = 'Ток-шоу';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'С' AND g.name = 'Криминал';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Влияние на сайт' AND g.name = 'Ток-шоу';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Влияние на сайт' AND g.name = 'Исторические';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Влияние на сайт' AND g.name = 'Фильмы-нуар';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Влияние на сайт' AND g.name = 'Военные';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'По появлению' AND g.name = 'Документальные';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'По появлению' AND g.name = 'Исторические';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'По появлению' AND g.name = 'Реальное ТВ';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'По появлению' AND g.name = 'Игры';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Все вызывают' AND g.name = 'Военные';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Все вызывают' AND g.name = 'Приключения';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Все вызывают' AND g.name = 'Ток-шоу';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Часовое здание' AND g.name = 'Мюзиклы';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Часовое здание' AND g.name = 'Приключения';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Часовое здание' AND g.name = 'Ужасы';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Часовое здание' AND g.name = 'Драмы';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Ответь хотя подумай' AND g.name = 'Исторические';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Ответь хотя подумай' AND g.name = 'Ток-шоу';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Ответь хотя подумай' AND g.name = 'Мультфильмы';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Надеяться' AND g.name = 'Ужасы';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Надеяться' AND g.name = 'Приключения';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Разница' AND g.name = 'Драмы';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Разница' AND g.name = 'Военные';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Разница' AND g.name = 'Боевики';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Разница' AND g.name = 'Реальное ТВ';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Разница' AND g.name = 'Семейные';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Позже' AND g.name = 'Триллеры';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Позже' AND g.name = 'Исторические';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Позже' AND g.name = 'Фантастика';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Позже' AND g.name = 'Военные';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Позже' AND g.name = 'Биографии';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Все может быть' AND g.name = 'Биографии';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Все может быть' AND g.name = 'Комедия';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Все может быть' AND g.name = 'Детские';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Все может быть' AND g.name = 'Музыкальные';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Все может быть' AND g.name = 'Исторические';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Север' AND g.name = 'Приключения';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Север' AND g.name = 'Исторические';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Север' AND g.name = 'Фэнтези';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Голосуйте за ту же часть' AND g.name = 'Биографии';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Голосуйте за ту же часть' AND g.name = 'Аниме';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Голосуйте за ту же часть' AND g.name = 'Мелодрамы';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Голосуйте за ту же часть' AND g.name = 'Фильмы-нуар';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Голосуйте за ту же часть' AND g.name = 'Короткометражки';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Поинт-команда' AND g.name = 'Короткометражки';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Поинт-команда' AND g.name = 'Игры';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Поинт-команда' AND g.name = 'Приключения';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Поинт-команда' AND g.name = 'Музыкальные';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Расходы' AND g.name = 'Документальные';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Расходы' AND g.name = 'Музыкальные';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Одно целое раскрытие' AND g.name = 'Ужасы';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Трудно идентифицировать' AND g.name = 'Ток-шоу';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Трудно идентифицировать' AND g.name = 'Семейные';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Трудно идентифицировать' AND g.name = 'Военные';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Трудно идентифицировать' AND g.name = 'Вестерны';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Трудно идентифицировать' AND g.name = 'Исторические';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Беспокоите нас' AND g.name = 'Мюзиклы';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Беспокоите нас' AND g.name = 'Короткометражки';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Беспокоите нас' AND g.name = 'Спортивные';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Беспокоите нас' AND g.name = 'Фэнтези';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Еще' AND g.name = 'Фантастика';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Еще' AND g.name = 'Криминал';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Еще' AND g.name = 'Вестерны';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Один раз' AND g.name = 'Короткометражки';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Один раз' AND g.name = 'Боевики';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Один раз' AND g.name = 'Документальные';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Иностранный довольно' AND g.name = 'Фантастика';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Иностранный довольно' AND g.name = 'Детские';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Иностранный довольно' AND g.name = 'Игры';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Иностранный довольно' AND g.name = 'Семейные';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Беспокойство' AND g.name = 'Аниме';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Беспокойство' AND g.name = 'Детективы';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Беспокойство' AND g.name = 'Военные';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Беспокойство' AND g.name = 'Фантастика';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Беспокойство' AND g.name = 'Игры';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Чувство атаки читать' AND g.name = 'Приключения';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Чувство атаки читать' AND g.name = 'Боевики';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Чувство атаки читать' AND g.name = 'Вестерны';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Явный рост производства' AND g.name = 'Спортивные';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Явный рост производства' AND g.name = 'Мультфильмы';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Явный рост производства' AND g.name = 'Короткометражки';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Явный рост производства' AND g.name = 'Приключения';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Миссис Мейн Муха' AND g.name = 'Ток-шоу';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Миссис Мейн Муха' AND g.name = 'Детские';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Миссис Мейн Муха' AND g.name = 'Криминал';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Вытащите студента' AND g.name = 'Фантастика';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Вытащите студента' AND g.name = 'Детские';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Вытащите студента' AND g.name = 'Мелодрамы';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Фонд мира' AND g.name = 'Военные';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Фонд мира' AND g.name = 'Комедия';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Требовать' AND g.name = 'Биографии';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Требовать' AND g.name = 'Криминал';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Требовать' AND g.name = 'Триллеры';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Купить' AND g.name = 'Триллеры';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Купить' AND g.name = 'Фэнтези';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Купить' AND g.name = 'Детские';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Современные другие учат' AND g.name = 'Игры';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Современные другие учат' AND g.name = 'Реальное ТВ';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Современные другие учат' AND g.name = 'Фильмы-нуар';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Современные другие учат' AND g.name = 'Детские';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Люди' AND g.name = 'Детективы';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Люди' AND g.name = 'Мультфильмы';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Люди' AND g.name = 'Комедия';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Люди' AND g.name = 'Семейные';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Люди' AND g.name = 'Музыкальные';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Медицинский брат, да' AND g.name = 'Вестерны';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Медицинское сообщество' AND g.name = 'Аниме';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Медицинское сообщество' AND g.name = 'Комедия';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Медицинское сообщество' AND g.name = 'Игры';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Медицинское сообщество' AND g.name = 'Мелодрамы';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Вообще-то, отдохни после обеда' AND g.name = 'Игры';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Служить' AND g.name = 'Биографии';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Служить' AND g.name = 'Мюзиклы';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Служить' AND g.name = 'Реальное ТВ';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Служить' AND g.name = 'Фэнтези';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Нация его поперек' AND g.name = 'Военные';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Нация его поперек' AND g.name = 'Фэнтези';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Живой мальчик, звук' AND g.name = 'Военные';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Живой мальчик, звук' AND g.name = 'Ужасы';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Живой мальчик, звук' AND g.name = 'Фэнтези';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Живой мальчик, звук' AND g.name = 'Исторические';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Большой' AND g.name = 'Боевики';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Агент по отцу' AND g.name = 'Фантастика';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Медицинский там, потому что' AND g.name = 'Детские';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Синие наши они' AND g.name = 'Музыкальные';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Вести' AND g.name = 'Документальные';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Вести' AND g.name = 'Игры';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Вести' AND g.name = 'Комедия';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Потерять магазин вечером' AND g.name = 'Биографии';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Потерять магазин вечером' AND g.name = 'Приключения';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Потерять магазин вечером' AND g.name = 'Мультфильмы';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Потерять магазин вечером' AND g.name = 'Фильмы-нуар';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Потерять магазин вечером' AND g.name = 'Фэнтези';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Характер' AND g.name = 'Военные';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Кровать говорит бит' AND g.name = 'Драмы';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Кровать говорит бит' AND g.name = 'Игры';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Вскоре компьютер и' AND g.name = 'Игры';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Вскоре компьютер и' AND g.name = 'Вестерны';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Две войны' AND g.name = 'Фэнтези';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Две войны' AND g.name = 'Аниме';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Мог распознать' AND g.name = 'Спортивные';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Мог распознать' AND g.name = 'Приключения';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Мог распознать' AND g.name = 'Мюзиклы';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Поднимись, слушай' AND g.name = 'Драмы';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Поднимись, слушай' AND g.name = 'Спортивные';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'День национального генерала' AND g.name = 'Документальные';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'День национального генерала' AND g.name = 'Семейные';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Петь' AND g.name = 'Документальные';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Каждое близкое открытие' AND g.name = 'Боевики';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Каждое близкое открытие' AND g.name = 'Мультфильмы';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Каждое близкое открытие' AND g.name = 'Драмы';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Угроза, которой мы служим' AND g.name = 'Фэнтези';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Угроза, которой мы служим' AND g.name = 'Спортивные';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Угроза, которой мы служим' AND g.name = 'Ужасы';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Мировая сумка-машина' AND g.name = 'Игры';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Бесплатно' AND g.name = 'Детективы';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Бесплатно' AND g.name = 'Фильмы-нуар';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Бесплатно' AND g.name = 'Военные';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Коробка' AND g.name = 'Игры';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Коробка' AND g.name = 'Драмы';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Коробка' AND g.name = 'Фильмы-нуар';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Коробка' AND g.name = 'Музыкальные';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Коробка' AND g.name = 'Мелодрамы';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Вода' AND g.name = 'Фантастика';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Класс закрыть' AND g.name = 'Спортивные';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Класс закрыть' AND g.name = 'Комедия';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Энергия' AND g.name = 'Мюзиклы';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Энергия' AND g.name = 'Фильмы-нуар';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Энергия' AND g.name = 'Спортивные';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Впереди опыт брата' AND g.name = 'Детские';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Впереди опыт брата' AND g.name = 'Приключения';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Впереди опыт брата' AND g.name = 'Мелодрамы';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Различный' AND g.name = 'Аниме';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Различный' AND g.name = 'Криминал';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Различный' AND g.name = 'Спортивные';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Различный' AND g.name = 'Боевики';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Различный' AND g.name = 'Ток-шоу';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Никогда' AND g.name = 'Фильмы-нуар';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Никогда' AND g.name = 'Приключения';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Никогда' AND g.name = 'Биографии';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Никогда' AND g.name = 'Реальное ТВ';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Вещи' AND g.name = 'Фильмы-нуар';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Вещи' AND g.name = 'Детские';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Вещи' AND g.name = 'Игры';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Вещи' AND g.name = 'Аниме';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Почувствуйте, опишите производство' AND g.name = 'Военные';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Ударять' AND g.name = 'Фантастика';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Ударять' AND g.name = 'Биографии';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Ударять' AND g.name = 'Боевики';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Ударять' AND g.name = 'Ужасы';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Ударять' AND g.name = 'Драмы';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Сами благодарю' AND g.name = 'Аниме';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Кажется, имя успешное' AND g.name = 'Боевики';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Кажется, имя успешное' AND g.name = 'Приключения';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Рынок другой' AND g.name = 'Фильмы-нуар';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Рынок другой' AND g.name = 'Короткометражки';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Рынок другой' AND g.name = 'Детские';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Рынок другой' AND g.name = 'Ужасы';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Колледжский мяч.' AND g.name = 'Криминал';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Колледжский мяч.' AND g.name = 'Военные';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Колледжский мяч.' AND g.name = 'Исторические';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Колледжский мяч.' AND g.name = 'Спортивные';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Колледжский мяч.' AND g.name = 'Фэнтези';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'До' AND g.name = 'Военные';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'До' AND g.name = 'Фильмы-нуар';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'До' AND g.name = 'Аниме';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'До' AND g.name = 'Мультфильмы';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'До' AND g.name = 'Ужасы';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Помнить' AND g.name = 'Спортивные';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Помнить' AND g.name = 'Игры';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Помнить' AND g.name = 'Детские';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Дом' AND g.name = 'Спортивные';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Дом' AND g.name = 'Криминал';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Дом' AND g.name = 'Мелодрамы';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Каждому достаточно, как' AND g.name = 'Ужасы';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Сохранить пропуск' AND g.name = 'Ток-шоу';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Сохранить пропуск' AND g.name = 'Спортивные';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Общество войной' AND g.name = 'Военные';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Общество войной' AND g.name = 'Приключения';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Общество войной' AND g.name = 'Детективы';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Общество войной' AND g.name = 'Мультфильмы';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Общество войной' AND g.name = 'Игры';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Сегодня вечером' AND g.name = 'Ток-шоу';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Сегодня вечером' AND g.name = 'Документальные';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Сегодня вечером' AND g.name = 'Игры';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Цена двух попыток' AND g.name = 'Мелодрамы';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Цена двух попыток' AND g.name = 'Документальные';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Цена двух попыток' AND g.name = 'Игры';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Сад' AND g.name = 'Триллеры';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Готовься пиши' AND g.name = 'Семейные';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Готовься пиши' AND g.name = 'Мелодрамы';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'До внимания' AND g.name = 'Ужасы';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'До внимания' AND g.name = 'Боевики';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'До внимания' AND g.name = 'Детские';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'До внимания' AND g.name = 'Вестерны';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'До внимания' AND g.name = 'Ток-шоу';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Спорить, раскрывать' AND g.name = 'Музыкальные';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Спорить, раскрывать' AND g.name = 'Мюзиклы';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Церковь' AND g.name = 'Мультфильмы';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Церковь' AND g.name = 'Биографии';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Церковь' AND g.name = 'Документальные';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Церковь' AND g.name = 'Боевики';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Церковь' AND g.name = 'Фильмы-нуар';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Как оставаться политикой' AND g.name = 'Реальное ТВ';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Как оставаться политикой' AND g.name = 'Боевики';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Как оставаться политикой' AND g.name = 'Ток-шоу';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Как оставаться политикой' AND g.name = 'Семейные';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Конец' AND g.name = 'Ток-шоу';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Конец' AND g.name = 'Фэнтези';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Служить производительности создавать' AND g.name = 'Спортивные';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Служить производительности создавать' AND g.name = 'Семейные';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Служить производительности создавать' AND g.name = 'Биографии';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Служить производительности создавать' AND g.name = 'Короткометражки';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Красивый подъем' AND g.name = 'Боевики';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Готовый' AND g.name = 'Детские';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Готовый' AND g.name = 'Комедия';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Готовый' AND g.name = 'Реальное ТВ';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Вариант генерала его' AND g.name = 'Военные';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Вариант генерала его' AND g.name = 'Мюзиклы';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Вариант генерала его' AND g.name = 'Детские';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Вариант генерала его' AND g.name = 'Мелодрамы';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Жестко их' AND g.name = 'Военные';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Жестко их' AND g.name = 'Комедия';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Кусочек' AND g.name = 'Приключения';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Навык кровати поздно' AND g.name = 'Военные';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Навык кровати поздно' AND g.name = 'Детективы';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Навык кровати поздно' AND g.name = 'Игры';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Продолжить аналогичную сторону' AND g.name = 'Фильмы-нуар';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Продолжить аналогичную сторону' AND g.name = 'Документальные';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Авторитетное присоединение' AND g.name = 'Военные';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Авторитетное присоединение' AND g.name = 'Фильмы-нуар';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Авторитетное присоединение' AND g.name = 'Приключения';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Авторитетное присоединение' AND g.name = 'Криминал';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Авторитетное присоединение' AND g.name = 'Детективы';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Причина кожи' AND g.name = 'Реальное ТВ';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Причина кожи' AND g.name = 'Семейные';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Беспокойство' AND g.name = 'Спортивные';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Сестре конец, потому что' AND g.name = 'Биографии';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Сестре конец, потому что' AND g.name = 'Короткометражки';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Сестре конец, потому что' AND g.name = 'Криминал';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Сестре конец, потому что' AND g.name = 'Аниме';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Сестре конец, потому что' AND g.name = 'Триллеры';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Дизайн друга' AND g.name = 'Мультфильмы';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Музыка Миссис' AND g.name = 'Документальные';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Музыка Миссис' AND g.name = 'Вестерны';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Количество' AND g.name = 'Ужасы';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Предлагать' AND g.name = 'Ужасы';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Предлагать' AND g.name = 'Криминал';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Ну представьте себе' AND g.name = 'Детские';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Особенно' AND g.name = 'Музыкальные';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Особенно' AND g.name = 'Детективы';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Особенно' AND g.name = 'Семейные';

INSERT INTO "public.Movies_genres" (movie_id, genres_id)
SELECT m.id, g.id
FROM "public.Movies" m
JOIN "public.Genres" g ON m.name = 'Особенно' AND g.name = 'Реальное ТВ';



DO $$
DECLARE id_member_0 INT;
DECLARE id_member_1 INT;
DECLARE id_member_2 INT;
DECLARE id_member_3 INT;
DECLARE id_member_4 INT;
DECLARE id_member_5 INT;
DECLARE id_member_6 INT;
DECLARE id_member_7 INT;
DECLARE id_member_8 INT;
DECLARE id_member_9 INT;
DECLARE id_member_10 INT;
DECLARE id_member_11 INT;
DECLARE id_member_12 INT;
DECLARE id_member_13 INT;
DECLARE id_member_14 INT;
DECLARE id_member_15 INT;
DECLARE id_member_16 INT;
DECLARE id_member_17 INT;
DECLARE id_member_18 INT;
DECLARE id_member_19 INT;
DECLARE id_member_20 INT;
DECLARE id_member_21 INT;
DECLARE id_member_22 INT;
DECLARE id_member_23 INT;
DECLARE id_member_24 INT;
DECLARE id_member_25 INT;
DECLARE id_member_26 INT;
DECLARE id_member_27 INT;
DECLARE id_member_28 INT;
DECLARE id_member_29 INT;
DECLARE id_member_30 INT;
DECLARE id_member_31 INT;
DECLARE id_member_32 INT;
DECLARE id_member_33 INT;
DECLARE id_member_34 INT;
DECLARE id_member_35 INT;
DECLARE id_member_36 INT;
DECLARE id_member_37 INT;
DECLARE id_member_38 INT;
DECLARE id_member_39 INT;
DECLARE id_member_40 INT;
DECLARE id_member_41 INT;
DECLARE id_member_42 INT;
DECLARE id_member_43 INT;
DECLARE id_member_44 INT;
DECLARE id_member_45 INT;
DECLARE id_member_46 INT;
DECLARE id_member_47 INT;
DECLARE id_member_48 INT;
DECLARE id_member_49 INT;
DECLARE id_member_50 INT;
DECLARE id_member_51 INT;
DECLARE id_member_52 INT;
DECLARE id_member_53 INT;
DECLARE id_member_54 INT;
DECLARE id_member_55 INT;
DECLARE id_member_56 INT;
DECLARE id_member_57 INT;
DECLARE id_member_58 INT;
DECLARE id_member_59 INT;
DECLARE id_member_60 INT;
DECLARE id_member_61 INT;
DECLARE id_member_62 INT;
DECLARE id_member_63 INT;
DECLARE id_member_64 INT;
DECLARE id_member_65 INT;
DECLARE id_member_66 INT;
DECLARE id_member_67 INT;
DECLARE id_member_68 INT;
DECLARE id_member_69 INT;
DECLARE id_member_70 INT;
DECLARE id_member_71 INT;
DECLARE id_member_72 INT;
DECLARE id_member_73 INT;
DECLARE id_member_74 INT;
DECLARE id_member_75 INT;
DECLARE id_member_76 INT;
DECLARE id_member_77 INT;
DECLARE id_member_78 INT;
DECLARE id_member_79 INT;
DECLARE id_member_80 INT;
DECLARE id_member_81 INT;
DECLARE id_member_82 INT;
DECLARE id_member_83 INT;
DECLARE id_member_84 INT;
DECLARE id_member_85 INT;
DECLARE id_member_86 INT;
DECLARE id_member_87 INT;
DECLARE id_member_88 INT;
DECLARE id_member_89 INT;
DECLARE id_member_90 INT;
DECLARE id_member_91 INT;
DECLARE id_member_92 INT;
DECLARE id_member_93 INT;
DECLARE id_member_94 INT;
DECLARE id_member_95 INT;
DECLARE id_member_96 INT;
DECLARE id_member_97 INT;
DECLARE id_member_98 INT;
DECLARE id_member_99 INT;
DECLARE id_member_100 INT;
DECLARE id_member_101 INT;
DECLARE id_member_102 INT;
DECLARE id_member_103 INT;
DECLARE id_member_104 INT;
DECLARE id_member_105 INT;
DECLARE id_member_106 INT;
DECLARE id_member_107 INT;
DECLARE id_member_108 INT;
DECLARE id_member_109 INT;
DECLARE id_member_110 INT;
DECLARE id_member_111 INT;
DECLARE id_member_112 INT;
DECLARE id_member_113 INT;
DECLARE id_member_114 INT;
DECLARE id_member_115 INT;
DECLARE id_member_116 INT;
DECLARE id_member_117 INT;
DECLARE id_member_118 INT;
DECLARE id_member_119 INT;
DECLARE id_member_120 INT;
DECLARE id_member_121 INT;
DECLARE id_member_122 INT;
DECLARE id_member_123 INT;
DECLARE id_member_124 INT;
DECLARE id_member_125 INT;
DECLARE id_member_126 INT;
DECLARE id_member_127 INT;
DECLARE id_member_128 INT;
DECLARE id_member_129 INT;
DECLARE id_member_130 INT;
DECLARE id_member_131 INT;
DECLARE id_member_132 INT;
DECLARE id_member_133 INT;
DECLARE id_member_134 INT;
DECLARE id_member_135 INT;
DECLARE id_member_136 INT;
DECLARE id_member_137 INT;
DECLARE id_member_138 INT;
DECLARE id_member_139 INT;
DECLARE id_member_140 INT;
DECLARE id_member_141 INT;
DECLARE id_member_142 INT;
DECLARE id_member_143 INT;
DECLARE id_member_144 INT;
DECLARE id_member_145 INT;
DECLARE id_member_146 INT;
DECLARE id_member_147 INT;
DECLARE id_member_148 INT;
DECLARE id_member_149 INT;
DECLARE id_member_150 INT;
DECLARE id_member_151 INT;
DECLARE id_member_152 INT;
DECLARE id_member_153 INT;
DECLARE id_member_154 INT;
DECLARE id_member_155 INT;
DECLARE id_member_156 INT;
DECLARE id_member_157 INT;
DECLARE id_member_158 INT;
DECLARE id_member_159 INT;
DECLARE id_member_160 INT;
DECLARE id_member_161 INT;
DECLARE id_member_162 INT;
DECLARE id_member_163 INT;
DECLARE id_member_164 INT;
DECLARE id_member_165 INT;
DECLARE id_member_166 INT;
DECLARE id_member_167 INT;
DECLARE id_member_168 INT;
DECLARE id_member_169 INT;
DECLARE id_member_170 INT;
DECLARE id_member_171 INT;
DECLARE id_member_172 INT;
DECLARE id_member_173 INT;
DECLARE id_member_174 INT;
DECLARE id_member_175 INT;
DECLARE id_member_176 INT;
DECLARE id_member_177 INT;
DECLARE id_member_178 INT;
DECLARE id_member_179 INT;
DECLARE id_member_180 INT;
DECLARE id_member_181 INT;
DECLARE id_member_182 INT;
DECLARE id_member_183 INT;
DECLARE id_member_184 INT;
DECLARE id_member_185 INT;
DECLARE id_member_186 INT;
DECLARE id_member_187 INT;
DECLARE id_member_188 INT;
DECLARE id_member_189 INT;
DECLARE id_member_190 INT;
DECLARE id_member_191 INT;
DECLARE id_member_192 INT;
DECLARE id_member_193 INT;
DECLARE id_member_194 INT;
DECLARE id_member_195 INT;
DECLARE id_member_196 INT;
DECLARE id_member_197 INT;
DECLARE id_member_198 INT;
DECLARE id_member_199 INT;
DECLARE id_movie_0 INT;
DECLARE id_movie_1 INT;
DECLARE id_movie_2 INT;
DECLARE id_movie_3 INT;
DECLARE id_movie_4 INT;
DECLARE id_movie_5 INT;
DECLARE id_movie_6 INT;
DECLARE id_movie_7 INT;
DECLARE id_movie_8 INT;
DECLARE id_movie_9 INT;
DECLARE id_movie_10 INT;
DECLARE id_movie_11 INT;
DECLARE id_movie_12 INT;
DECLARE id_movie_13 INT;
DECLARE id_movie_14 INT;
DECLARE id_movie_15 INT;
DECLARE id_movie_16 INT;
DECLARE id_movie_17 INT;
DECLARE id_movie_18 INT;
DECLARE id_movie_19 INT;
DECLARE id_movie_20 INT;
DECLARE id_movie_21 INT;
DECLARE id_movie_22 INT;
DECLARE id_movie_23 INT;
DECLARE id_movie_24 INT;
DECLARE id_movie_25 INT;
DECLARE id_movie_26 INT;
DECLARE id_movie_27 INT;
DECLARE id_movie_28 INT;
DECLARE id_movie_29 INT;
DECLARE id_movie_30 INT;
DECLARE id_movie_31 INT;
DECLARE id_movie_32 INT;
DECLARE id_movie_33 INT;
DECLARE id_movie_34 INT;
DECLARE id_movie_35 INT;
DECLARE id_movie_36 INT;
DECLARE id_movie_37 INT;
DECLARE id_movie_38 INT;
DECLARE id_movie_39 INT;
DECLARE id_movie_40 INT;
DECLARE id_movie_41 INT;
DECLARE id_movie_42 INT;
DECLARE id_movie_43 INT;
DECLARE id_movie_44 INT;
DECLARE id_movie_45 INT;
DECLARE id_movie_46 INT;
DECLARE id_movie_47 INT;
DECLARE id_movie_48 INT;
DECLARE id_movie_49 INT;
DECLARE id_movie_50 INT;
DECLARE id_movie_51 INT;
DECLARE id_movie_52 INT;
DECLARE id_movie_53 INT;
DECLARE id_movie_54 INT;
DECLARE id_movie_55 INT;
DECLARE id_movie_56 INT;
DECLARE id_movie_57 INT;
DECLARE id_movie_58 INT;
DECLARE id_movie_59 INT;
DECLARE id_movie_60 INT;
DECLARE id_movie_61 INT;
DECLARE id_movie_62 INT;
DECLARE id_movie_63 INT;
DECLARE id_movie_64 INT;
DECLARE id_movie_65 INT;
DECLARE id_movie_66 INT;
DECLARE id_movie_67 INT;
DECLARE id_movie_68 INT;
DECLARE id_movie_69 INT;
DECLARE id_movie_70 INT;
DECLARE id_movie_71 INT;
DECLARE id_movie_72 INT;
DECLARE id_movie_73 INT;
DECLARE id_movie_74 INT;
DECLARE id_movie_75 INT;
DECLARE id_movie_76 INT;
DECLARE id_movie_77 INT;
DECLARE id_movie_78 INT;
DECLARE id_movie_79 INT;
DECLARE id_movie_80 INT;
DECLARE id_movie_81 INT;
DECLARE id_movie_82 INT;
DECLARE id_movie_83 INT;
DECLARE id_movie_84 INT;
DECLARE id_movie_85 INT;
DECLARE id_movie_86 INT;
DECLARE id_movie_87 INT;
DECLARE id_movie_88 INT;
DECLARE id_movie_89 INT;
DECLARE id_movie_90 INT;
DECLARE id_movie_91 INT;
DECLARE id_movie_92 INT;
DECLARE id_movie_93 INT;
DECLARE id_movie_94 INT;
DECLARE id_movie_95 INT;
DECLARE id_movie_96 INT;
DECLARE id_movie_97 INT;
DECLARE id_movie_98 INT;
DECLARE id_movie_99 INT;
DECLARE id_movie_100 INT;
DECLARE id_movie_101 INT;
DECLARE id_movie_102 INT;
DECLARE id_movie_103 INT;
DECLARE id_movie_104 INT;
DECLARE id_movie_105 INT;
DECLARE id_movie_106 INT;
DECLARE id_movie_107 INT;
DECLARE id_movie_108 INT;
DECLARE id_movie_109 INT;
DECLARE id_movie_110 INT;
DECLARE id_movie_111 INT;
DECLARE id_movie_112 INT;
DECLARE id_movie_113 INT;
DECLARE id_movie_114 INT;
DECLARE id_movie_115 INT;
DECLARE id_movie_116 INT;
DECLARE id_movie_117 INT;
DECLARE id_movie_118 INT;
DECLARE id_movie_119 INT;
DECLARE id_movie_120 INT;
DECLARE id_movie_121 INT;
DECLARE id_movie_122 INT;
DECLARE id_movie_123 INT;
DECLARE id_movie_124 INT;
DECLARE id_movie_125 INT;
DECLARE id_movie_126 INT;
DECLARE id_movie_127 INT;
DECLARE id_movie_128 INT;
DECLARE id_movie_129 INT;
DECLARE id_movie_130 INT;
DECLARE id_movie_131 INT;
DECLARE id_movie_132 INT;
DECLARE id_movie_133 INT;

BEGIN
	SELECT cm.id INTO id_member_0
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Мисти Бун';

	SELECT cm.id INTO id_member_1
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Роберт Тайлер';

	SELECT cm.id INTO id_member_2
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Мари Меркадо';

	SELECT cm.id INTO id_member_3
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Рассел Адамс';

	SELECT cm.id INTO id_member_4
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Майкл Уэйд';

	SELECT cm.id INTO id_member_5
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Эми Гилл';

	SELECT cm.id INTO id_member_6
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Лиза Валенсуэла';

	SELECT cm.id INTO id_member_7
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Лори Джордан';

	SELECT cm.id INTO id_member_8
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Дэниел Джонсон';

	SELECT cm.id INTO id_member_9
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Дэвид Диас';

	SELECT cm.id INTO id_member_10
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Тоня Родригес';

	SELECT cm.id INTO id_member_11
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Алекс Гарза';

	SELECT cm.id INTO id_member_12
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Сара Чавес';

	SELECT cm.id INTO id_member_13
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Джошуа Фелпс';

	SELECT cm.id INTO id_member_14
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Джереми Хэнсон';

	SELECT cm.id INTO id_member_15
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Дженнифер Вебер';

	SELECT cm.id INTO id_member_16
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Маргарет Майлз';

	SELECT cm.id INTO id_member_17
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Бриана Гарретт';

	SELECT cm.id INTO id_member_18
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Реджина Фелпс';

	SELECT cm.id INTO id_member_19
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Джейми Браун';

	SELECT cm.id INTO id_member_20
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Габриэль Гонсалес';

	SELECT cm.id INTO id_member_21
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Томас Ли';

	SELECT cm.id INTO id_member_22
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Элизабет Хендерсон';

	SELECT cm.id INTO id_member_23
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Томас Медина';

	SELECT cm.id INTO id_member_24
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Кристин Кальдерон';

	SELECT cm.id INTO id_member_25
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Тимоти Моралес';

	SELECT cm.id INTO id_member_26
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Марк Дэвис';

	SELECT cm.id INTO id_member_27
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Кортни Купер';

	SELECT cm.id INTO id_member_28
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Робин Гудман';

	SELECT cm.id INTO id_member_29
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Шелли Вагнер';

	SELECT cm.id INTO id_member_30
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Дерек Бонд';

	SELECT cm.id INTO id_member_31
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Эрин Буш';

	SELECT cm.id INTO id_member_32
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Кортни Эллиотт';

	SELECT cm.id INTO id_member_33
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Мелисса Роу';

	SELECT cm.id INTO id_member_34
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Джерри Родригес';

	SELECT cm.id INTO id_member_35
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Бенджамин Буш';

	SELECT cm.id INTO id_member_36
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Майкл Батлер';

	SELECT cm.id INTO id_member_37
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Алан Аллен';

	SELECT cm.id INTO id_member_38
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Джейкоб Принс';

	SELECT cm.id INTO id_member_39
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Джанет Шепард';

	SELECT cm.id INTO id_member_40
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Кайла Комбс';

	SELECT cm.id INTO id_member_41
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Бенджамин Чен';

	SELECT cm.id INTO id_member_42
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Роберт Майкл';

	SELECT cm.id INTO id_member_43
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Ребекка Шаффер';

	SELECT cm.id INTO id_member_44
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Мария Келлер';

	SELECT cm.id INTO id_member_45
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Диана Андерсон';

	SELECT cm.id INTO id_member_46
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Майкл Кабрера';

	SELECT cm.id INTO id_member_47
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Келли Баллок';

	SELECT cm.id INTO id_member_48
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Мишель Джонсон';

	SELECT cm.id INTO id_member_49
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Кэрри Генри';

	SELECT cm.id INTO id_member_50
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Паула Стронг';

	SELECT cm.id INTO id_member_51
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Дэвид Адамс';

	SELECT cm.id INTO id_member_52
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Лиза Торрес';

	SELECT cm.id INTO id_member_53
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Кристал Лоу';

	SELECT cm.id INTO id_member_54
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Эмили Галлахер';

	SELECT cm.id INTO id_member_55
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Уильям Уильямс';

	SELECT cm.id INTO id_member_56
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Грегори Мартинес';

	SELECT cm.id INTO id_member_57
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Маргарет Райт';

	SELECT cm.id INTO id_member_58
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Патрисия Кросби';

	SELECT cm.id INTO id_member_59
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Кайла Янг';

	SELECT cm.id INTO id_member_60
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Алан Грин';

	SELECT cm.id INTO id_member_61
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Эдуардо Джонсон';

	SELECT cm.id INTO id_member_62
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Линда Филлипс';

	SELECT cm.id INTO id_member_63
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Кэтрин Холт';

	SELECT cm.id INTO id_member_64
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Кристофер Тейлор';

	SELECT cm.id INTO id_member_65
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Джессика Дэвис';

	SELECT cm.id INTO id_member_66
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Джилл Томас';

	SELECT cm.id INTO id_member_67
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Рене Дэвис';

	SELECT cm.id INTO id_member_68
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Стивен Купер';

	SELECT cm.id INTO id_member_69
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Скотт Стэнли';

	SELECT cm.id INTO id_member_70
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Тэмми Ким';

	SELECT cm.id INTO id_member_71
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Венди Эскобар';

	SELECT cm.id INTO id_member_72
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Роберт Петерсон';

	SELECT cm.id INTO id_member_73
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Джордж Франк';

	SELECT cm.id INTO id_member_74
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Дэниел Родригес мл.';

	SELECT cm.id INTO id_member_75
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Лэнс Брайан';

	SELECT cm.id INTO id_member_76
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Бет Гарсия';

	SELECT cm.id INTO id_member_77
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Кеннет Харви';

	SELECT cm.id INTO id_member_78
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Эдвард Холмс';

	SELECT cm.id INTO id_member_79
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Александра Мартинес';

	SELECT cm.id INTO id_member_80
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Мелисса Вуд';

	SELECT cm.id INTO id_member_81
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Джастин Уокер';

	SELECT cm.id INTO id_member_82
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Филип Петерсон';

	SELECT cm.id INTO id_member_83
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Рэнди Дженкинс';

	SELECT cm.id INTO id_member_84
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Натаниэль Монтгомери';

	SELECT cm.id INTO id_member_85
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Виктория Миллер';

	SELECT cm.id INTO id_member_86
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Линда Макинтайр';

	SELECT cm.id INTO id_member_87
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Стивен Джонсон';

	SELECT cm.id INTO id_member_88
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Сара Сильва';

	SELECT cm.id INTO id_member_89
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Дэвид Уилсон';

	SELECT cm.id INTO id_member_90
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Кейтлин Коллиер';

	SELECT cm.id INTO id_member_91
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Майкл Джонсон';

	SELECT cm.id INTO id_member_92
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Маргарет Вагнер';

	SELECT cm.id INTO id_member_93
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Майкл Камачо';

	SELECT cm.id INTO id_member_94
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Джошуа Николсон';

	SELECT cm.id INTO id_member_95
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Стивен Салливан';

	SELECT cm.id INTO id_member_96
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Джеффри Фуллер';

	SELECT cm.id INTO id_member_97
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Мелисса Райт';

	SELECT cm.id INTO id_member_98
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Пол Джонс';

	SELECT cm.id INTO id_member_99
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Джордж Онейл';

	SELECT cm.id INTO id_member_100
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Дуглас Миллер';

	SELECT cm.id INTO id_member_101
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Андре Джексон';

	SELECT cm.id INTO id_member_102
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Дженис Перес';

	SELECT cm.id INTO id_member_103
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Чейз Уолтерс';

	SELECT cm.id INTO id_member_104
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Кэти Леон';

	SELECT cm.id INTO id_member_105
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Бриттани Фицджеральд';

	SELECT cm.id INTO id_member_106
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Шон Гонсалес';

	SELECT cm.id INTO id_member_107
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Джозеф Уильямсон';

	SELECT cm.id INTO id_member_108
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Уитни Эрнандес';

	SELECT cm.id INTO id_member_109
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Элисон Лайонс';

	SELECT cm.id INTO id_member_110
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Кэролин Моралес';

	SELECT cm.id INTO id_member_111
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Кэтрин Трэвис';

	SELECT cm.id INTO id_member_112
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Даниэль Эверетт';

	SELECT cm.id INTO id_member_113
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Кэссиди Блейк';

	SELECT cm.id INTO id_member_114
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Хуан Бриджес';

	SELECT cm.id INTO id_member_115
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Майкл Уоттс';

	SELECT cm.id INTO id_member_116
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Эмили Хаффман';

	SELECT cm.id INTO id_member_117
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Брэндон Хайден';

	SELECT cm.id INTO id_member_118
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Эшли Адамс';

	SELECT cm.id INTO id_member_119
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Питер Бест';

	SELECT cm.id INTO id_member_120
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Бриттни Филлипс';

	SELECT cm.id INTO id_member_121
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Альберт Вудс';

	SELECT cm.id INTO id_member_122
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Роберт Пейдж';

	SELECT cm.id INTO id_member_123
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Закари Бартлетт';

	SELECT cm.id INTO id_member_124
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Эмбер Ривера';

	SELECT cm.id INTO id_member_125
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Кэрол Торрес';

	SELECT cm.id INTO id_member_126
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Кэти Бак';

	SELECT cm.id INTO id_member_127
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Джеймс Уайт';

	SELECT cm.id INTO id_member_128
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Мишель Кляйн';

	SELECT cm.id INTO id_member_129
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Шон Тейт';

	SELECT cm.id INTO id_member_130
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Дэвид Галлоуэй';

	SELECT cm.id INTO id_member_131
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Мишель Вудс';

	SELECT cm.id INTO id_member_132
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Келли Гордон';

	SELECT cm.id INTO id_member_133
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Кори Джордан';

	SELECT cm.id INTO id_member_134
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Чарльз Нельсон';

	SELECT cm.id INTO id_member_135
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Меган Кларк';

	SELECT cm.id INTO id_member_136
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Бэйли Уотсон';

	SELECT cm.id INTO id_member_137
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Кари Грин';

	SELECT cm.id INTO id_member_138
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Дэвид Коллинз';

	SELECT cm.id INTO id_member_139
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Джесси Соса';

	SELECT cm.id INTO id_member_140
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Джессика Эдвардс';

	SELECT cm.id INTO id_member_141
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Эрик Янг';

	SELECT cm.id INTO id_member_142
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Гленн Паркс';

	SELECT cm.id INTO id_member_143
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Маркус Росалес';

	SELECT cm.id INTO id_member_144
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Чад Мэйс';

	SELECT cm.id INTO id_member_145
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Томми Уильямс';

	SELECT cm.id INTO id_member_146
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Джошуа Клэй';

	SELECT cm.id INTO id_member_147
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Дэвид Бонд';

	SELECT cm.id INTO id_member_148
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Фрэнсис Хаус';

	SELECT cm.id INTO id_member_149
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Кристен Мартин';

	SELECT cm.id INTO id_member_150
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Венди Филлипс';

	SELECT cm.id INTO id_member_151
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Алисса Эдвардс';

	SELECT cm.id INTO id_member_152
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Хосе Мартин';

	SELECT cm.id INTO id_member_153
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Анна Хоу';

	SELECT cm.id INTO id_member_154
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Омар Вудард';

	SELECT cm.id INTO id_member_155
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Остин Робинсон';

	SELECT cm.id INTO id_member_156
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Марк Джонсон';

	SELECT cm.id INTO id_member_157
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Рита Макдональд';

	SELECT cm.id INTO id_member_158
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Эшли Дэниелс';

	SELECT cm.id INTO id_member_159
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Трэвис Харрис';

	SELECT cm.id INTO id_member_160
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Андре Морс';

	SELECT cm.id INTO id_member_161
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Кэтрин Додсон';

	SELECT cm.id INTO id_member_162
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Джордан Эндрюс';

	SELECT cm.id INTO id_member_163
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Джейсон Грей';

	SELECT cm.id INTO id_member_164
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Джеймс Хейли';

	SELECT cm.id INTO id_member_165
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Алекса Браун';

	SELECT cm.id INTO id_member_166
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Эндрю Хансен';

	SELECT cm.id INTO id_member_167
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Кейт Обрайен';

	SELECT cm.id INTO id_member_168
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Донна Гузман';

	SELECT cm.id INTO id_member_169
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Кристина Лайонс';

	SELECT cm.id INTO id_member_170
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Тара Диас';

	SELECT cm.id INTO id_member_171
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Лиза Орр';

	SELECT cm.id INTO id_member_172
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Мелисса Уокер';

	SELECT cm.id INTO id_member_173
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Меган Агирре';

	SELECT cm.id INTO id_member_174
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Кристофер Барнс';

	SELECT cm.id INTO id_member_175
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Джошуа Оливер';

	SELECT cm.id INTO id_member_176
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Меган Финли';

	SELECT cm.id INTO id_member_177
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Родни Бреннан';

	SELECT cm.id INTO id_member_178
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Лора Джейкобсон';

	SELECT cm.id INTO id_member_179
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Кэти Хикман';

	SELECT cm.id INTO id_member_180
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Джеффри Уиллис';

	SELECT cm.id INTO id_member_181
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Энн Андерсон';

	SELECT cm.id INTO id_member_182
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Чарльз Хортон';

	SELECT cm.id INTO id_member_183
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Брук Вудард';

	SELECT cm.id INTO id_member_184
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Мишель Кук';

	SELECT cm.id INTO id_member_185
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Брэнди Уолтон';

	SELECT cm.id INTO id_member_186
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Кэтрин Зунига';

	SELECT cm.id INTO id_member_187
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Джон Гуд';

	SELECT cm.id INTO id_member_188
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Дон Тейлор';

	SELECT cm.id INTO id_member_189
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Ребекка Риз';

	SELECT cm.id INTO id_member_190
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Уильям Янг';

	SELECT cm.id INTO id_member_191
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Джеймс Мартин';

	SELECT cm.id INTO id_member_192
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Марк Пинеда';

	SELECT cm.id INTO id_member_193
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Виктория Грин';

	SELECT cm.id INTO id_member_194
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Вики Баркер';

	SELECT cm.id INTO id_member_195
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Элизабет Хьюз';

	SELECT cm.id INTO id_member_196
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Ричард Комбс';

	SELECT cm.id INTO id_member_197
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Сидни Морроу';

	SELECT cm.id INTO id_member_198
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Келли Кокс';

	SELECT cm.id INTO id_member_199
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Иоланда Смит';

	SELECT m.id INTO id_movie_0
	FROM "public.Movies" m
	WHERE m.name = 'Беспокоите нас';

	SELECT m.id INTO id_movie_1
	FROM "public.Movies" m
	WHERE m.name = 'Жестко их';

	SELECT m.id INTO id_movie_2
	FROM "public.Movies" m
	WHERE m.name = 'Угроза, которой мы служим';

	SELECT m.id INTO id_movie_3
	FROM "public.Movies" m
	WHERE m.name = 'Сохранить пропуск';

	SELECT m.id INTO id_movie_4
	FROM "public.Movies" m
	WHERE m.name = 'Миссис Мейн Муха';

	SELECT m.id INTO id_movie_5
	FROM "public.Movies" m
	WHERE m.name = 'Муж';

	SELECT m.id INTO id_movie_6
	FROM "public.Movies" m
	WHERE m.name = 'Означает поддержку когда-либо';

	SELECT m.id INTO id_movie_7
	FROM "public.Movies" m
	WHERE m.name = 'Авторитетное присоединение';

	SELECT m.id INTO id_movie_8
	FROM "public.Movies" m
	WHERE m.name = 'День национального генерала';

	SELECT m.id INTO id_movie_9
	FROM "public.Movies" m
	WHERE m.name = 'Предлагать';

	SELECT m.id INTO id_movie_10
	FROM "public.Movies" m
	WHERE m.name = 'Бесплатно';

	SELECT m.id INTO id_movie_11
	FROM "public.Movies" m
	WHERE m.name = 'До внимания';

	SELECT m.id INTO id_movie_12
	FROM "public.Movies" m
	WHERE m.name = 'Ну представьте себе';

	SELECT m.id INTO id_movie_13
	FROM "public.Movies" m
	WHERE m.name = 'Особо светлый';

	SELECT m.id INTO id_movie_14
	FROM "public.Movies" m
	WHERE m.name = 'Север';

	SELECT m.id INTO id_movie_15
	FROM "public.Movies" m
	WHERE m.name = 'Теперь даже';

	SELECT m.id INTO id_movie_16
	FROM "public.Movies" m
	WHERE m.name = 'Определить, определить вид';

	SELECT m.id INTO id_movie_17
	FROM "public.Movies" m
	WHERE m.name = 'Голосуйте за ту же часть';

	SELECT m.id INTO id_movie_18
	FROM "public.Movies" m
	WHERE m.name = 'Простая кампания';

	SELECT m.id INTO id_movie_19
	FROM "public.Movies" m
	WHERE m.name = 'Мировая сумка-машина';

	SELECT m.id INTO id_movie_20
	FROM "public.Movies" m
	WHERE m.name = 'Люди';

	SELECT m.id INTO id_movie_21
	FROM "public.Movies" m
	WHERE m.name = 'Окно сто индивидуальное';

	SELECT m.id INTO id_movie_22
	FROM "public.Movies" m
	WHERE m.name = 'Тип семейства';

	SELECT m.id INTO id_movie_23
	FROM "public.Movies" m
	WHERE m.name = 'Кажется, имя успешное';

	SELECT m.id INTO id_movie_24
	FROM "public.Movies" m
	WHERE m.name = 'Энергия';

	SELECT m.id INTO id_movie_25
	FROM "public.Movies" m
	WHERE m.name = 'Дом';

	SELECT m.id INTO id_movie_26
	FROM "public.Movies" m
	WHERE m.name = 'Церковь';

	SELECT m.id INTO id_movie_27
	FROM "public.Movies" m
	WHERE m.name = 'Сегодня вечером';

	SELECT m.id INTO id_movie_28
	FROM "public.Movies" m
	WHERE m.name = 'За организационным искусством';

	SELECT m.id INTO id_movie_29
	FROM "public.Movies" m
	WHERE m.name = 'Фонд мира';

	SELECT m.id INTO id_movie_30
	FROM "public.Movies" m
	WHERE m.name = 'Впереди опыт брата';

	SELECT m.id INTO id_movie_31
	FROM "public.Movies" m
	WHERE m.name = 'Каждое близкое открытие';

	SELECT m.id INTO id_movie_32
	FROM "public.Movies" m
	WHERE m.name = 'Определять';

	SELECT m.id INTO id_movie_33
	FROM "public.Movies" m
	WHERE m.name = 'Еще';

	SELECT m.id INTO id_movie_34
	FROM "public.Movies" m
	WHERE m.name = 'Прогулочное стекло';

	SELECT m.id INTO id_movie_35
	FROM "public.Movies" m
	WHERE m.name = 'Если страдать';

	SELECT m.id INTO id_movie_36
	FROM "public.Movies" m
	WHERE m.name = 'Знакомство с природой';

	SELECT m.id INTO id_movie_37
	FROM "public.Movies" m
	WHERE m.name = 'Конец';

	SELECT m.id INTO id_movie_38
	FROM "public.Movies" m
	WHERE m.name = 'Встряхнуть администрацию';

	SELECT m.id INTO id_movie_39
	FROM "public.Movies" m
	WHERE m.name = 'Введите другой';

	SELECT m.id INTO id_movie_40
	FROM "public.Movies" m
	WHERE m.name = 'Вода';

	SELECT m.id INTO id_movie_41
	FROM "public.Movies" m
	WHERE m.name = 'Место, желающее место';

	SELECT m.id INTO id_movie_42
	FROM "public.Movies" m
	WHERE m.name = 'Вещи';

	SELECT m.id INTO id_movie_43
	FROM "public.Movies" m
	WHERE m.name = 'Последний официальный точно';

	SELECT m.id INTO id_movie_44
	FROM "public.Movies" m
	WHERE m.name = 'Существующее решение';

	SELECT m.id INTO id_movie_45
	FROM "public.Movies" m
	WHERE m.name = 'Трудно идентифицировать';

	SELECT m.id INTO id_movie_46
	FROM "public.Movies" m
	WHERE m.name = 'Коробка';

	SELECT m.id INTO id_movie_47
	FROM "public.Movies" m
	WHERE m.name = 'Разница';

	SELECT m.id INTO id_movie_48
	FROM "public.Movies" m
	WHERE m.name = 'Сестре конец, потому что';

	SELECT m.id INTO id_movie_49
	FROM "public.Movies" m
	WHERE m.name = 'Поднимись, слушай';

	SELECT m.id INTO id_movie_50
	FROM "public.Movies" m
	WHERE m.name = 'Рынок другой';

	SELECT m.id INTO id_movie_51
	FROM "public.Movies" m
	WHERE m.name = 'Почувствуйте, опишите производство';

	SELECT m.id INTO id_movie_52
	FROM "public.Movies" m
	WHERE m.name = 'Все вылезает наружу';

	SELECT m.id INTO id_movie_53
	FROM "public.Movies" m
	WHERE m.name = 'Требовать';

	SELECT m.id INTO id_movie_54
	FROM "public.Movies" m
	WHERE m.name = 'Одно целое раскрытие';

	SELECT m.id INTO id_movie_55
	FROM "public.Movies" m
	WHERE m.name = 'Купить';

	SELECT m.id INTO id_movie_56
	FROM "public.Movies" m
	WHERE m.name = 'Надеяться';

	SELECT m.id INTO id_movie_57
	FROM "public.Movies" m
	WHERE m.name = 'Беспокойство';

	SELECT m.id INTO id_movie_58
	FROM "public.Movies" m
	WHERE m.name = 'Живой мальчик, звук';

	SELECT m.id INTO id_movie_59
	FROM "public.Movies" m
	WHERE m.name = 'Цена двух попыток';

	SELECT m.id INTO id_movie_60
	FROM "public.Movies" m
	WHERE m.name = 'Агент по отцу';

	SELECT m.id INTO id_movie_61
	FROM "public.Movies" m
	WHERE m.name = 'По появлению';

	SELECT m.id INTO id_movie_62
	FROM "public.Movies" m
	WHERE m.name = 'Готовься пиши';

	SELECT m.id INTO id_movie_63
	FROM "public.Movies" m
	WHERE m.name = 'Служить производительности создавать';

	SELECT m.id INTO id_movie_64
	FROM "public.Movies" m
	WHERE m.name = 'Различный';

	SELECT m.id INTO id_movie_65
	FROM "public.Movies" m
	WHERE m.name = 'Семья';

	SELECT m.id INTO id_movie_66
	FROM "public.Movies" m
	WHERE m.name = 'Музыка Миссис';

	SELECT m.id INTO id_movie_67
	FROM "public.Movies" m
	WHERE m.name = 'Кусочек';

	SELECT m.id INTO id_movie_68
	FROM "public.Movies" m
	WHERE m.name = 'Усилие определенного ветра';

	SELECT m.id INTO id_movie_69
	FROM "public.Movies" m
	WHERE m.name = 'Медицинский брат, да';

	SELECT m.id INTO id_movie_70
	FROM "public.Movies" m
	WHERE m.name = 'Общество войной';

	SELECT m.id INTO id_movie_71
	FROM "public.Movies" m
	WHERE m.name = 'Синие наши они';

	SELECT m.id INTO id_movie_72
	FROM "public.Movies" m
	WHERE m.name = 'Сила страны';

	SELECT m.id INTO id_movie_73
	FROM "public.Movies" m
	WHERE m.name = 'Брат часть средняя';

	SELECT m.id INTO id_movie_74
	FROM "public.Movies" m
	WHERE m.name = 'Нация его поперек';

	SELECT m.id INTO id_movie_75
	FROM "public.Movies" m
	WHERE m.name = 'Никогда';

	SELECT m.id INTO id_movie_76
	FROM "public.Movies" m
	WHERE m.name = 'Офицер вполне';

	SELECT m.id INTO id_movie_77
	FROM "public.Movies" m
	WHERE m.name = 'Эксперт';

	SELECT m.id INTO id_movie_78
	FROM "public.Movies" m
	WHERE m.name = 'Расходы';

	SELECT m.id INTO id_movie_79
	FROM "public.Movies" m
	WHERE m.name = 'Мог распознать';

	SELECT m.id INTO id_movie_80
	FROM "public.Movies" m
	WHERE m.name = 'Чувство атаки читать';

	SELECT m.id INTO id_movie_81
	FROM "public.Movies" m
	WHERE m.name = 'Набор отчетов';

	SELECT m.id INTO id_movie_82
	FROM "public.Movies" m
	WHERE m.name = 'Современные другие учат';

	SELECT m.id INTO id_movie_83
	FROM "public.Movies" m
	WHERE m.name = 'С';

	SELECT m.id INTO id_movie_84
	FROM "public.Movies" m
	WHERE m.name = 'Готовый';

	SELECT m.id INTO id_movie_85
	FROM "public.Movies" m
	WHERE m.name = 'Иностранный довольно';

	SELECT m.id INTO id_movie_86
	FROM "public.Movies" m
	WHERE m.name = 'Позже';

	SELECT m.id INTO id_movie_87
	FROM "public.Movies" m
	WHERE m.name = 'Знак суммы момента';

	SELECT m.id INTO id_movie_88
	FROM "public.Movies" m
	WHERE m.name = 'Две войны';

	SELECT m.id INTO id_movie_89
	FROM "public.Movies" m
	WHERE m.name = 'Добрый или';

	SELECT m.id INTO id_movie_90
	FROM "public.Movies" m
	WHERE m.name = 'Никогда не режь';

	SELECT m.id INTO id_movie_91
	FROM "public.Movies" m
	WHERE m.name = 'Красивый подъем';

	SELECT m.id INTO id_movie_92
	FROM "public.Movies" m
	WHERE m.name = 'Ничего не упоминай, наш';

	SELECT m.id INTO id_movie_93
	FROM "public.Movies" m
	WHERE m.name = 'Количество';

	SELECT m.id INTO id_movie_94
	FROM "public.Movies" m
	WHERE m.name = 'Продолжить аналогичную сторону';

	SELECT m.id INTO id_movie_95
	FROM "public.Movies" m
	WHERE m.name = 'Обращаться';

	SELECT m.id INTO id_movie_96
	FROM "public.Movies" m
	WHERE m.name = 'Навык кровати поздно';

	SELECT m.id INTO id_movie_97
	FROM "public.Movies" m
	WHERE m.name = 'Школа разумного возраста';

	SELECT m.id INTO id_movie_98
	FROM "public.Movies" m
	WHERE m.name = 'Ответь хотя подумай';

	SELECT m.id INTO id_movie_99
	FROM "public.Movies" m
	WHERE m.name = 'Петь';

	SELECT m.id INTO id_movie_100
	FROM "public.Movies" m
	WHERE m.name = 'Класс закрыть';

	SELECT m.id INTO id_movie_101
	FROM "public.Movies" m
	WHERE m.name = 'Как оставаться политикой';

	SELECT m.id INTO id_movie_102
	FROM "public.Movies" m
	WHERE m.name = 'Каждому достаточно, как';

	SELECT m.id INTO id_movie_103
	FROM "public.Movies" m
	WHERE m.name = 'Этот адвокат по заданию';

	SELECT m.id INTO id_movie_104
	FROM "public.Movies" m
	WHERE m.name = 'До';

	SELECT m.id INTO id_movie_105
	FROM "public.Movies" m
	WHERE m.name = 'Земля';

	SELECT m.id INTO id_movie_106
	FROM "public.Movies" m
	WHERE m.name = 'Медицинский там, потому что';

	SELECT m.id INTO id_movie_107
	FROM "public.Movies" m
	WHERE m.name = 'Влияние на сайт';

	SELECT m.id INTO id_movie_108
	FROM "public.Movies" m
	WHERE m.name = 'Признайся во всем';

	SELECT m.id INTO id_movie_109
	FROM "public.Movies" m
	WHERE m.name = 'Вообще-то, отдохни после обеда';

	SELECT m.id INTO id_movie_110
	FROM "public.Movies" m
	WHERE m.name = 'Вытащите студента';

	SELECT m.id INTO id_movie_111
	FROM "public.Movies" m
	WHERE m.name = 'Включая';

	SELECT m.id INTO id_movie_112
	FROM "public.Movies" m
	WHERE m.name = 'Возможно, сначала';

	SELECT m.id INTO id_movie_113
	FROM "public.Movies" m
	WHERE m.name = 'Колледжский мяч.';

	SELECT m.id INTO id_movie_114
	FROM "public.Movies" m
	WHERE m.name = 'Явный рост производства';

	SELECT m.id INTO id_movie_115
	FROM "public.Movies" m
	WHERE m.name = 'К';

	SELECT m.id INTO id_movie_116
	FROM "public.Movies" m
	WHERE m.name = 'Особенно';

	SELECT m.id INTO id_movie_117
	FROM "public.Movies" m
	WHERE m.name = 'Отец смены станции';

	SELECT m.id INTO id_movie_118
	FROM "public.Movies" m
	WHERE m.name = 'Потерять магазин вечером';

	SELECT m.id INTO id_movie_119
	FROM "public.Movies" m
	WHERE m.name = 'Медицинское сообщество';

	SELECT m.id INTO id_movie_120
	FROM "public.Movies" m
	WHERE m.name = 'Причина кожи';

	SELECT m.id INTO id_movie_121
	FROM "public.Movies" m
	WHERE m.name = 'Характер';

	SELECT m.id INTO id_movie_122
	FROM "public.Movies" m
	WHERE m.name = 'Позволять';

	SELECT m.id INTO id_movie_123
	FROM "public.Movies" m
	WHERE m.name = 'Запад';

	SELECT m.id INTO id_movie_124
	FROM "public.Movies" m
	WHERE m.name = 'Спорить, раскрывать';

	SELECT m.id INTO id_movie_125
	FROM "public.Movies" m
	WHERE m.name = 'Середина';

	SELECT m.id INTO id_movie_126
	FROM "public.Movies" m
	WHERE m.name = 'Вариант генерала его';

	SELECT m.id INTO id_movie_127
	FROM "public.Movies" m
	WHERE m.name = 'Вести';

	SELECT m.id INTO id_movie_128
	FROM "public.Movies" m
	WHERE m.name = 'Вскоре компьютер и';

	SELECT m.id INTO id_movie_129
	FROM "public.Movies" m
	WHERE m.name = 'Поздно счастлив';

	SELECT m.id INTO id_movie_130
	FROM "public.Movies" m
	WHERE m.name = 'Другие тоже сами';

	SELECT m.id INTO id_movie_131
	FROM "public.Movies" m
	WHERE m.name = 'Часовое здание';

	SELECT m.id INTO id_movie_132
	FROM "public.Movies" m
	WHERE m.name = 'Все может быть';

	SELECT m.id INTO id_movie_133
	FROM "public.Movies" m
	WHERE m.name = 'Работа';

	INSERT INTO "public.Films_positions" (member_id, movie_id, name) VALUES
		(id_member_0, id_movie_0, 'Актер'),
		(id_member_0, id_movie_1, 'Актер'),
		(id_member_1, id_movie_2, 'Актер'),
		(id_member_1, id_movie_3, 'Актер'),
		(id_member_2, id_movie_4, 'Актер'),
		(id_member_3, id_movie_5, 'Актер'),
		(id_member_4, id_movie_6, 'Актер'),
		(id_member_4, id_movie_7, 'Актер'),
		(id_member_5, id_movie_8, 'Актер'),
		(id_member_6, id_movie_9, 'Актер'),
		(id_member_6, id_movie_10, 'Актер'),
		(id_member_6, id_movie_11, 'Актер'),
		(id_member_7, id_movie_12, 'Актер'),
		(id_member_7, id_movie_13, 'Актер'),
		(id_member_8, id_movie_14, 'Актер'),
		(id_member_9, id_movie_15, 'Актер'),
		(id_member_10, id_movie_16, 'Актер'),
		(id_member_10, id_movie_17, 'Актер'),
		(id_member_10, id_movie_18, 'Актер'),
		(id_member_11, id_movie_11, 'Актер'),
		(id_member_12, id_movie_19, 'Актер'),
		(id_member_12, id_movie_16, 'Актер'),
		(id_member_12, id_movie_20, 'Актер'),
		(id_member_13, id_movie_21, 'Актер'),
		(id_member_14, id_movie_22, 'Актер'),
		(id_member_14, id_movie_23, 'Актер'),
		(id_member_15, id_movie_4, 'Актер'),
		(id_member_15, id_movie_24, 'Актер'),
		(id_member_15, id_movie_25, 'Актер'),
		(id_member_16, id_movie_26, 'Актер'),
		(id_member_16, id_movie_27, 'Актер'),
		(id_member_16, id_movie_28, 'Актер'),
		(id_member_17, id_movie_29, 'Актер'),
		(id_member_17, id_movie_30, 'Актер'),
		(id_member_17, id_movie_31, 'Актер'),
		(id_member_18, id_movie_32, 'Актер'),
		(id_member_19, id_movie_24, 'Актер'),
		(id_member_20, id_movie_33, 'Актер'),
		(id_member_20, id_movie_34, 'Актер'),
		(id_member_21, id_movie_35, 'Актер'),
		(id_member_22, id_movie_22, 'Актер'),
		(id_member_22, id_movie_36, 'Актер'),
		(id_member_23, id_movie_37, 'Актер'),
		(id_member_23, id_movie_38, 'Актер'),
		(id_member_23, id_movie_36, 'Актер'),
		(id_member_24, id_movie_39, 'Актер'),
		(id_member_24, id_movie_40, 'Актер'),
		(id_member_25, id_movie_41, 'Актер'),
		(id_member_26, id_movie_42, 'Актер'),
		(id_member_26, id_movie_7, 'Актер'),
		(id_member_26, id_movie_43, 'Актер'),
		(id_member_27, id_movie_19, 'Актер'),
		(id_member_27, id_movie_44, 'Актер'),
		(id_member_27, id_movie_45, 'Актер'),
		(id_member_28, id_movie_46, 'Актер'),
		(id_member_28, id_movie_3, 'Актер'),
		(id_member_29, id_movie_47, 'Актер'),
		(id_member_29, id_movie_48, 'Актер'),
		(id_member_30, id_movie_49, 'Актер'),
		(id_member_30, id_movie_50, 'Актер'),
		(id_member_30, id_movie_51, 'Актер'),
		(id_member_31, id_movie_52, 'Актер'),
		(id_member_31, id_movie_53, 'Актер'),
		(id_member_32, id_movie_54, 'Актер'),
		(id_member_32, id_movie_55, 'Актер'),
		(id_member_33, id_movie_56, 'Актер'),
		(id_member_33, id_movie_57, 'Актер'),
		(id_member_34, id_movie_58, 'Актер'),
		(id_member_35, id_movie_59, 'Актер'),
		(id_member_36, id_movie_60, 'Актер'),
		(id_member_37, id_movie_61, 'Актер'),
		(id_member_38, id_movie_62, 'Актер'),
		(id_member_39, id_movie_63, 'Актер'),
		(id_member_39, id_movie_16, 'Актер'),
		(id_member_39, id_movie_23, 'Актер'),
		(id_member_40, id_movie_64, 'Актер'),
		(id_member_41, id_movie_0, 'Актер'),
		(id_member_42, id_movie_65, 'Актер'),
		(id_member_42, id_movie_55, 'Актер'),
		(id_member_42, id_movie_66, 'Актер'),
		(id_member_43, id_movie_64, 'Актер'),
		(id_member_43, id_movie_27, 'Актер'),
		(id_member_44, id_movie_20, 'Актер'),
		(id_member_45, id_movie_67, 'Актер'),
		(id_member_45, id_movie_33, 'Актер'),
		(id_member_45, id_movie_10, 'Актер'),
		(id_member_46, id_movie_68, 'Актер'),
		(id_member_47, id_movie_47, 'Актер'),
		(id_member_47, id_movie_69, 'Актер'),
		(id_member_47, id_movie_70, 'Актер'),
		(id_member_48, id_movie_40, 'Актер'),
		(id_member_49, id_movie_71, 'Актер'),
		(id_member_49, id_movie_72, 'Актер'),
		(id_member_50, id_movie_73, 'Актер'),
		(id_member_50, id_movie_43, 'Актер'),
		(id_member_50, id_movie_74, 'Актер'),
		(id_member_51, id_movie_75, 'Актер'),
		(id_member_52, id_movie_58, 'Актер'),
		(id_member_52, id_movie_76, 'Актер'),
		(id_member_52, id_movie_59, 'Актер'),
		(id_member_53, id_movie_77, 'Актер'),
		(id_member_53, id_movie_48, 'Актер'),
		(id_member_53, id_movie_78, 'Актер'),
		(id_member_54, id_movie_79, 'Актер'),
		(id_member_54, id_movie_13, 'Актер'),
		(id_member_54, id_movie_80, 'Актер'),
		(id_member_55, id_movie_74, 'Актер'),
		(id_member_55, id_movie_81, 'Актер'),
		(id_member_56, id_movie_61, 'Актер'),
		(id_member_57, id_movie_36, 'Актер'),
		(id_member_58, id_movie_9, 'Актер'),
		(id_member_59, id_movie_29, 'Актер'),
		(id_member_59, id_movie_82, 'Актер'),
		(id_member_59, id_movie_83, 'Актер'),
		(id_member_60, id_movie_40, 'Актер'),
		(id_member_61, id_movie_84, 'Актер'),
		(id_member_61, id_movie_85, 'Актер'),
		(id_member_61, id_movie_33, 'Актер'),
		(id_member_62, id_movie_86, 'Актер'),
		(id_member_63, id_movie_87, 'Актер'),
		(id_member_63, id_movie_37, 'Актер'),
		(id_member_63, id_movie_57, 'Актер'),
		(id_member_64, id_movie_29, 'Актер'),
		(id_member_65, id_movie_88, 'Актер'),
		(id_member_65, id_movie_47, 'Актер'),
		(id_member_65, id_movie_50, 'Актер'),
		(id_member_66, id_movie_34, 'Актер'),
		(id_member_67, id_movie_74, 'Актер'),
		(id_member_67, id_movie_83, 'Актер'),
		(id_member_68, id_movie_9, 'Актер'),
		(id_member_68, id_movie_3, 'Актер'),
		(id_member_68, id_movie_62, 'Актер'),
		(id_member_69, id_movie_23, 'Актер'),
		(id_member_69, id_movie_71, 'Актер'),
		(id_member_70, id_movie_42, 'Актер'),
		(id_member_70, id_movie_89, 'Актер'),
		(id_member_71, id_movie_84, 'Актер'),
		(id_member_71, id_movie_24, 'Актер'),
		(id_member_71, id_movie_69, 'Актер'),
		(id_member_72, id_movie_89, 'Актер'),
		(id_member_72, id_movie_44, 'Актер'),
		(id_member_73, id_movie_25, 'Актер'),
		(id_member_74, id_movie_90, 'Актер'),
		(id_member_74, id_movie_30, 'Актер'),
		(id_member_75, id_movie_4, 'Актер'),
		(id_member_76, id_movie_38, 'Актер'),
		(id_member_76, id_movie_15, 'Актер'),
		(id_member_77, id_movie_57, 'Актер'),
		(id_member_78, id_movie_91, 'Актер'),
		(id_member_79, id_movie_61, 'Актер'),
		(id_member_79, id_movie_20, 'Актер'),
		(id_member_80, id_movie_73, 'Актер'),
		(id_member_80, id_movie_92, 'Актер'),
		(id_member_80, id_movie_21, 'Актер'),
		(id_member_81, id_movie_93, 'Актер'),
		(id_member_81, id_movie_94, 'Актер'),
		(id_member_81, id_movie_26, 'Актер'),
		(id_member_82, id_movie_95, 'Актер'),
		(id_member_82, id_movie_96, 'Актер'),
		(id_member_83, id_movie_42, 'Актер'),
		(id_member_83, id_movie_43, 'Актер'),
		(id_member_84, id_movie_58, 'Актер'),
		(id_member_84, id_movie_83, 'Актер'),
		(id_member_84, id_movie_70, 'Актер'),
		(id_member_85, id_movie_97, 'Актер'),
		(id_member_85, id_movie_6, 'Актер'),
		(id_member_85, id_movie_7, 'Актер'),
		(id_member_86, id_movie_98, 'Актер'),
		(id_member_87, id_movie_99, 'Актер'),
		(id_member_87, id_movie_49, 'Актер'),
		(id_member_88, id_movie_35, 'Актер'),
		(id_member_88, id_movie_79, 'Актер'),
		(id_member_88, id_movie_100, 'Актер'),
		(id_member_89, id_movie_84, 'Актер'),
		(id_member_89, id_movie_101, 'Актер'),
		(id_member_90, id_movie_102, 'Актер'),
		(id_member_90, id_movie_100, 'Актер'),
		(id_member_91, id_movie_49, 'Актер'),
		(id_member_92, id_movie_8, 'Актер'),
		(id_member_93, id_movie_20, 'Актер'),
		(id_member_94, id_movie_4, 'Актер'),
		(id_member_94, id_movie_69, 'Актер'),
		(id_member_95, id_movie_103, 'Актер'),
		(id_member_95, id_movie_64, 'Актер'),
		(id_member_95, id_movie_104, 'Актер'),
		(id_member_96, id_movie_26, 'Актер'),
		(id_member_97, id_movie_5, 'Актер'),
		(id_member_97, id_movie_38, 'Актер'),
		(id_member_98, id_movie_91, 'Актер'),
		(id_member_99, id_movie_85, 'Актер'),
		(id_member_99, id_movie_105, 'Актер'),
		(id_member_99, id_movie_51, 'Актер'),
		(id_member_100, id_movie_92, 'Актер'),
		(id_member_101, id_movie_96, 'Актер'),
		(id_member_101, id_movie_71, 'Актер'),
		(id_member_101, id_movie_93, 'Актер'),
		(id_member_102, id_movie_82, 'Актер'),
		(id_member_102, id_movie_81, 'Актер'),
		(id_member_102, id_movie_83, 'Актер'),
		(id_member_103, id_movie_85, 'Актер'),
		(id_member_104, id_movie_70, 'Актер'),
		(id_member_104, id_movie_67, 'Актер'),
		(id_member_105, id_movie_106, 'Актер'),
		(id_member_105, id_movie_69, 'Актер'),
		(id_member_106, id_movie_38, 'Актер'),
		(id_member_106, id_movie_107, 'Актер'),
		(id_member_106, id_movie_106, 'Актер'),
		(id_member_107, id_movie_2, 'Актер'),
		(id_member_107, id_movie_19, 'Актер'),
		(id_member_108, id_movie_108, 'Актер'),
		(id_member_108, id_movie_109, 'Актер'),
		(id_member_109, id_movie_92, 'Актер'),
		(id_member_109, id_movie_110, 'Актер'),
		(id_member_109, id_movie_73, 'Актер'),
		(id_member_110, id_movie_90, 'Актер'),
		(id_member_111, id_movie_111, 'Актер'),
		(id_member_111, id_movie_55, 'Актер'),
		(id_member_112, id_movie_92, 'Актер'),
		(id_member_113, id_movie_7, 'Актер'),
		(id_member_113, id_movie_112, 'Актер'),
		(id_member_114, id_movie_70, 'Актер'),
		(id_member_114, id_movie_113, 'Актер'),
		(id_member_114, id_movie_62, 'Актер'),
		(id_member_115, id_movie_71, 'Актер'),
		(id_member_115, id_movie_98, 'Актер'),
		(id_member_115, id_movie_114, 'Актер'),
		(id_member_116, id_movie_74, 'Актер'),
		(id_member_116, id_movie_115, 'Актер'),
		(id_member_117, id_movie_16, 'Актер'),
		(id_member_118, id_movie_76, 'Актер'),
		(id_member_118, id_movie_64, 'Актер'),
		(id_member_118, id_movie_42, 'Актер'),
		(id_member_119, id_movie_49, 'Актер'),
		(id_member_119, id_movie_92, 'Актер'),
		(id_member_119, id_movie_116, 'Актер'),
		(id_member_120, id_movie_117, 'Актер'),
		(id_member_120, id_movie_2, 'Актер'),
		(id_member_121, id_movie_48, 'Актер'),
		(id_member_121, id_movie_25, 'Актер'),
		(id_member_122, id_movie_32, 'Актер'),
		(id_member_122, id_movie_13, 'Актер'),
		(id_member_122, id_movie_104, 'Актер'),
		(id_member_123, id_movie_23, 'Актер'),
		(id_member_124, id_movie_118, 'Актер'),
		(id_member_124, id_movie_50, 'Актер'),
		(id_member_125, id_movie_119, 'Актер'),
		(id_member_126, id_movie_107, 'Актер'),
		(id_member_127, id_movie_104, 'Актер'),
		(id_member_127, id_movie_50, 'Актер'),
		(id_member_128, id_movie_69, 'Актер'),
		(id_member_128, id_movie_98, 'Актер'),
		(id_member_128, id_movie_33, 'Актер'),
		(id_member_129, id_movie_108, 'Актер'),
		(id_member_129, id_movie_65, 'Актер'),
		(id_member_130, id_movie_120, 'Актер'),
		(id_member_131, id_movie_74, 'Актер'),
		(id_member_131, id_movie_112, 'Актер'),
		(id_member_132, id_movie_118, 'Актер'),
		(id_member_132, id_movie_44, 'Актер'),
		(id_member_132, id_movie_50, 'Актер'),
		(id_member_133, id_movie_101, 'Актер'),
		(id_member_133, id_movie_3, 'Актер'),
		(id_member_133, id_movie_99, 'Актер'),
		(id_member_134, id_movie_121, 'Актер'),
		(id_member_134, id_movie_24, 'Актер'),
		(id_member_135, id_movie_122, 'Актер'),
		(id_member_135, id_movie_44, 'Актер'),
		(id_member_136, id_movie_31, 'Актер'),
		(id_member_136, id_movie_16, 'Актер'),
		(id_member_136, id_movie_63, 'Актер'),
		(id_member_137, id_movie_65, 'Актер'),
		(id_member_138, id_movie_35, 'Актер'),
		(id_member_138, id_movie_22, 'Актер'),
		(id_member_138, id_movie_77, 'Актер'),
		(id_member_139, id_movie_123, 'Актер'),
		(id_member_139, id_movie_10, 'Актер'),
		(id_member_140, id_movie_119, 'Актер'),
		(id_member_141, id_movie_87, 'Актер'),
		(id_member_141, id_movie_11, 'Актер'),
		(id_member_142, id_movie_76, 'Актер'),
		(id_member_142, id_movie_19, 'Актер'),
		(id_member_143, id_movie_41, 'Актер'),
		(id_member_143, id_movie_81, 'Актер'),
		(id_member_143, id_movie_56, 'Актер'),
		(id_member_144, id_movie_45, 'Актер'),
		(id_member_144, id_movie_41, 'Актер'),
		(id_member_144, id_movie_77, 'Актер'),
		(id_member_145, id_movie_54, 'Актер'),
		(id_member_145, id_movie_113, 'Актер'),
		(id_member_146, id_movie_33, 'Актер'),
		(id_member_146, id_movie_79, 'Актер'),
		(id_member_146, id_movie_94, 'Актер'),
		(id_member_147, id_movie_119, 'Актер'),
		(id_member_147, id_movie_85, 'Актер'),
		(id_member_147, id_movie_60, 'Актер'),
		(id_member_148, id_movie_47, 'Актер'),
		(id_member_148, id_movie_29, 'Актер'),
		(id_member_149, id_movie_12, 'Актер'),
		(id_member_149, id_movie_47, 'Актер'),
		(id_member_149, id_movie_89, 'Актер'),
		(id_member_150, id_movie_103, 'Актер'),
		(id_member_151, id_movie_71, 'Актер'),
		(id_member_151, id_movie_124, 'Актер'),
		(id_member_152, id_movie_52, 'Актер'),
		(id_member_152, id_movie_24, 'Актер'),
		(id_member_153, id_movie_22, 'Актер'),
		(id_member_153, id_movie_8, 'Актер'),
		(id_member_153, id_movie_89, 'Актер'),
		(id_member_154, id_movie_80, 'Актер'),
		(id_member_154, id_movie_94, 'Актер'),
		(id_member_155, id_movie_52, 'Актер'),
		(id_member_155, id_movie_125, 'Актер'),
		(id_member_155, id_movie_36, 'Актер'),
		(id_member_156, id_movie_38, 'Актер'),
		(id_member_156, id_movie_122, 'Актер'),
		(id_member_156, id_movie_96, 'Актер'),
		(id_member_157, id_movie_105, 'Актер'),
		(id_member_157, id_movie_126, 'Актер'),
		(id_member_157, id_movie_46, 'Актер'),
		(id_member_158, id_movie_0, 'Актер'),
		(id_member_158, id_movie_127, 'Актер'),
		(id_member_159, id_movie_15, 'Актер'),
		(id_member_160, id_movie_4, 'Актер'),
		(id_member_160, id_movie_11, 'Актер'),
		(id_member_160, id_movie_121, 'Актер'),
		(id_member_161, id_movie_52, 'Актер'),
		(id_member_161, id_movie_84, 'Актер'),
		(id_member_161, id_movie_55, 'Актер'),
		(id_member_162, id_movie_74, 'Актер'),
		(id_member_163, id_movie_67, 'Актер'),
		(id_member_164, id_movie_79, 'Актер'),
		(id_member_165, id_movie_28, 'Актер'),
		(id_member_165, id_movie_87, 'Актер'),
		(id_member_166, id_movie_25, 'Актер'),
		(id_member_167, id_movie_60, 'Актер'),
		(id_member_167, id_movie_100, 'Актер'),
		(id_member_168, id_movie_52, 'Актер'),
		(id_member_168, id_movie_128, 'Актер'),
		(id_member_169, id_movie_64, 'Актер'),
		(id_member_170, id_movie_62, 'Актер'),
		(id_member_171, id_movie_5, 'Актер'),
		(id_member_171, id_movie_30, 'Актер'),
		(id_member_171, id_movie_111, 'Актер'),
		(id_member_172, id_movie_94, 'Актер'),
		(id_member_172, id_movie_2, 'Актер'),
		(id_member_172, id_movie_7, 'Актер'),
		(id_member_173, id_movie_96, 'Актер'),
		(id_member_174, id_movie_7, 'Актер'),
		(id_member_174, id_movie_70, 'Актер'),
		(id_member_174, id_movie_115, 'Актер'),
		(id_member_175, id_movie_58, 'Актер'),
		(id_member_175, id_movie_106, 'Актер'),
		(id_member_176, id_movie_105, 'Актер'),
		(id_member_176, id_movie_108, 'Актер'),
		(id_member_176, id_movie_12, 'Актер'),
		(id_member_177, id_movie_41, 'Актер'),
		(id_member_177, id_movie_18, 'Актер'),
		(id_member_177, id_movie_129, 'Актер'),
		(id_member_178, id_movie_6, 'Актер'),
		(id_member_179, id_movie_79, 'Актер'),
		(id_member_179, id_movie_44, 'Актер'),
		(id_member_180, id_movie_17, 'Актер'),
		(id_member_181, id_movie_109, 'Актер'),
		(id_member_181, id_movie_37, 'Актер'),
		(id_member_181, id_movie_12, 'Актер'),
		(id_member_182, id_movie_130, 'Актер'),
		(id_member_183, id_movie_39, 'Актер'),
		(id_member_183, id_movie_109, 'Актер'),
		(id_member_183, id_movie_117, 'Актер'),
		(id_member_184, id_movie_116, 'Актер'),
		(id_member_184, id_movie_73, 'Актер'),
		(id_member_184, id_movie_19, 'Актер'),
		(id_member_185, id_movie_59, 'Актер'),
		(id_member_186, id_movie_45, 'Актер'),
		(id_member_186, id_movie_131, 'Актер'),
		(id_member_186, id_movie_117, 'Актер'),
		(id_member_187, id_movie_132, 'Актер'),
		(id_member_187, id_movie_22, 'Актер'),
		(id_member_188, id_movie_104, 'Актер'),
		(id_member_189, id_movie_6, 'Актер'),
		(id_member_190, id_movie_102, 'Актер'),
		(id_member_190, id_movie_90, 'Актер'),
		(id_member_191, id_movie_1, 'Актер'),
		(id_member_192, id_movie_77, 'Актер'),
		(id_member_193, id_movie_130, 'Актер'),
		(id_member_194, id_movie_10, 'Актер'),
		(id_member_194, id_movie_56, 'Актер'),
		(id_member_194, id_movie_126, 'Актер'),
		(id_member_195, id_movie_31, 'Актер'),
		(id_member_195, id_movie_52, 'Актер'),
		(id_member_196, id_movie_7, 'Актер'),
		(id_member_196, id_movie_40, 'Актер'),
		(id_member_197, id_movie_33, 'Актер'),
		(id_member_198, id_movie_133, 'Актер'),
		(id_member_198, id_movie_59, 'Актер'),
		(id_member_199, id_movie_31, 'Актер'),
		(id_member_199, id_movie_96, 'Актер');
END $$;



INSERT INTO "public.Primes" (name) VALUES
	('Оскар'),
	('Золотой глобус'),
	('Британская академия'),
	('Сезар'),
	('Премия Гильдии актеров'),
	('Сатурн'),
	('Гойя'),
	('Эмми'),
	('Азиатская киноакадемия'),
	('Европейская киноакадемия'),
	('Премия канала «MTV»'),
	('Золотая малина');



DO $$
DECLARE id_member_0 INT;
DECLARE id_member_1 INT;
DECLARE id_member_2 INT;
DECLARE id_member_3 INT;
DECLARE id_member_4 INT;
DECLARE id_member_5 INT;
DECLARE id_member_6 INT;
DECLARE id_member_7 INT;
DECLARE id_member_8 INT;
DECLARE id_member_9 INT;
DECLARE id_member_10 INT;
DECLARE id_member_11 INT;
DECLARE id_member_12 INT;
DECLARE id_member_13 INT;
DECLARE id_member_14 INT;
DECLARE id_member_15 INT;
DECLARE id_member_16 INT;
DECLARE id_member_17 INT;
DECLARE id_member_18 INT;
DECLARE id_member_19 INT;
DECLARE id_member_20 INT;
DECLARE id_member_21 INT;
DECLARE id_member_22 INT;
DECLARE id_member_23 INT;
DECLARE id_member_24 INT;
DECLARE id_member_25 INT;
DECLARE id_member_26 INT;
DECLARE id_member_27 INT;
DECLARE id_member_28 INT;
DECLARE id_member_29 INT;
DECLARE id_member_30 INT;
DECLARE id_member_31 INT;
DECLARE id_member_32 INT;
DECLARE id_member_33 INT;
DECLARE id_member_34 INT;
DECLARE id_member_35 INT;
DECLARE id_member_36 INT;
DECLARE id_member_37 INT;
DECLARE id_member_38 INT;
DECLARE id_member_39 INT;
DECLARE id_member_40 INT;
DECLARE id_member_41 INT;
DECLARE id_member_42 INT;
DECLARE id_member_43 INT;
DECLARE id_member_44 INT;
DECLARE id_member_45 INT;
DECLARE id_member_46 INT;
DECLARE id_member_47 INT;
DECLARE id_member_48 INT;
DECLARE id_member_49 INT;
DECLARE id_member_50 INT;
DECLARE id_member_51 INT;
DECLARE id_member_52 INT;
DECLARE id_member_53 INT;
DECLARE id_member_54 INT;
DECLARE id_member_55 INT;
DECLARE id_member_56 INT;
DECLARE id_member_57 INT;
DECLARE id_member_58 INT;
DECLARE id_member_59 INT;
DECLARE id_member_60 INT;
DECLARE id_member_61 INT;
DECLARE id_member_62 INT;
DECLARE id_member_63 INT;
DECLARE id_member_64 INT;
DECLARE id_member_65 INT;
DECLARE id_member_66 INT;
DECLARE id_member_67 INT;
DECLARE id_member_68 INT;
DECLARE id_member_69 INT;
DECLARE id_member_70 INT;
DECLARE id_member_71 INT;
DECLARE id_member_72 INT;
DECLARE id_member_73 INT;
DECLARE id_member_74 INT;
DECLARE id_member_75 INT;
DECLARE id_member_76 INT;
DECLARE id_member_77 INT;
DECLARE id_member_78 INT;
DECLARE id_member_79 INT;
DECLARE id_member_80 INT;
DECLARE id_member_81 INT;
DECLARE id_member_82 INT;
DECLARE id_member_83 INT;
DECLARE id_member_84 INT;
DECLARE id_member_85 INT;
DECLARE id_member_86 INT;
DECLARE id_member_87 INT;
DECLARE id_member_88 INT;
DECLARE id_member_89 INT;
DECLARE id_member_90 INT;
DECLARE id_member_91 INT;
DECLARE id_member_92 INT;
DECLARE id_member_93 INT;
DECLARE id_member_94 INT;
DECLARE id_member_95 INT;
DECLARE id_member_96 INT;
DECLARE id_member_97 INT;
DECLARE id_member_98 INT;
DECLARE id_member_99 INT;
DECLARE id_member_100 INT;
DECLARE id_member_101 INT;
DECLARE id_member_102 INT;
DECLARE id_member_103 INT;
DECLARE id_movie_0 INT;
DECLARE id_movie_1 INT;
DECLARE id_movie_2 INT;
DECLARE id_movie_3 INT;
DECLARE id_movie_4 INT;
DECLARE id_movie_5 INT;
DECLARE id_movie_6 INT;
DECLARE id_movie_7 INT;
DECLARE id_movie_8 INT;
DECLARE id_movie_9 INT;
DECLARE id_movie_10 INT;
DECLARE id_movie_11 INT;
DECLARE id_movie_12 INT;
DECLARE id_movie_13 INT;
DECLARE id_movie_14 INT;
DECLARE id_movie_15 INT;
DECLARE id_movie_16 INT;
DECLARE id_movie_17 INT;
DECLARE id_movie_18 INT;
DECLARE id_movie_19 INT;
DECLARE id_movie_20 INT;
DECLARE id_movie_21 INT;
DECLARE id_movie_22 INT;
DECLARE id_movie_23 INT;
DECLARE id_movie_24 INT;
DECLARE id_movie_25 INT;
DECLARE id_movie_26 INT;
DECLARE id_movie_27 INT;
DECLARE id_movie_28 INT;
DECLARE id_movie_29 INT;
DECLARE id_movie_30 INT;
DECLARE id_movie_31 INT;
DECLARE id_movie_32 INT;
DECLARE id_movie_33 INT;
DECLARE id_movie_34 INT;
DECLARE id_movie_35 INT;
DECLARE id_movie_36 INT;
DECLARE id_movie_37 INT;
DECLARE id_movie_38 INT;
DECLARE id_movie_39 INT;
DECLARE id_movie_40 INT;
DECLARE id_movie_41 INT;
DECLARE id_movie_42 INT;
DECLARE id_movie_43 INT;
DECLARE id_movie_44 INT;
DECLARE id_movie_45 INT;
DECLARE id_movie_46 INT;
DECLARE id_movie_47 INT;
DECLARE id_movie_48 INT;
DECLARE id_movie_49 INT;
DECLARE id_movie_50 INT;
DECLARE id_movie_51 INT;
DECLARE id_movie_52 INT;
DECLARE id_movie_53 INT;
DECLARE id_movie_54 INT;
DECLARE id_movie_55 INT;
DECLARE id_movie_56 INT;
DECLARE id_movie_57 INT;
DECLARE id_movie_58 INT;
DECLARE id_movie_59 INT;
DECLARE id_movie_60 INT;
DECLARE id_movie_61 INT;
DECLARE id_movie_62 INT;
DECLARE id_movie_63 INT;
DECLARE id_movie_64 INT;
DECLARE id_movie_65 INT;
DECLARE id_movie_66 INT;
DECLARE id_movie_67 INT;
DECLARE id_movie_68 INT;
DECLARE id_movie_69 INT;
DECLARE id_movie_70 INT;
DECLARE id_movie_71 INT;
DECLARE id_movie_72 INT;
DECLARE id_movie_73 INT;
DECLARE id_movie_74 INT;
DECLARE id_movie_75 INT;
DECLARE id_movie_76 INT;
DECLARE id_movie_77 INT;
DECLARE id_movie_78 INT;
DECLARE id_movie_79 INT;
DECLARE id_movie_80 INT;
DECLARE id_movie_81 INT;
DECLARE id_movie_82 INT;
DECLARE id_movie_83 INT;
DECLARE id_movie_84 INT;
DECLARE id_movie_85 INT;
DECLARE id_movie_86 INT;
DECLARE id_movie_87 INT;
DECLARE id_movie_88 INT;
DECLARE id_movie_89 INT;
DECLARE id_movie_90 INT;
DECLARE id_movie_91 INT;
DECLARE id_movie_92 INT;
DECLARE id_movie_93 INT;
DECLARE id_movie_94 INT;
DECLARE id_movie_95 INT;
DECLARE id_movie_96 INT;
DECLARE id_movie_97 INT;
DECLARE id_movie_98 INT;
DECLARE id_movie_99 INT;
DECLARE id_movie_100 INT;
DECLARE id_movie_101 INT;
DECLARE id_movie_102 INT;
DECLARE id_movie_103 INT;
DECLARE id_movie_104 INT;
DECLARE id_movie_105 INT;
DECLARE id_movie_106 INT;
DECLARE id_movie_107 INT;
DECLARE id_movie_108 INT;
DECLARE id_movie_109 INT;
DECLARE id_movie_110 INT;
DECLARE id_movie_111 INT;
DECLARE id_movie_112 INT;
DECLARE id_movie_113 INT;
DECLARE id_movie_114 INT;
DECLARE id_movie_115 INT;
DECLARE id_movie_116 INT;
DECLARE id_movie_117 INT;
DECLARE id_movie_118 INT;
DECLARE id_movie_119 INT;

BEGIN
	SELECT cm.id INTO id_member_0
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Эрик Янг';

	SELECT cm.id INTO id_member_1
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Джанет Шепард';

	SELECT cm.id INTO id_member_2
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Дэвид Диас';

	SELECT cm.id INTO id_member_3
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Марк Джонсон';

	SELECT cm.id INTO id_member_4
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Алан Грин';

	SELECT cm.id INTO id_member_5
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Дерек Бонд';

	SELECT cm.id INTO id_member_6
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Бенджамин Чен';

	SELECT cm.id INTO id_member_7
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Линда Филлипс';

	SELECT cm.id INTO id_member_8
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Рита Макдональд';

	SELECT cm.id INTO id_member_9
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Меган Финли';

	SELECT cm.id INTO id_member_10
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Фрэнсис Хаус';

	SELECT cm.id INTO id_member_11
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Джессика Эдвардс';

	SELECT cm.id INTO id_member_12
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Эмили Галлахер';

	SELECT cm.id INTO id_member_13
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Джейкоб Принс';

	SELECT cm.id INTO id_member_14
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Джилл Томас';

	SELECT cm.id INTO id_member_15
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Келли Гордон';

	SELECT cm.id INTO id_member_16
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Мелисса Вуд';

	SELECT cm.id INTO id_member_17
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Кори Джордан';

	SELECT cm.id INTO id_member_18
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Кэролин Моралес';

	SELECT cm.id INTO id_member_19
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Джеймс Хейли';

	SELECT cm.id INTO id_member_20
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Кэти Хикман';

	SELECT cm.id INTO id_member_21
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Кэссиди Блейк';

	SELECT cm.id INTO id_member_22
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Паула Стронг';

	SELECT cm.id INTO id_member_23
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Тоня Родригес';

	SELECT cm.id INTO id_member_24
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Уитни Эрнандес';

	SELECT cm.id INTO id_member_25
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Эмбер Ривера';

	SELECT cm.id INTO id_member_26
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Реджина Фелпс';

	SELECT cm.id INTO id_member_27
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Джесси Соса';

	SELECT cm.id INTO id_member_28
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Мари Меркадо';

	SELECT cm.id INTO id_member_29
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Марк Пинеда';

	SELECT cm.id INTO id_member_30
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Джейсон Грей';

	SELECT cm.id INTO id_member_31
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Андре Джексон';

	SELECT cm.id INTO id_member_32
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Кейтлин Коллиер';

	SELECT cm.id INTO id_member_33
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Дэвид Адамс';

	SELECT cm.id INTO id_member_34
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Трэвис Харрис';

	SELECT cm.id INTO id_member_35
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Линда Макинтайр';

	SELECT cm.id INTO id_member_36
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Скотт Стэнли';

	SELECT cm.id INTO id_member_37
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Родни Бреннан';

	SELECT cm.id INTO id_member_38
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Дуглас Миллер';

	SELECT cm.id INTO id_member_39
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Кайла Янг';

	SELECT cm.id INTO id_member_40
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Маркус Росалес';

	SELECT cm.id INTO id_member_41
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Кристофер Тейлор';

	SELECT cm.id INTO id_member_42
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Джессика Дэвис';

	SELECT cm.id INTO id_member_43
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Гленн Паркс';

	SELECT cm.id INTO id_member_44
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Дэвид Уилсон';

	SELECT cm.id INTO id_member_45
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Маргарет Майлз';

	SELECT cm.id INTO id_member_46
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Бриттни Филлипс';

	SELECT cm.id INTO id_member_47
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Кари Грин';

	SELECT cm.id INTO id_member_48
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Мелисса Роу';

	SELECT cm.id INTO id_member_49
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Кэти Леон';

	SELECT cm.id INTO id_member_50
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Чейз Уолтерс';

	SELECT cm.id INTO id_member_51
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Дженнифер Вебер';

	SELECT cm.id INTO id_member_52
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Алекс Гарза';

	SELECT cm.id INTO id_member_53
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Брэндон Хайден';

	SELECT cm.id INTO id_member_54
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Донна Гузман';

	SELECT cm.id INTO id_member_55
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Эдвард Холмс';

	SELECT cm.id INTO id_member_56
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Роберт Тайлер';

	SELECT cm.id INTO id_member_57
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Ребекка Риз';

	SELECT cm.id INTO id_member_58
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Иоланда Смит';

	SELECT cm.id INTO id_member_59
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Кэтрин Зунига';

	SELECT cm.id INTO id_member_60
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Лиза Валенсуэла';

	SELECT cm.id INTO id_member_61
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Майкл Батлер';

	SELECT cm.id INTO id_member_62
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Томас Медина';

	SELECT cm.id INTO id_member_63
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Шон Гонсалес';

	SELECT cm.id INTO id_member_64
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Робин Гудман';

	SELECT cm.id INTO id_member_65
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Чад Мэйс';

	SELECT cm.id INTO id_member_66
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Дженис Перес';

	SELECT cm.id INTO id_member_67
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Натаниэль Монтгомери';

	SELECT cm.id INTO id_member_68
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Эрин Буш';

	SELECT cm.id INTO id_member_69
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Питер Бест';

	SELECT cm.id INTO id_member_70
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Омар Вудард';

	SELECT cm.id INTO id_member_71
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Сара Сильва';

	SELECT cm.id INTO id_member_72
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Алисса Эдвардс';

	SELECT cm.id INTO id_member_73
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Эдуардо Джонсон';

	SELECT cm.id INTO id_member_74
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Андре Морс';

	SELECT cm.id INTO id_member_75
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Кристофер Барнс';

	SELECT cm.id INTO id_member_76
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Келли Баллок';

	SELECT cm.id INTO id_member_77
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Меган Кларк';

	SELECT cm.id INTO id_member_78
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Мария Келлер';

	SELECT cm.id INTO id_member_79
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Уильям Янг';

	SELECT cm.id INTO id_member_80
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Грегори Мартинес';

	SELECT cm.id INTO id_member_81
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Келли Кокс';

	SELECT cm.id INTO id_member_82
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Эмили Хаффман';

	SELECT cm.id INTO id_member_83
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Кэтрин Холт';

	SELECT cm.id INTO id_member_84
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Кэрри Генри';

	SELECT cm.id INTO id_member_85
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Джозеф Уильямсон';

	SELECT cm.id INTO id_member_86
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Томми Уильямс';

	SELECT cm.id INTO id_member_87
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Джеймс Мартин';

	SELECT cm.id INTO id_member_88
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Лэнс Брайан';

	SELECT cm.id INTO id_member_89
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Бриттани Фицджеральд';

	SELECT cm.id INTO id_member_90
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Кайла Комбс';

	SELECT cm.id INTO id_member_91
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Брэнди Уолтон';

	SELECT cm.id INTO id_member_92
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Джеймс Уайт';

	SELECT cm.id INTO id_member_93
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Стивен Салливан';

	SELECT cm.id INTO id_member_94
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Бэйли Уотсон';

	SELECT cm.id INTO id_member_95
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Брук Вудард';

	SELECT cm.id INTO id_member_96
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Закари Бартлетт';

	SELECT cm.id INTO id_member_97
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Кортни Эллиотт';

	SELECT cm.id INTO id_member_98
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Чарльз Нельсон';

	SELECT cm.id INTO id_member_99
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Стивен Джонсон';

	SELECT cm.id INTO id_member_100
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Роберт Петерсон';

	SELECT cm.id INTO id_member_101
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Кэти Бак';

	SELECT cm.id INTO id_member_102
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Мишель Кук';

	SELECT cm.id INTO id_member_103
	FROM "public.Film_crew_members" cm
	WHERE cm.name = 'Джордан Эндрюс';

	SELECT m.id INTO id_movie_0
	FROM "public.Movies" m
	WHERE m.name = 'К';

	SELECT m.id INTO id_movie_1
	FROM "public.Movies" m
	WHERE m.name = 'Вариант генерала его';

	SELECT m.id INTO id_movie_2
	FROM "public.Movies" m
	WHERE m.name = 'Бал год';

	SELECT m.id INTO id_movie_3
	FROM "public.Movies" m
	WHERE m.name = 'Кажется, имя успешное';

	SELECT m.id INTO id_movie_4
	FROM "public.Movies" m
	WHERE m.name = 'Разница';

	SELECT m.id INTO id_movie_5
	FROM "public.Movies" m
	WHERE m.name = 'Еще';

	SELECT m.id INTO id_movie_6
	FROM "public.Movies" m
	WHERE m.name = 'Навык кровати поздно';

	SELECT m.id INTO id_movie_7
	FROM "public.Movies" m
	WHERE m.name = 'Окно сто индивидуальное';

	SELECT m.id INTO id_movie_8
	FROM "public.Movies" m
	WHERE m.name = 'Другие тоже сами';

	SELECT m.id INTO id_movie_9
	FROM "public.Movies" m
	WHERE m.name = 'Энергия';

	SELECT m.id INTO id_movie_10
	FROM "public.Movies" m
	WHERE m.name = 'Религиозный демократ';

	SELECT m.id INTO id_movie_11
	FROM "public.Movies" m
	WHERE m.name = 'Вещи';

	SELECT m.id INTO id_movie_12
	FROM "public.Movies" m
	WHERE m.name = 'Определить, определить вид';

	SELECT m.id INTO id_movie_13
	FROM "public.Movies" m
	WHERE m.name = 'Надеяться';

	SELECT m.id INTO id_movie_14
	FROM "public.Movies" m
	WHERE m.name = 'Рынок другой';

	SELECT m.id INTO id_movie_15
	FROM "public.Movies" m
	WHERE m.name = 'Место, желающее место';

	SELECT m.id INTO id_movie_16
	FROM "public.Movies" m
	WHERE m.name = 'Две войны';

	SELECT m.id INTO id_movie_17
	FROM "public.Movies" m
	WHERE m.name = 'Помнить';

	SELECT m.id INTO id_movie_18
	FROM "public.Movies" m
	WHERE m.name = 'Музыка Миссис';

	SELECT m.id INTO id_movie_19
	FROM "public.Movies" m
	WHERE m.name = 'Работа';

	SELECT m.id INTO id_movie_20
	FROM "public.Movies" m
	WHERE m.name = 'Медицинский брат, да';

	SELECT m.id INTO id_movie_21
	FROM "public.Movies" m
	WHERE m.name = 'Причина кожи';

	SELECT m.id INTO id_movie_22
	FROM "public.Movies" m
	WHERE m.name = 'Все вылезает наружу';

	SELECT m.id INTO id_movie_23
	FROM "public.Movies" m
	WHERE m.name = 'Признайся во всем';

	SELECT m.id INTO id_movie_24
	FROM "public.Movies" m
	WHERE m.name = 'Вообще-то, отдохни после обеда';

	SELECT m.id INTO id_movie_25
	FROM "public.Movies" m
	WHERE m.name = 'Позже';

	SELECT m.id INTO id_movie_26
	FROM "public.Movies" m
	WHERE m.name = 'Впереди опыт брата';

	SELECT m.id INTO id_movie_27
	FROM "public.Movies" m
	WHERE m.name = 'Агент по отцу';

	SELECT m.id INTO id_movie_28
	FROM "public.Movies" m
	WHERE m.name = 'Медицинское сообщество';

	SELECT m.id INTO id_movie_29
	FROM "public.Movies" m
	WHERE m.name = 'Теперь даже';

	SELECT m.id INTO id_movie_30
	FROM "public.Movies" m
	WHERE m.name = 'Брат часть средняя';

	SELECT m.id INTO id_movie_31
	FROM "public.Movies" m
	WHERE m.name = 'Поздно счастлив';

	SELECT m.id INTO id_movie_32
	FROM "public.Movies" m
	WHERE m.name = 'Каждому достаточно, как';

	SELECT m.id INTO id_movie_33
	FROM "public.Movies" m
	WHERE m.name = 'Колледжский мяч.';

	SELECT m.id INTO id_movie_34
	FROM "public.Movies" m
	WHERE m.name = 'Одно целое раскрытие';

	SELECT m.id INTO id_movie_35
	FROM "public.Movies" m
	WHERE m.name = 'Обращаться';

	SELECT m.id INTO id_movie_36
	FROM "public.Movies" m
	WHERE m.name = 'Знакомство с природой';

	SELECT m.id INTO id_movie_37
	FROM "public.Movies" m
	WHERE m.name = 'Голосуйте за ту же часть';

	SELECT m.id INTO id_movie_38
	FROM "public.Movies" m
	WHERE m.name = 'Вскоре компьютер и';

	SELECT m.id INTO id_movie_39
	FROM "public.Movies" m
	WHERE m.name = 'Эксперт';

	SELECT m.id INTO id_movie_40
	FROM "public.Movies" m
	WHERE m.name = 'Различный';

	SELECT m.id INTO id_movie_41
	FROM "public.Movies" m
	WHERE m.name = 'Сестре конец, потому что';

	SELECT m.id INTO id_movie_42
	FROM "public.Movies" m
	WHERE m.name = 'Фонд мира';

	SELECT m.id INTO id_movie_43
	FROM "public.Movies" m
	WHERE m.name = 'Никогда';

	SELECT m.id INTO id_movie_44
	FROM "public.Movies" m
	WHERE m.name = 'Набор отчетов';

	SELECT m.id INTO id_movie_45
	FROM "public.Movies" m
	WHERE m.name = 'Определять';

	SELECT m.id INTO id_movie_46
	FROM "public.Movies" m
	WHERE m.name = 'Если страдать';

	SELECT m.id INTO id_movie_47
	FROM "public.Movies" m
	WHERE m.name = 'Кусочек';

	SELECT m.id INTO id_movie_48
	FROM "public.Movies" m
	WHERE m.name = 'Сами благодарю';

	SELECT m.id INTO id_movie_49
	FROM "public.Movies" m
	WHERE m.name = 'Коробка';

	SELECT m.id INTO id_movie_50
	FROM "public.Movies" m
	WHERE m.name = 'Готовься пиши';

	SELECT m.id INTO id_movie_51
	FROM "public.Movies" m
	WHERE m.name = 'Последний официальный точно';

	SELECT m.id INTO id_movie_52
	FROM "public.Movies" m
	WHERE m.name = 'Синие наши они';

	SELECT m.id INTO id_movie_53
	FROM "public.Movies" m
	WHERE m.name = 'Знак суммы момента';

	SELECT m.id INTO id_movie_54
	FROM "public.Movies" m
	WHERE m.name = 'Поднимись, слушай';

	SELECT m.id INTO id_movie_55
	FROM "public.Movies" m
	WHERE m.name = 'До';

	SELECT m.id INTO id_movie_56
	FROM "public.Movies" m
	WHERE m.name = 'Люди';

	SELECT m.id INTO id_movie_57
	FROM "public.Movies" m
	WHERE m.name = 'Особо светлый';

	SELECT m.id INTO id_movie_58
	FROM "public.Movies" m
	WHERE m.name = 'Введите другой';

	SELECT m.id INTO id_movie_59
	FROM "public.Movies" m
	WHERE m.name = 'Возможно, сначала';

	SELECT m.id INTO id_movie_60
	FROM "public.Movies" m
	WHERE m.name = 'Этот адвокат по заданию';

	SELECT m.id INTO id_movie_61
	FROM "public.Movies" m
	WHERE m.name = 'Все может быть';

	SELECT m.id INTO id_movie_62
	FROM "public.Movies" m
	WHERE m.name = 'Сад';

	SELECT m.id INTO id_movie_63
	FROM "public.Movies" m
	WHERE m.name = 'Все вызывают';

	SELECT m.id INTO id_movie_64
	FROM "public.Movies" m
	WHERE m.name = 'Почувствуйте, опишите производство';

	SELECT m.id INTO id_movie_65
	FROM "public.Movies" m
	WHERE m.name = 'Беспокоите нас';

	SELECT m.id INTO id_movie_66
	FROM "public.Movies" m
	WHERE m.name = 'Явный рост производства';

	SELECT m.id INTO id_movie_67
	FROM "public.Movies" m
	WHERE m.name = 'Беспокойство';

	SELECT m.id INTO id_movie_68
	FROM "public.Movies" m
	WHERE m.name = 'Церковь';

	SELECT m.id INTO id_movie_69
	FROM "public.Movies" m
	WHERE m.name = 'До внимания';

	SELECT m.id INTO id_movie_70
	FROM "public.Movies" m
	WHERE m.name = 'Отец смены станции';

	SELECT m.id INTO id_movie_71
	FROM "public.Movies" m
	WHERE m.name = 'Цена двух попыток';

	SELECT m.id INTO id_movie_72
	FROM "public.Movies" m
	WHERE m.name = 'Современные другие учат';

	SELECT m.id INTO id_movie_73
	FROM "public.Movies" m
	WHERE m.name = 'Медицинский там, потому что';

	SELECT m.id INTO id_movie_74
	FROM "public.Movies" m
	WHERE m.name = 'Вытащите студента';

	SELECT m.id INTO id_movie_75
	FROM "public.Movies" m
	WHERE m.name = 'Вести';

	SELECT m.id INTO id_movie_76
	FROM "public.Movies" m
	WHERE m.name = 'Школа разумного возраста';

	SELECT m.id INTO id_movie_77
	FROM "public.Movies" m
	WHERE m.name = 'Трудно идентифицировать';

	SELECT m.id INTO id_movie_78
	FROM "public.Movies" m
	WHERE m.name = 'Влияние на сайт';

	SELECT m.id INTO id_movie_79
	FROM "public.Movies" m
	WHERE m.name = 'Требовать';

	SELECT m.id INTO id_movie_80
	FROM "public.Movies" m
	WHERE m.name = 'Офицер вполне';

	SELECT m.id INTO id_movie_81
	FROM "public.Movies" m
	WHERE m.name = 'Тип семейства';

	SELECT m.id INTO id_movie_82
	FROM "public.Movies" m
	WHERE m.name = 'Означает поддержку когда-либо';

	SELECT m.id INTO id_movie_83
	FROM "public.Movies" m
	WHERE m.name = 'Сегодня вечером';

	SELECT m.id INTO id_movie_84
	FROM "public.Movies" m
	WHERE m.name = 'Спорить, раскрывать';

	SELECT m.id INTO id_movie_85
	FROM "public.Movies" m
	WHERE m.name = 'Купить';

	SELECT m.id INTO id_movie_86
	FROM "public.Movies" m
	WHERE m.name = 'Семья';

	SELECT m.id INTO id_movie_87
	FROM "public.Movies" m
	WHERE m.name = 'Существующее решение';

	SELECT m.id INTO id_movie_88
	FROM "public.Movies" m
	WHERE m.name = 'Угроза, которой мы служим';

	SELECT m.id INTO id_movie_89
	FROM "public.Movies" m
	WHERE m.name = 'Общество войной';

	SELECT m.id INTO id_movie_90
	FROM "public.Movies" m
	WHERE m.name = 'Добрый или';

	SELECT m.id INTO id_movie_91
	FROM "public.Movies" m
	WHERE m.name = 'Как оставаться политикой';

	SELECT m.id INTO id_movie_92
	FROM "public.Movies" m
	WHERE m.name = 'Мог распознать';

	SELECT m.id INTO id_movie_93
	FROM "public.Movies" m
	WHERE m.name = 'Чувство атаки читать';

	SELECT m.id INTO id_movie_94
	FROM "public.Movies" m
	WHERE m.name = 'Живой мальчик, звук';

	SELECT m.id INTO id_movie_95
	FROM "public.Movies" m
	WHERE m.name = 'Муж';

	SELECT m.id INTO id_movie_96
	FROM "public.Movies" m
	WHERE m.name = 'Сила страны';

	SELECT m.id INTO id_movie_97
	FROM "public.Movies" m
	WHERE m.name = 'Характер';

	SELECT m.id INTO id_movie_98
	FROM "public.Movies" m
	WHERE m.name = 'Никогда не режь';

	SELECT m.id INTO id_movie_99
	FROM "public.Movies" m
	WHERE m.name = 'Нация его поперек';

	SELECT m.id INTO id_movie_100
	FROM "public.Movies" m
	WHERE m.name = 'Петь';

	SELECT m.id INTO id_movie_101
	FROM "public.Movies" m
	WHERE m.name = 'Поинт-команда';

	SELECT m.id INTO id_movie_102
	FROM "public.Movies" m
	WHERE m.name = 'Красивый подъем';

	SELECT m.id INTO id_movie_103
	FROM "public.Movies" m
	WHERE m.name = 'Середина';

	SELECT m.id INTO id_movie_104
	FROM "public.Movies" m
	WHERE m.name = 'Класс закрыть';

	SELECT m.id INTO id_movie_105
	FROM "public.Movies" m
	WHERE m.name = 'Один раз';

	SELECT m.id INTO id_movie_106
	FROM "public.Movies" m
	WHERE m.name = 'Потерять магазин вечером';

	SELECT m.id INTO id_movie_107
	FROM "public.Movies" m
	WHERE m.name = 'Ничего не упоминай, наш';

	SELECT m.id INTO id_movie_108
	FROM "public.Movies" m
	WHERE m.name = 'Сохранить пропуск';

	SELECT m.id INTO id_movie_109
	FROM "public.Movies" m
	WHERE m.name = 'Ну представьте себе';

	SELECT m.id INTO id_movie_110
	FROM "public.Movies" m
	WHERE m.name = 'Готовый';

	SELECT m.id INTO id_movie_111
	FROM "public.Movies" m
	WHERE m.name = 'Вода';

	SELECT m.id INTO id_movie_112
	FROM "public.Movies" m
	WHERE m.name = 'Служить производительности создавать';

	SELECT m.id INTO id_movie_113
	FROM "public.Movies" m
	WHERE m.name = 'Часовое здание';

	SELECT m.id INTO id_movie_114
	FROM "public.Movies" m
	WHERE m.name = 'Встряхнуть администрацию';

	SELECT m.id INTO id_movie_115
	FROM "public.Movies" m
	WHERE m.name = 'Авторитетное присоединение';

	SELECT m.id INTO id_movie_116
	FROM "public.Movies" m
	WHERE m.name = 'Земля';

	SELECT m.id INTO id_movie_117
	FROM "public.Movies" m
	WHERE m.name = 'Дом';

	SELECT m.id INTO id_movie_118
	FROM "public.Movies" m
	WHERE m.name = 'Количество';

	SELECT m.id INTO id_movie_119
	FROM "public.Movies" m
	WHERE m.name = 'День национального генерала';

	INSERT INTO "public.Nominees" (film_crew_members_id, movie_id) VALUES
		(id_member_0, id_movie_0),
		(id_member_1, id_movie_1),
		(id_member_2, id_movie_2),
		(id_member_3, id_movie_3),
		(id_member_4, id_movie_4),
		(id_member_5, id_movie_5),
		(id_member_6, id_movie_6),
		(id_member_7, id_movie_7),
		(id_member_8, id_movie_8),
		(id_member_9, id_movie_9),
		(id_member_10, id_movie_10),
		(id_member_11, id_movie_11),
		(id_member_12, id_movie_12),
		(id_member_13, id_movie_13),
		(id_member_14, id_movie_14),
		(id_member_15, id_movie_15),
		(id_member_16, id_movie_16),
		(id_member_17, id_movie_4),
		(id_member_18, id_movie_17),
		(id_member_19, id_movie_18),
		(id_member_20, id_movie_14),
		(id_member_21, id_movie_16),
		(id_member_22, id_movie_19),
		(id_member_0, id_movie_20),
		(id_member_23, id_movie_21),
		(id_member_24, id_movie_22),
		(id_member_25, id_movie_23),
		(id_member_26, id_movie_24),
		(id_member_27, id_movie_2),
		(id_member_28, id_movie_25),
		(id_member_29, id_movie_26),
		(id_member_8, id_movie_27),
		(id_member_30, id_movie_28),
		(id_member_31, id_movie_11),
		(id_member_32, id_movie_23),
		(id_member_33, id_movie_29),
		(id_member_34, id_movie_30),
		(id_member_35, id_movie_22),
		(id_member_21, id_movie_31),
		(id_member_0, id_movie_32),
		(id_member_15, id_movie_33),
		(id_member_36, id_movie_34),
		(id_member_37, id_movie_35),
		(id_member_38, id_movie_36),
		(id_member_39, id_movie_7),
		(id_member_40, id_movie_37),
		(id_member_41, id_movie_37),
		(id_member_42, id_movie_37),
		(id_member_4, id_movie_20),
		(id_member_43, id_movie_38),
		(id_member_44, id_movie_39),
		(id_member_45, id_movie_40),
		(id_member_46, id_movie_40),
		(id_member_47, id_movie_41),
		(id_member_48, id_movie_42),
		(id_member_49, id_movie_43),
		(id_member_1, id_movie_11),
		(id_member_24, id_movie_44),
		(id_member_50, id_movie_34),
		(id_member_51, id_movie_0),
		(id_member_52, id_movie_45),
		(id_member_14, id_movie_28),
		(id_member_53, id_movie_46),
		(id_member_54, id_movie_47),
		(id_member_55, id_movie_48),
		(id_member_56, id_movie_10),
		(id_member_18, id_movie_49),
		(id_member_36, id_movie_3),
		(id_member_57, id_movie_19),
		(id_member_58, id_movie_50),
		(id_member_40, id_movie_51),
		(id_member_59, id_movie_52),
		(id_member_60, id_movie_53),
		(id_member_61, id_movie_54),
		(id_member_44, id_movie_49),
		(id_member_57, id_movie_55),
		(id_member_43, id_movie_25),
		(id_member_62, id_movie_56),
		(id_member_18, id_movie_57),
		(id_member_63, id_movie_55),
		(id_member_64, id_movie_58),
		(id_member_44, id_movie_10),
		(id_member_65, id_movie_30),
		(id_member_59, id_movie_48),
		(id_member_60, id_movie_40),
		(id_member_66, id_movie_38),
		(id_member_51, id_movie_59),
		(id_member_67, id_movie_60),
		(id_member_68, id_movie_61),
		(id_member_69, id_movie_62),
		(id_member_51, id_movie_63),
		(id_member_43, id_movie_64),
		(id_member_70, id_movie_65),
		(id_member_71, id_movie_66),
		(id_member_35, id_movie_67),
		(id_member_72, id_movie_68),
		(id_member_37, id_movie_69),
		(id_member_73, id_movie_31),
		(id_member_74, id_movie_12),
		(id_member_75, id_movie_70),
		(id_member_18, id_movie_71),
		(id_member_76, id_movie_1),
		(id_member_77, id_movie_72),
		(id_member_69, id_movie_15),
		(id_member_78, id_movie_6),
		(id_member_20, id_movie_3),
		(id_member_79, id_movie_60),
		(id_member_80, id_movie_73),
		(id_member_30, id_movie_74),
		(id_member_8, id_movie_75),
		(id_member_81, id_movie_36),
		(id_member_82, id_movie_56),
		(id_member_76, id_movie_76),
		(id_member_83, id_movie_14),
		(id_member_59, id_movie_50),
		(id_member_2, id_movie_77),
		(id_member_84, id_movie_78),
		(id_member_85, id_movie_77),
		(id_member_24, id_movie_7),
		(id_member_86, id_movie_79),
		(id_member_87, id_movie_37),
		(id_member_57, id_movie_63),
		(id_member_88, id_movie_80),
		(id_member_6, id_movie_18),
		(id_member_2, id_movie_81),
		(id_member_89, id_movie_30),
		(id_member_65, id_movie_82),
		(id_member_72, id_movie_29),
		(id_member_90, id_movie_25),
		(id_member_91, id_movie_83),
		(id_member_92, id_movie_72),
		(id_member_93, id_movie_16),
		(id_member_94, id_movie_78),
		(id_member_38, id_movie_84),
		(id_member_49, id_movie_82),
		(id_member_95, id_movie_68),
		(id_member_96, id_movie_85),
		(id_member_97, id_movie_58),
		(id_member_98, id_movie_86),
		(id_member_55, id_movie_87),
		(id_member_73, id_movie_48),
		(id_member_62, id_movie_88),
		(id_member_99, id_movie_73),
		(id_member_100, id_movie_68),
		(id_member_101, id_movie_89),
		(id_member_69, id_movie_70),
		(id_member_102, id_movie_80),
		(id_member_96, id_movie_60),
		(id_member_103, id_movie_90),
		(id_member_91, id_movie_32),
		(null, id_movie_86),
		(null, id_movie_91),
		(null, id_movie_42),
		(null, id_movie_92),
		(null, id_movie_43),
		(null, id_movie_6),
		(null, id_movie_0),
		(null, id_movie_26),
		(null, id_movie_93),
		(null, id_movie_69),
		(null, id_movie_73),
		(null, id_movie_39),
		(null, id_movie_94),
		(null, id_movie_57),
		(null, id_movie_12),
		(null, id_movie_10),
		(null, id_movie_95),
		(null, id_movie_66),
		(null, id_movie_96),
		(null, id_movie_32),
		(null, id_movie_40),
		(null, id_movie_97),
		(null, id_movie_67),
		(null, id_movie_98),
		(null, id_movie_33),
		(null, id_movie_5),
		(null, id_movie_99),
		(null, id_movie_100),
		(null, id_movie_36),
		(null, id_movie_84),
		(null, id_movie_101),
		(null, id_movie_35),
		(null, id_movie_102),
		(null, id_movie_21),
		(null, id_movie_49),
		(null, id_movie_103),
		(null, id_movie_14),
		(null, id_movie_104),
		(null, id_movie_22),
		(null, id_movie_46),
		(null, id_movie_105),
		(null, id_movie_47),
		(null, id_movie_106),
		(null, id_movie_31),
		(null, id_movie_37),
		(null, id_movie_61),
		(null, id_movie_16),
		(null, id_movie_55),
		(null, id_movie_48),
		(null, id_movie_53),
		(null, id_movie_2),
		(null, id_movie_107),
		(null, id_movie_108),
		(null, id_movie_109),
		(null, id_movie_110),
		(null, id_movie_4),
		(null, id_movie_7),
		(null, id_movie_50),
		(null, id_movie_80),
		(null, id_movie_29),
		(null, id_movie_62),
		(null, id_movie_17),
		(null, id_movie_34),
		(null, id_movie_64),
		(null, id_movie_85),
		(null, id_movie_51),
		(null, id_movie_111),
		(null, id_movie_44),
		(null, id_movie_112),
		(null, id_movie_72),
		(null, id_movie_63),
		(null, id_movie_87),
		(null, id_movie_113),
		(null, id_movie_54),
		(null, id_movie_114),
		(null, id_movie_115),
		(null, id_movie_13),
		(null, id_movie_28),
		(null, id_movie_116),
		(null, id_movie_23),
		(null, id_movie_30),
		(null, id_movie_117),
		(null, id_movie_56),
		(null, id_movie_88),
		(null, id_movie_118),
		(null, id_movie_19),
		(null, id_movie_59),
		(null, id_movie_68),
		(null, id_movie_119);
END $$;



DO $$
DECLARE id_nominee_0 INT;
DECLARE id_nominee_1 INT;
DECLARE id_nominee_2 INT;
DECLARE id_nominee_3 INT;
DECLARE id_nominee_4 INT;
DECLARE id_nominee_5 INT;
DECLARE id_nominee_6 INT;
DECLARE id_nominee_7 INT;
DECLARE id_nominee_8 INT;
DECLARE id_nominee_9 INT;
DECLARE id_nominee_10 INT;
DECLARE id_nominee_11 INT;
DECLARE id_nominee_12 INT;
DECLARE id_nominee_13 INT;
DECLARE id_nominee_14 INT;
DECLARE id_nominee_15 INT;
DECLARE id_nominee_16 INT;
DECLARE id_nominee_17 INT;
DECLARE id_nominee_18 INT;
DECLARE id_nominee_19 INT;
DECLARE id_nominee_20 INT;
DECLARE id_nominee_21 INT;
DECLARE id_nominee_22 INT;
DECLARE id_nominee_23 INT;
DECLARE id_nominee_24 INT;
DECLARE id_nominee_25 INT;
DECLARE id_nominee_26 INT;
DECLARE id_nominee_27 INT;
DECLARE id_nominee_28 INT;
DECLARE id_nominee_29 INT;
DECLARE id_nominee_30 INT;
DECLARE id_nominee_31 INT;
DECLARE id_nominee_32 INT;
DECLARE id_nominee_33 INT;
DECLARE id_nominee_34 INT;
DECLARE id_nominee_35 INT;
DECLARE id_nominee_36 INT;
DECLARE id_nominee_37 INT;
DECLARE id_nominee_38 INT;
DECLARE id_nominee_39 INT;
DECLARE id_nominee_40 INT;
DECLARE id_nominee_41 INT;
DECLARE id_nominee_42 INT;
DECLARE id_nominee_43 INT;
DECLARE id_nominee_44 INT;
DECLARE id_nominee_45 INT;
DECLARE id_nominee_46 INT;
DECLARE id_nominee_47 INT;
DECLARE id_nominee_48 INT;
DECLARE id_nominee_49 INT;
DECLARE id_nominee_50 INT;
DECLARE id_nominee_51 INT;
DECLARE id_nominee_52 INT;
DECLARE id_nominee_53 INT;
DECLARE id_nominee_54 INT;
DECLARE id_nominee_55 INT;
DECLARE id_nominee_56 INT;
DECLARE id_nominee_57 INT;
DECLARE id_nominee_58 INT;
DECLARE id_nominee_59 INT;
DECLARE id_nominee_60 INT;
DECLARE id_nominee_61 INT;
DECLARE id_nominee_62 INT;
DECLARE id_nominee_63 INT;
DECLARE id_nominee_64 INT;
DECLARE id_nominee_65 INT;
DECLARE id_nominee_66 INT;
DECLARE id_nominee_67 INT;
DECLARE id_nominee_68 INT;
DECLARE id_nominee_69 INT;
DECLARE id_nominee_70 INT;
DECLARE id_nominee_71 INT;
DECLARE id_nominee_72 INT;
DECLARE id_nominee_73 INT;
DECLARE id_nominee_74 INT;
DECLARE id_nominee_75 INT;
DECLARE id_nominee_76 INT;
DECLARE id_nominee_77 INT;
DECLARE id_nominee_78 INT;
DECLARE id_nominee_79 INT;
DECLARE id_nominee_80 INT;
DECLARE id_nominee_81 INT;
DECLARE id_nominee_82 INT;
DECLARE id_nominee_83 INT;
DECLARE id_nominee_84 INT;
DECLARE id_nominee_85 INT;
DECLARE id_nominee_86 INT;
DECLARE id_nominee_87 INT;
DECLARE id_nominee_88 INT;
DECLARE id_nominee_89 INT;
DECLARE id_nominee_90 INT;
DECLARE id_nominee_91 INT;
DECLARE id_nominee_92 INT;
DECLARE id_nominee_93 INT;
DECLARE id_nominee_94 INT;
DECLARE id_nominee_95 INT;
DECLARE id_nominee_96 INT;
DECLARE id_nominee_97 INT;
DECLARE id_nominee_98 INT;
DECLARE id_nominee_99 INT;
DECLARE id_nominee_100 INT;
DECLARE id_nominee_101 INT;
DECLARE id_nominee_102 INT;
DECLARE id_nominee_103 INT;
DECLARE id_nominee_104 INT;
DECLARE id_nominee_105 INT;
DECLARE id_nominee_106 INT;
DECLARE id_nominee_107 INT;
DECLARE id_nominee_108 INT;
DECLARE id_nominee_109 INT;
DECLARE id_nominee_110 INT;
DECLARE id_nominee_111 INT;
DECLARE id_nominee_112 INT;
DECLARE id_nominee_113 INT;
DECLARE id_nominee_114 INT;
DECLARE id_nominee_115 INT;
DECLARE id_nominee_116 INT;
DECLARE id_nominee_117 INT;
DECLARE id_nominee_118 INT;
DECLARE id_nominee_119 INT;
DECLARE id_nominee_120 INT;
DECLARE id_nominee_121 INT;
DECLARE id_nominee_122 INT;
DECLARE id_nominee_123 INT;
DECLARE id_nominee_124 INT;
DECLARE id_nominee_125 INT;
DECLARE id_nominee_126 INT;
DECLARE id_nominee_127 INT;
DECLARE id_nominee_128 INT;
DECLARE id_nominee_129 INT;
DECLARE id_nominee_130 INT;
DECLARE id_nominee_131 INT;
DECLARE id_nominee_132 INT;
DECLARE id_nominee_133 INT;
DECLARE id_nominee_134 INT;
DECLARE id_nominee_135 INT;
DECLARE id_nominee_136 INT;
DECLARE id_nominee_137 INT;
DECLARE id_nominee_138 INT;
DECLARE id_nominee_139 INT;
DECLARE id_nominee_140 INT;
DECLARE id_nominee_141 INT;
DECLARE id_nominee_142 INT;
DECLARE id_nominee_143 INT;
DECLARE id_nominee_144 INT;
DECLARE id_nominee_145 INT;
DECLARE id_nominee_146 INT;
DECLARE id_nominee_147 INT;
DECLARE id_nominee_148 INT;
DECLARE id_nominee_149 INT;
DECLARE id_nominee_150 INT;
DECLARE id_nominee_151 INT;
DECLARE id_nominee_152 INT;
DECLARE id_nominee_153 INT;
DECLARE id_nominee_154 INT;
DECLARE id_nominee_155 INT;
DECLARE id_nominee_156 INT;
DECLARE id_nominee_157 INT;
DECLARE id_nominee_158 INT;
DECLARE id_nominee_159 INT;
DECLARE id_nominee_160 INT;
DECLARE id_nominee_161 INT;
DECLARE id_nominee_162 INT;
DECLARE id_nominee_163 INT;
DECLARE id_nominee_164 INT;
DECLARE id_nominee_165 INT;
DECLARE id_nominee_166 INT;
DECLARE id_nominee_167 INT;
DECLARE id_nominee_168 INT;
DECLARE id_nominee_169 INT;
DECLARE id_nominee_170 INT;
DECLARE id_nominee_171 INT;
DECLARE id_nominee_172 INT;
DECLARE id_nominee_173 INT;
DECLARE id_nominee_174 INT;
DECLARE id_nominee_175 INT;
DECLARE id_nominee_176 INT;
DECLARE id_nominee_177 INT;
DECLARE id_nominee_178 INT;
DECLARE id_nominee_179 INT;
DECLARE id_nominee_180 INT;
DECLARE id_nominee_181 INT;
DECLARE id_nominee_182 INT;
DECLARE id_nominee_183 INT;
DECLARE id_nominee_184 INT;
DECLARE id_nominee_185 INT;
DECLARE id_nominee_186 INT;
DECLARE id_nominee_187 INT;
DECLARE id_nominee_188 INT;
DECLARE id_nominee_189 INT;
DECLARE id_nominee_190 INT;
DECLARE id_nominee_191 INT;
DECLARE id_nominee_192 INT;
DECLARE id_nominee_193 INT;
DECLARE id_nominee_194 INT;
DECLARE id_nominee_195 INT;
DECLARE id_nominee_196 INT;
DECLARE id_nominee_197 INT;
DECLARE id_nominee_198 INT;
DECLARE id_nominee_199 INT;
DECLARE id_nominee_200 INT;
DECLARE id_nominee_201 INT;
DECLARE id_nominee_202 INT;
DECLARE id_nominee_203 INT;
DECLARE id_nominee_204 INT;
DECLARE id_nominee_205 INT;
DECLARE id_nominee_206 INT;
DECLARE id_nominee_207 INT;
DECLARE id_nominee_208 INT;
DECLARE id_nominee_209 INT;
DECLARE id_nominee_210 INT;
DECLARE id_nominee_211 INT;
DECLARE id_nominee_212 INT;
DECLARE id_nominee_213 INT;
DECLARE id_nominee_214 INT;
DECLARE id_nominee_215 INT;
DECLARE id_nominee_216 INT;
DECLARE id_nominee_217 INT;
DECLARE id_nominee_218 INT;
DECLARE id_nominee_219 INT;
DECLARE id_nominee_220 INT;
DECLARE id_nominee_221 INT;
DECLARE id_nominee_222 INT;
DECLARE id_nominee_223 INT;
DECLARE id_nominee_224 INT;
DECLARE id_nominee_225 INT;
DECLARE id_nominee_226 INT;
DECLARE id_nominee_227 INT;
DECLARE id_nominee_228 INT;
DECLARE id_nominee_229 INT;
DECLARE id_nominee_230 INT;
DECLARE id_nominee_231 INT;
DECLARE id_nominee_232 INT;
DECLARE id_nominee_233 INT;
DECLARE id_nominee_234 INT;
DECLARE id_nominee_235 INT;
DECLARE id_nominee_236 INT;
DECLARE id_nominee_237 INT;
DECLARE id_nominee_238 INT;
DECLARE id_prime_0 INT;
DECLARE id_prime_1 INT;
DECLARE id_prime_2 INT;
DECLARE id_prime_3 INT;
DECLARE id_prime_4 INT;
DECLARE id_prime_5 INT;
DECLARE id_prime_6 INT;
DECLARE id_prime_7 INT;
DECLARE id_prime_8 INT;
DECLARE id_prime_9 INT;
DECLARE id_prime_10 INT;
DECLARE id_prime_11 INT;

BEGIN
	SELECT nom.id INTO id_nominee_0
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	JOIN "public.Film_crew_members" cm ON nom.film_crew_members_id = cm.id
	WHERE m.name = 'К' AND cm.name = 'Эрик Янг';

	SELECT nom.id INTO id_nominee_1
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	JOIN "public.Film_crew_members" cm ON nom.film_crew_members_id = cm.id
	WHERE m.name = 'Вариант генерала его' AND cm.name = 'Джанет Шепард';

	SELECT nom.id INTO id_nominee_2
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	JOIN "public.Film_crew_members" cm ON nom.film_crew_members_id = cm.id
	WHERE m.name = 'Бал год' AND cm.name = 'Дэвид Диас';

	SELECT nom.id INTO id_nominee_3
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	JOIN "public.Film_crew_members" cm ON nom.film_crew_members_id = cm.id
	WHERE m.name = 'Кажется, имя успешное' AND cm.name = 'Марк Джонсон';

	SELECT nom.id INTO id_nominee_4
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	JOIN "public.Film_crew_members" cm ON nom.film_crew_members_id = cm.id
	WHERE m.name = 'Разница' AND cm.name = 'Алан Грин';

	SELECT nom.id INTO id_nominee_5
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	JOIN "public.Film_crew_members" cm ON nom.film_crew_members_id = cm.id
	WHERE m.name = 'Еще' AND cm.name = 'Дерек Бонд';

	SELECT nom.id INTO id_nominee_6
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	JOIN "public.Film_crew_members" cm ON nom.film_crew_members_id = cm.id
	WHERE m.name = 'Навык кровати поздно' AND cm.name = 'Бенджамин Чен';

	SELECT nom.id INTO id_nominee_7
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	JOIN "public.Film_crew_members" cm ON nom.film_crew_members_id = cm.id
	WHERE m.name = 'Окно сто индивидуальное' AND cm.name = 'Линда Филлипс';

	SELECT nom.id INTO id_nominee_8
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	JOIN "public.Film_crew_members" cm ON nom.film_crew_members_id = cm.id
	WHERE m.name = 'Другие тоже сами' AND cm.name = 'Рита Макдональд';

	SELECT nom.id INTO id_nominee_9
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	JOIN "public.Film_crew_members" cm ON nom.film_crew_members_id = cm.id
	WHERE m.name = 'Энергия' AND cm.name = 'Меган Финли';

	SELECT nom.id INTO id_nominee_10
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	JOIN "public.Film_crew_members" cm ON nom.film_crew_members_id = cm.id
	WHERE m.name = 'Религиозный демократ' AND cm.name = 'Фрэнсис Хаус';

	SELECT nom.id INTO id_nominee_11
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	JOIN "public.Film_crew_members" cm ON nom.film_crew_members_id = cm.id
	WHERE m.name = 'Вещи' AND cm.name = 'Джессика Эдвардс';

	SELECT nom.id INTO id_nominee_12
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	JOIN "public.Film_crew_members" cm ON nom.film_crew_members_id = cm.id
	WHERE m.name = 'Определить, определить вид' AND cm.name = 'Эмили Галлахер';

	SELECT nom.id INTO id_nominee_13
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	JOIN "public.Film_crew_members" cm ON nom.film_crew_members_id = cm.id
	WHERE m.name = 'Надеяться' AND cm.name = 'Джейкоб Принс';

	SELECT nom.id INTO id_nominee_14
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	JOIN "public.Film_crew_members" cm ON nom.film_crew_members_id = cm.id
	WHERE m.name = 'Рынок другой' AND cm.name = 'Джилл Томас';

	SELECT nom.id INTO id_nominee_15
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	JOIN "public.Film_crew_members" cm ON nom.film_crew_members_id = cm.id
	WHERE m.name = 'Место, желающее место' AND cm.name = 'Келли Гордон';

	SELECT nom.id INTO id_nominee_16
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	JOIN "public.Film_crew_members" cm ON nom.film_crew_members_id = cm.id
	WHERE m.name = 'Две войны' AND cm.name = 'Мелисса Вуд';

	SELECT nom.id INTO id_nominee_17
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	JOIN "public.Film_crew_members" cm ON nom.film_crew_members_id = cm.id
	WHERE m.name = 'Разница' AND cm.name = 'Кори Джордан';

	SELECT nom.id INTO id_nominee_18
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	JOIN "public.Film_crew_members" cm ON nom.film_crew_members_id = cm.id
	WHERE m.name = 'Помнить' AND cm.name = 'Кэролин Моралес';

	SELECT nom.id INTO id_nominee_19
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	JOIN "public.Film_crew_members" cm ON nom.film_crew_members_id = cm.id
	WHERE m.name = 'Музыка Миссис' AND cm.name = 'Джеймс Хейли';

	SELECT nom.id INTO id_nominee_20
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	JOIN "public.Film_crew_members" cm ON nom.film_crew_members_id = cm.id
	WHERE m.name = 'Рынок другой' AND cm.name = 'Кэти Хикман';

	SELECT nom.id INTO id_nominee_21
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	JOIN "public.Film_crew_members" cm ON nom.film_crew_members_id = cm.id
	WHERE m.name = 'Две войны' AND cm.name = 'Кэссиди Блейк';

	SELECT nom.id INTO id_nominee_22
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	JOIN "public.Film_crew_members" cm ON nom.film_crew_members_id = cm.id
	WHERE m.name = 'Работа' AND cm.name = 'Паула Стронг';

	SELECT nom.id INTO id_nominee_23
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	JOIN "public.Film_crew_members" cm ON nom.film_crew_members_id = cm.id
	WHERE m.name = 'Медицинский брат, да' AND cm.name = 'Эрик Янг';

	SELECT nom.id INTO id_nominee_24
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	JOIN "public.Film_crew_members" cm ON nom.film_crew_members_id = cm.id
	WHERE m.name = 'Причина кожи' AND cm.name = 'Тоня Родригес';

	SELECT nom.id INTO id_nominee_25
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	JOIN "public.Film_crew_members" cm ON nom.film_crew_members_id = cm.id
	WHERE m.name = 'Все вылезает наружу' AND cm.name = 'Уитни Эрнандес';

	SELECT nom.id INTO id_nominee_26
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	JOIN "public.Film_crew_members" cm ON nom.film_crew_members_id = cm.id
	WHERE m.name = 'Признайся во всем' AND cm.name = 'Эмбер Ривера';

	SELECT nom.id INTO id_nominee_27
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	JOIN "public.Film_crew_members" cm ON nom.film_crew_members_id = cm.id
	WHERE m.name = 'Вообще-то, отдохни после обеда' AND cm.name = 'Реджина Фелпс';

	SELECT nom.id INTO id_nominee_28
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	JOIN "public.Film_crew_members" cm ON nom.film_crew_members_id = cm.id
	WHERE m.name = 'Бал год' AND cm.name = 'Джесси Соса';

	SELECT nom.id INTO id_nominee_29
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	JOIN "public.Film_crew_members" cm ON nom.film_crew_members_id = cm.id
	WHERE m.name = 'Позже' AND cm.name = 'Мари Меркадо';

	SELECT nom.id INTO id_nominee_30
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	JOIN "public.Film_crew_members" cm ON nom.film_crew_members_id = cm.id
	WHERE m.name = 'Впереди опыт брата' AND cm.name = 'Марк Пинеда';

	SELECT nom.id INTO id_nominee_31
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	JOIN "public.Film_crew_members" cm ON nom.film_crew_members_id = cm.id
	WHERE m.name = 'Агент по отцу' AND cm.name = 'Рита Макдональд';

	SELECT nom.id INTO id_nominee_32
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	JOIN "public.Film_crew_members" cm ON nom.film_crew_members_id = cm.id
	WHERE m.name = 'Медицинское сообщество' AND cm.name = 'Джейсон Грей';

	SELECT nom.id INTO id_nominee_33
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	JOIN "public.Film_crew_members" cm ON nom.film_crew_members_id = cm.id
	WHERE m.name = 'Вещи' AND cm.name = 'Андре Джексон';

	SELECT nom.id INTO id_nominee_34
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	JOIN "public.Film_crew_members" cm ON nom.film_crew_members_id = cm.id
	WHERE m.name = 'Признайся во всем' AND cm.name = 'Кейтлин Коллиер';

	SELECT nom.id INTO id_nominee_35
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	JOIN "public.Film_crew_members" cm ON nom.film_crew_members_id = cm.id
	WHERE m.name = 'Теперь даже' AND cm.name = 'Дэвид Адамс';

	SELECT nom.id INTO id_nominee_36
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	JOIN "public.Film_crew_members" cm ON nom.film_crew_members_id = cm.id
	WHERE m.name = 'Брат часть средняя' AND cm.name = 'Трэвис Харрис';

	SELECT nom.id INTO id_nominee_37
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	JOIN "public.Film_crew_members" cm ON nom.film_crew_members_id = cm.id
	WHERE m.name = 'Все вылезает наружу' AND cm.name = 'Линда Макинтайр';

	SELECT nom.id INTO id_nominee_38
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	JOIN "public.Film_crew_members" cm ON nom.film_crew_members_id = cm.id
	WHERE m.name = 'Поздно счастлив' AND cm.name = 'Кэссиди Блейк';

	SELECT nom.id INTO id_nominee_39
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	JOIN "public.Film_crew_members" cm ON nom.film_crew_members_id = cm.id
	WHERE m.name = 'Каждому достаточно, как' AND cm.name = 'Эрик Янг';

	SELECT nom.id INTO id_nominee_40
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	JOIN "public.Film_crew_members" cm ON nom.film_crew_members_id = cm.id
	WHERE m.name = 'Колледжский мяч.' AND cm.name = 'Келли Гордон';

	SELECT nom.id INTO id_nominee_41
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	JOIN "public.Film_crew_members" cm ON nom.film_crew_members_id = cm.id
	WHERE m.name = 'Одно целое раскрытие' AND cm.name = 'Скотт Стэнли';

	SELECT nom.id INTO id_nominee_42
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	JOIN "public.Film_crew_members" cm ON nom.film_crew_members_id = cm.id
	WHERE m.name = 'Обращаться' AND cm.name = 'Родни Бреннан';

	SELECT nom.id INTO id_nominee_43
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	JOIN "public.Film_crew_members" cm ON nom.film_crew_members_id = cm.id
	WHERE m.name = 'Знакомство с природой' AND cm.name = 'Дуглас Миллер';

	SELECT nom.id INTO id_nominee_44
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	JOIN "public.Film_crew_members" cm ON nom.film_crew_members_id = cm.id
	WHERE m.name = 'Окно сто индивидуальное' AND cm.name = 'Кайла Янг';

	SELECT nom.id INTO id_nominee_45
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	JOIN "public.Film_crew_members" cm ON nom.film_crew_members_id = cm.id
	WHERE m.name = 'Голосуйте за ту же часть' AND cm.name = 'Маркус Росалес';

	SELECT nom.id INTO id_nominee_46
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	JOIN "public.Film_crew_members" cm ON nom.film_crew_members_id = cm.id
	WHERE m.name = 'Голосуйте за ту же часть' AND cm.name = 'Кристофер Тейлор';

	SELECT nom.id INTO id_nominee_47
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	JOIN "public.Film_crew_members" cm ON nom.film_crew_members_id = cm.id
	WHERE m.name = 'Голосуйте за ту же часть' AND cm.name = 'Джессика Дэвис';

	SELECT nom.id INTO id_nominee_48
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	JOIN "public.Film_crew_members" cm ON nom.film_crew_members_id = cm.id
	WHERE m.name = 'Медицинский брат, да' AND cm.name = 'Алан Грин';

	SELECT nom.id INTO id_nominee_49
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	JOIN "public.Film_crew_members" cm ON nom.film_crew_members_id = cm.id
	WHERE m.name = 'Вскоре компьютер и' AND cm.name = 'Гленн Паркс';

	SELECT nom.id INTO id_nominee_50
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	JOIN "public.Film_crew_members" cm ON nom.film_crew_members_id = cm.id
	WHERE m.name = 'Эксперт' AND cm.name = 'Дэвид Уилсон';

	SELECT nom.id INTO id_nominee_51
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	JOIN "public.Film_crew_members" cm ON nom.film_crew_members_id = cm.id
	WHERE m.name = 'Различный' AND cm.name = 'Маргарет Майлз';

	SELECT nom.id INTO id_nominee_52
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	JOIN "public.Film_crew_members" cm ON nom.film_crew_members_id = cm.id
	WHERE m.name = 'Различный' AND cm.name = 'Бриттни Филлипс';

	SELECT nom.id INTO id_nominee_53
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	JOIN "public.Film_crew_members" cm ON nom.film_crew_members_id = cm.id
	WHERE m.name = 'Сестре конец, потому что' AND cm.name = 'Кари Грин';

	SELECT nom.id INTO id_nominee_54
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	JOIN "public.Film_crew_members" cm ON nom.film_crew_members_id = cm.id
	WHERE m.name = 'Фонд мира' AND cm.name = 'Мелисса Роу';

	SELECT nom.id INTO id_nominee_55
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	JOIN "public.Film_crew_members" cm ON nom.film_crew_members_id = cm.id
	WHERE m.name = 'Никогда' AND cm.name = 'Кэти Леон';

	SELECT nom.id INTO id_nominee_56
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	JOIN "public.Film_crew_members" cm ON nom.film_crew_members_id = cm.id
	WHERE m.name = 'Вещи' AND cm.name = 'Джанет Шепард';

	SELECT nom.id INTO id_nominee_57
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	JOIN "public.Film_crew_members" cm ON nom.film_crew_members_id = cm.id
	WHERE m.name = 'Набор отчетов' AND cm.name = 'Уитни Эрнандес';

	SELECT nom.id INTO id_nominee_58
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	JOIN "public.Film_crew_members" cm ON nom.film_crew_members_id = cm.id
	WHERE m.name = 'Одно целое раскрытие' AND cm.name = 'Чейз Уолтерс';

	SELECT nom.id INTO id_nominee_59
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	JOIN "public.Film_crew_members" cm ON nom.film_crew_members_id = cm.id
	WHERE m.name = 'К' AND cm.name = 'Дженнифер Вебер';

	SELECT nom.id INTO id_nominee_60
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	JOIN "public.Film_crew_members" cm ON nom.film_crew_members_id = cm.id
	WHERE m.name = 'Определять' AND cm.name = 'Алекс Гарза';

	SELECT nom.id INTO id_nominee_61
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	JOIN "public.Film_crew_members" cm ON nom.film_crew_members_id = cm.id
	WHERE m.name = 'Медицинское сообщество' AND cm.name = 'Джилл Томас';

	SELECT nom.id INTO id_nominee_62
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	JOIN "public.Film_crew_members" cm ON nom.film_crew_members_id = cm.id
	WHERE m.name = 'Если страдать' AND cm.name = 'Брэндон Хайден';

	SELECT nom.id INTO id_nominee_63
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	JOIN "public.Film_crew_members" cm ON nom.film_crew_members_id = cm.id
	WHERE m.name = 'Кусочек' AND cm.name = 'Донна Гузман';

	SELECT nom.id INTO id_nominee_64
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	JOIN "public.Film_crew_members" cm ON nom.film_crew_members_id = cm.id
	WHERE m.name = 'Сами благодарю' AND cm.name = 'Эдвард Холмс';

	SELECT nom.id INTO id_nominee_65
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	JOIN "public.Film_crew_members" cm ON nom.film_crew_members_id = cm.id
	WHERE m.name = 'Религиозный демократ' AND cm.name = 'Роберт Тайлер';

	SELECT nom.id INTO id_nominee_66
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	JOIN "public.Film_crew_members" cm ON nom.film_crew_members_id = cm.id
	WHERE m.name = 'Коробка' AND cm.name = 'Кэролин Моралес';

	SELECT nom.id INTO id_nominee_67
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	JOIN "public.Film_crew_members" cm ON nom.film_crew_members_id = cm.id
	WHERE m.name = 'Кажется, имя успешное' AND cm.name = 'Скотт Стэнли';

	SELECT nom.id INTO id_nominee_68
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	JOIN "public.Film_crew_members" cm ON nom.film_crew_members_id = cm.id
	WHERE m.name = 'Работа' AND cm.name = 'Ребекка Риз';

	SELECT nom.id INTO id_nominee_69
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	JOIN "public.Film_crew_members" cm ON nom.film_crew_members_id = cm.id
	WHERE m.name = 'Готовься пиши' AND cm.name = 'Иоланда Смит';

	SELECT nom.id INTO id_nominee_70
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	JOIN "public.Film_crew_members" cm ON nom.film_crew_members_id = cm.id
	WHERE m.name = 'Последний официальный точно' AND cm.name = 'Маркус Росалес';

	SELECT nom.id INTO id_nominee_71
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	JOIN "public.Film_crew_members" cm ON nom.film_crew_members_id = cm.id
	WHERE m.name = 'Синие наши они' AND cm.name = 'Кэтрин Зунига';

	SELECT nom.id INTO id_nominee_72
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	JOIN "public.Film_crew_members" cm ON nom.film_crew_members_id = cm.id
	WHERE m.name = 'Знак суммы момента' AND cm.name = 'Лиза Валенсуэла';

	SELECT nom.id INTO id_nominee_73
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	JOIN "public.Film_crew_members" cm ON nom.film_crew_members_id = cm.id
	WHERE m.name = 'Поднимись, слушай' AND cm.name = 'Майкл Батлер';

	SELECT nom.id INTO id_nominee_74
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	JOIN "public.Film_crew_members" cm ON nom.film_crew_members_id = cm.id
	WHERE m.name = 'Коробка' AND cm.name = 'Дэвид Уилсон';

	SELECT nom.id INTO id_nominee_75
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	JOIN "public.Film_crew_members" cm ON nom.film_crew_members_id = cm.id
	WHERE m.name = 'До' AND cm.name = 'Ребекка Риз';

	SELECT nom.id INTO id_nominee_76
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	JOIN "public.Film_crew_members" cm ON nom.film_crew_members_id = cm.id
	WHERE m.name = 'Позже' AND cm.name = 'Гленн Паркс';

	SELECT nom.id INTO id_nominee_77
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	JOIN "public.Film_crew_members" cm ON nom.film_crew_members_id = cm.id
	WHERE m.name = 'Люди' AND cm.name = 'Томас Медина';

	SELECT nom.id INTO id_nominee_78
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	JOIN "public.Film_crew_members" cm ON nom.film_crew_members_id = cm.id
	WHERE m.name = 'Особо светлый' AND cm.name = 'Кэролин Моралес';

	SELECT nom.id INTO id_nominee_79
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	JOIN "public.Film_crew_members" cm ON nom.film_crew_members_id = cm.id
	WHERE m.name = 'До' AND cm.name = 'Шон Гонсалес';

	SELECT nom.id INTO id_nominee_80
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	JOIN "public.Film_crew_members" cm ON nom.film_crew_members_id = cm.id
	WHERE m.name = 'Введите другой' AND cm.name = 'Робин Гудман';

	SELECT nom.id INTO id_nominee_81
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	JOIN "public.Film_crew_members" cm ON nom.film_crew_members_id = cm.id
	WHERE m.name = 'Религиозный демократ' AND cm.name = 'Дэвид Уилсон';

	SELECT nom.id INTO id_nominee_82
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	JOIN "public.Film_crew_members" cm ON nom.film_crew_members_id = cm.id
	WHERE m.name = 'Брат часть средняя' AND cm.name = 'Чад Мэйс';

	SELECT nom.id INTO id_nominee_83
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	JOIN "public.Film_crew_members" cm ON nom.film_crew_members_id = cm.id
	WHERE m.name = 'Сами благодарю' AND cm.name = 'Кэтрин Зунига';

	SELECT nom.id INTO id_nominee_84
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	JOIN "public.Film_crew_members" cm ON nom.film_crew_members_id = cm.id
	WHERE m.name = 'Различный' AND cm.name = 'Лиза Валенсуэла';

	SELECT nom.id INTO id_nominee_85
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	JOIN "public.Film_crew_members" cm ON nom.film_crew_members_id = cm.id
	WHERE m.name = 'Вскоре компьютер и' AND cm.name = 'Дженис Перес';

	SELECT nom.id INTO id_nominee_86
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	JOIN "public.Film_crew_members" cm ON nom.film_crew_members_id = cm.id
	WHERE m.name = 'Возможно, сначала' AND cm.name = 'Дженнифер Вебер';

	SELECT nom.id INTO id_nominee_87
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	JOIN "public.Film_crew_members" cm ON nom.film_crew_members_id = cm.id
	WHERE m.name = 'Этот адвокат по заданию' AND cm.name = 'Натаниэль Монтгомери';

	SELECT nom.id INTO id_nominee_88
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	JOIN "public.Film_crew_members" cm ON nom.film_crew_members_id = cm.id
	WHERE m.name = 'Все может быть' AND cm.name = 'Эрин Буш';

	SELECT nom.id INTO id_nominee_89
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	JOIN "public.Film_crew_members" cm ON nom.film_crew_members_id = cm.id
	WHERE m.name = 'Сад' AND cm.name = 'Питер Бест';

	SELECT nom.id INTO id_nominee_90
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	JOIN "public.Film_crew_members" cm ON nom.film_crew_members_id = cm.id
	WHERE m.name = 'Все вызывают' AND cm.name = 'Дженнифер Вебер';

	SELECT nom.id INTO id_nominee_91
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	JOIN "public.Film_crew_members" cm ON nom.film_crew_members_id = cm.id
	WHERE m.name = 'Почувствуйте, опишите производство' AND cm.name = 'Гленн Паркс';

	SELECT nom.id INTO id_nominee_92
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	JOIN "public.Film_crew_members" cm ON nom.film_crew_members_id = cm.id
	WHERE m.name = 'Беспокоите нас' AND cm.name = 'Омар Вудард';

	SELECT nom.id INTO id_nominee_93
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	JOIN "public.Film_crew_members" cm ON nom.film_crew_members_id = cm.id
	WHERE m.name = 'Явный рост производства' AND cm.name = 'Сара Сильва';

	SELECT nom.id INTO id_nominee_94
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	JOIN "public.Film_crew_members" cm ON nom.film_crew_members_id = cm.id
	WHERE m.name = 'Беспокойство' AND cm.name = 'Линда Макинтайр';

	SELECT nom.id INTO id_nominee_95
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	JOIN "public.Film_crew_members" cm ON nom.film_crew_members_id = cm.id
	WHERE m.name = 'Церковь' AND cm.name = 'Алисса Эдвардс';

	SELECT nom.id INTO id_nominee_96
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	JOIN "public.Film_crew_members" cm ON nom.film_crew_members_id = cm.id
	WHERE m.name = 'До внимания' AND cm.name = 'Родни Бреннан';

	SELECT nom.id INTO id_nominee_97
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	JOIN "public.Film_crew_members" cm ON nom.film_crew_members_id = cm.id
	WHERE m.name = 'Поздно счастлив' AND cm.name = 'Эдуардо Джонсон';

	SELECT nom.id INTO id_nominee_98
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	JOIN "public.Film_crew_members" cm ON nom.film_crew_members_id = cm.id
	WHERE m.name = 'Определить, определить вид' AND cm.name = 'Андре Морс';

	SELECT nom.id INTO id_nominee_99
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	JOIN "public.Film_crew_members" cm ON nom.film_crew_members_id = cm.id
	WHERE m.name = 'Отец смены станции' AND cm.name = 'Кристофер Барнс';

	SELECT nom.id INTO id_nominee_100
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	JOIN "public.Film_crew_members" cm ON nom.film_crew_members_id = cm.id
	WHERE m.name = 'Цена двух попыток' AND cm.name = 'Кэролин Моралес';

	SELECT nom.id INTO id_nominee_101
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	JOIN "public.Film_crew_members" cm ON nom.film_crew_members_id = cm.id
	WHERE m.name = 'Вариант генерала его' AND cm.name = 'Келли Баллок';

	SELECT nom.id INTO id_nominee_102
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	JOIN "public.Film_crew_members" cm ON nom.film_crew_members_id = cm.id
	WHERE m.name = 'Современные другие учат' AND cm.name = 'Меган Кларк';

	SELECT nom.id INTO id_nominee_103
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	JOIN "public.Film_crew_members" cm ON nom.film_crew_members_id = cm.id
	WHERE m.name = 'Место, желающее место' AND cm.name = 'Питер Бест';

	SELECT nom.id INTO id_nominee_104
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	JOIN "public.Film_crew_members" cm ON nom.film_crew_members_id = cm.id
	WHERE m.name = 'Навык кровати поздно' AND cm.name = 'Мария Келлер';

	SELECT nom.id INTO id_nominee_105
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	JOIN "public.Film_crew_members" cm ON nom.film_crew_members_id = cm.id
	WHERE m.name = 'Кажется, имя успешное' AND cm.name = 'Кэти Хикман';

	SELECT nom.id INTO id_nominee_106
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	JOIN "public.Film_crew_members" cm ON nom.film_crew_members_id = cm.id
	WHERE m.name = 'Этот адвокат по заданию' AND cm.name = 'Уильям Янг';

	SELECT nom.id INTO id_nominee_107
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	JOIN "public.Film_crew_members" cm ON nom.film_crew_members_id = cm.id
	WHERE m.name = 'Медицинский там, потому что' AND cm.name = 'Грегори Мартинес';

	SELECT nom.id INTO id_nominee_108
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	JOIN "public.Film_crew_members" cm ON nom.film_crew_members_id = cm.id
	WHERE m.name = 'Вытащите студента' AND cm.name = 'Джейсон Грей';

	SELECT nom.id INTO id_nominee_109
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	JOIN "public.Film_crew_members" cm ON nom.film_crew_members_id = cm.id
	WHERE m.name = 'Вести' AND cm.name = 'Рита Макдональд';

	SELECT nom.id INTO id_nominee_110
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	JOIN "public.Film_crew_members" cm ON nom.film_crew_members_id = cm.id
	WHERE m.name = 'Знакомство с природой' AND cm.name = 'Келли Кокс';

	SELECT nom.id INTO id_nominee_111
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	JOIN "public.Film_crew_members" cm ON nom.film_crew_members_id = cm.id
	WHERE m.name = 'Люди' AND cm.name = 'Эмили Хаффман';

	SELECT nom.id INTO id_nominee_112
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	JOIN "public.Film_crew_members" cm ON nom.film_crew_members_id = cm.id
	WHERE m.name = 'Школа разумного возраста' AND cm.name = 'Келли Баллок';

	SELECT nom.id INTO id_nominee_113
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	JOIN "public.Film_crew_members" cm ON nom.film_crew_members_id = cm.id
	WHERE m.name = 'Рынок другой' AND cm.name = 'Кэтрин Холт';

	SELECT nom.id INTO id_nominee_114
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	JOIN "public.Film_crew_members" cm ON nom.film_crew_members_id = cm.id
	WHERE m.name = 'Готовься пиши' AND cm.name = 'Кэтрин Зунига';

	SELECT nom.id INTO id_nominee_115
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	JOIN "public.Film_crew_members" cm ON nom.film_crew_members_id = cm.id
	WHERE m.name = 'Трудно идентифицировать' AND cm.name = 'Дэвид Диас';

	SELECT nom.id INTO id_nominee_116
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	JOIN "public.Film_crew_members" cm ON nom.film_crew_members_id = cm.id
	WHERE m.name = 'Влияние на сайт' AND cm.name = 'Кэрри Генри';

	SELECT nom.id INTO id_nominee_117
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	JOIN "public.Film_crew_members" cm ON nom.film_crew_members_id = cm.id
	WHERE m.name = 'Трудно идентифицировать' AND cm.name = 'Джозеф Уильямсон';

	SELECT nom.id INTO id_nominee_118
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	JOIN "public.Film_crew_members" cm ON nom.film_crew_members_id = cm.id
	WHERE m.name = 'Окно сто индивидуальное' AND cm.name = 'Уитни Эрнандес';

	SELECT nom.id INTO id_nominee_119
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	JOIN "public.Film_crew_members" cm ON nom.film_crew_members_id = cm.id
	WHERE m.name = 'Требовать' AND cm.name = 'Томми Уильямс';

	SELECT nom.id INTO id_nominee_120
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	JOIN "public.Film_crew_members" cm ON nom.film_crew_members_id = cm.id
	WHERE m.name = 'Голосуйте за ту же часть' AND cm.name = 'Джеймс Мартин';

	SELECT nom.id INTO id_nominee_121
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	JOIN "public.Film_crew_members" cm ON nom.film_crew_members_id = cm.id
	WHERE m.name = 'Все вызывают' AND cm.name = 'Ребекка Риз';

	SELECT nom.id INTO id_nominee_122
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	JOIN "public.Film_crew_members" cm ON nom.film_crew_members_id = cm.id
	WHERE m.name = 'Офицер вполне' AND cm.name = 'Лэнс Брайан';

	SELECT nom.id INTO id_nominee_123
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	JOIN "public.Film_crew_members" cm ON nom.film_crew_members_id = cm.id
	WHERE m.name = 'Музыка Миссис' AND cm.name = 'Бенджамин Чен';

	SELECT nom.id INTO id_nominee_124
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	JOIN "public.Film_crew_members" cm ON nom.film_crew_members_id = cm.id
	WHERE m.name = 'Тип семейства' AND cm.name = 'Дэвид Диас';

	SELECT nom.id INTO id_nominee_125
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	JOIN "public.Film_crew_members" cm ON nom.film_crew_members_id = cm.id
	WHERE m.name = 'Брат часть средняя' AND cm.name = 'Бриттани Фицджеральд';

	SELECT nom.id INTO id_nominee_126
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	JOIN "public.Film_crew_members" cm ON nom.film_crew_members_id = cm.id
	WHERE m.name = 'Означает поддержку когда-либо' AND cm.name = 'Чад Мэйс';

	SELECT nom.id INTO id_nominee_127
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	JOIN "public.Film_crew_members" cm ON nom.film_crew_members_id = cm.id
	WHERE m.name = 'Теперь даже' AND cm.name = 'Алисса Эдвардс';

	SELECT nom.id INTO id_nominee_128
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	JOIN "public.Film_crew_members" cm ON nom.film_crew_members_id = cm.id
	WHERE m.name = 'Позже' AND cm.name = 'Кайла Комбс';

	SELECT nom.id INTO id_nominee_129
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	JOIN "public.Film_crew_members" cm ON nom.film_crew_members_id = cm.id
	WHERE m.name = 'Сегодня вечером' AND cm.name = 'Брэнди Уолтон';

	SELECT nom.id INTO id_nominee_130
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	JOIN "public.Film_crew_members" cm ON nom.film_crew_members_id = cm.id
	WHERE m.name = 'Современные другие учат' AND cm.name = 'Джеймс Уайт';

	SELECT nom.id INTO id_nominee_131
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	JOIN "public.Film_crew_members" cm ON nom.film_crew_members_id = cm.id
	WHERE m.name = 'Две войны' AND cm.name = 'Стивен Салливан';

	SELECT nom.id INTO id_nominee_132
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	JOIN "public.Film_crew_members" cm ON nom.film_crew_members_id = cm.id
	WHERE m.name = 'Влияние на сайт' AND cm.name = 'Бэйли Уотсон';

	SELECT nom.id INTO id_nominee_133
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	JOIN "public.Film_crew_members" cm ON nom.film_crew_members_id = cm.id
	WHERE m.name = 'Спорить, раскрывать' AND cm.name = 'Дуглас Миллер';

	SELECT nom.id INTO id_nominee_134
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	JOIN "public.Film_crew_members" cm ON nom.film_crew_members_id = cm.id
	WHERE m.name = 'Означает поддержку когда-либо' AND cm.name = 'Кэти Леон';

	SELECT nom.id INTO id_nominee_135
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	JOIN "public.Film_crew_members" cm ON nom.film_crew_members_id = cm.id
	WHERE m.name = 'Церковь' AND cm.name = 'Брук Вудард';

	SELECT nom.id INTO id_nominee_136
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	JOIN "public.Film_crew_members" cm ON nom.film_crew_members_id = cm.id
	WHERE m.name = 'Купить' AND cm.name = 'Закари Бартлетт';

	SELECT nom.id INTO id_nominee_137
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	JOIN "public.Film_crew_members" cm ON nom.film_crew_members_id = cm.id
	WHERE m.name = 'Введите другой' AND cm.name = 'Кортни Эллиотт';

	SELECT nom.id INTO id_nominee_138
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	JOIN "public.Film_crew_members" cm ON nom.film_crew_members_id = cm.id
	WHERE m.name = 'Семья' AND cm.name = 'Чарльз Нельсон';

	SELECT nom.id INTO id_nominee_139
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	JOIN "public.Film_crew_members" cm ON nom.film_crew_members_id = cm.id
	WHERE m.name = 'Существующее решение' AND cm.name = 'Эдвард Холмс';

	SELECT nom.id INTO id_nominee_140
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	JOIN "public.Film_crew_members" cm ON nom.film_crew_members_id = cm.id
	WHERE m.name = 'Сами благодарю' AND cm.name = 'Эдуардо Джонсон';

	SELECT nom.id INTO id_nominee_141
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	JOIN "public.Film_crew_members" cm ON nom.film_crew_members_id = cm.id
	WHERE m.name = 'Угроза, которой мы служим' AND cm.name = 'Томас Медина';

	SELECT nom.id INTO id_nominee_142
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	JOIN "public.Film_crew_members" cm ON nom.film_crew_members_id = cm.id
	WHERE m.name = 'Медицинский там, потому что' AND cm.name = 'Стивен Джонсон';

	SELECT nom.id INTO id_nominee_143
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	JOIN "public.Film_crew_members" cm ON nom.film_crew_members_id = cm.id
	WHERE m.name = 'Церковь' AND cm.name = 'Роберт Петерсон';

	SELECT nom.id INTO id_nominee_144
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	JOIN "public.Film_crew_members" cm ON nom.film_crew_members_id = cm.id
	WHERE m.name = 'Общество войной' AND cm.name = 'Кэти Бак';

	SELECT nom.id INTO id_nominee_145
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	JOIN "public.Film_crew_members" cm ON nom.film_crew_members_id = cm.id
	WHERE m.name = 'Отец смены станции' AND cm.name = 'Питер Бест';

	SELECT nom.id INTO id_nominee_146
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	JOIN "public.Film_crew_members" cm ON nom.film_crew_members_id = cm.id
	WHERE m.name = 'Офицер вполне' AND cm.name = 'Мишель Кук';

	SELECT nom.id INTO id_nominee_147
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	JOIN "public.Film_crew_members" cm ON nom.film_crew_members_id = cm.id
	WHERE m.name = 'Этот адвокат по заданию' AND cm.name = 'Закари Бартлетт';

	SELECT nom.id INTO id_nominee_148
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	JOIN "public.Film_crew_members" cm ON nom.film_crew_members_id = cm.id
	WHERE m.name = 'Добрый или' AND cm.name = 'Джордан Эндрюс';

	SELECT nom.id INTO id_nominee_149
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	JOIN "public.Film_crew_members" cm ON nom.film_crew_members_id = cm.id
	WHERE m.name = 'Каждому достаточно, как' AND cm.name = 'Брэнди Уолтон';

	SELECT nom.id INTO id_nominee_150
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	WHERE m.name = 'Семья' AND nom.film_crew_members_id IS NULL;

	SELECT nom.id INTO id_nominee_151
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	WHERE m.name = 'Как оставаться политикой' AND nom.film_crew_members_id IS NULL;

	SELECT nom.id INTO id_nominee_152
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	WHERE m.name = 'Фонд мира' AND nom.film_crew_members_id IS NULL;

	SELECT nom.id INTO id_nominee_153
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	WHERE m.name = 'Мог распознать' AND nom.film_crew_members_id IS NULL;

	SELECT nom.id INTO id_nominee_154
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	WHERE m.name = 'Никогда' AND nom.film_crew_members_id IS NULL;

	SELECT nom.id INTO id_nominee_155
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	WHERE m.name = 'Навык кровати поздно' AND nom.film_crew_members_id IS NULL;

	SELECT nom.id INTO id_nominee_156
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	WHERE m.name = 'К' AND nom.film_crew_members_id IS NULL;

	SELECT nom.id INTO id_nominee_157
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	WHERE m.name = 'Впереди опыт брата' AND nom.film_crew_members_id IS NULL;

	SELECT nom.id INTO id_nominee_158
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	WHERE m.name = 'Чувство атаки читать' AND nom.film_crew_members_id IS NULL;

	SELECT nom.id INTO id_nominee_159
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	WHERE m.name = 'До внимания' AND nom.film_crew_members_id IS NULL;

	SELECT nom.id INTO id_nominee_160
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	WHERE m.name = 'Медицинский там, потому что' AND nom.film_crew_members_id IS NULL;

	SELECT nom.id INTO id_nominee_161
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	WHERE m.name = 'Эксперт' AND nom.film_crew_members_id IS NULL;

	SELECT nom.id INTO id_nominee_162
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	WHERE m.name = 'Живой мальчик, звук' AND nom.film_crew_members_id IS NULL;

	SELECT nom.id INTO id_nominee_163
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	WHERE m.name = 'Особо светлый' AND nom.film_crew_members_id IS NULL;

	SELECT nom.id INTO id_nominee_164
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	WHERE m.name = 'Определить, определить вид' AND nom.film_crew_members_id IS NULL;

	SELECT nom.id INTO id_nominee_165
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	WHERE m.name = 'Религиозный демократ' AND nom.film_crew_members_id IS NULL;

	SELECT nom.id INTO id_nominee_166
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	WHERE m.name = 'Муж' AND nom.film_crew_members_id IS NULL;

	SELECT nom.id INTO id_nominee_167
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	WHERE m.name = 'Явный рост производства' AND nom.film_crew_members_id IS NULL;

	SELECT nom.id INTO id_nominee_168
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	WHERE m.name = 'Сила страны' AND nom.film_crew_members_id IS NULL;

	SELECT nom.id INTO id_nominee_169
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	WHERE m.name = 'Каждому достаточно, как' AND nom.film_crew_members_id IS NULL;

	SELECT nom.id INTO id_nominee_170
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	WHERE m.name = 'Различный' AND nom.film_crew_members_id IS NULL;

	SELECT nom.id INTO id_nominee_171
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	WHERE m.name = 'Характер' AND nom.film_crew_members_id IS NULL;

	SELECT nom.id INTO id_nominee_172
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	WHERE m.name = 'Беспокойство' AND nom.film_crew_members_id IS NULL;

	SELECT nom.id INTO id_nominee_173
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	WHERE m.name = 'Никогда не режь' AND nom.film_crew_members_id IS NULL;

	SELECT nom.id INTO id_nominee_174
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	WHERE m.name = 'Колледжский мяч.' AND nom.film_crew_members_id IS NULL;

	SELECT nom.id INTO id_nominee_175
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	WHERE m.name = 'Еще' AND nom.film_crew_members_id IS NULL;

	SELECT nom.id INTO id_nominee_176
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	WHERE m.name = 'Нация его поперек' AND nom.film_crew_members_id IS NULL;

	SELECT nom.id INTO id_nominee_177
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	WHERE m.name = 'Петь' AND nom.film_crew_members_id IS NULL;

	SELECT nom.id INTO id_nominee_178
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	WHERE m.name = 'Знакомство с природой' AND nom.film_crew_members_id IS NULL;

	SELECT nom.id INTO id_nominee_179
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	WHERE m.name = 'Спорить, раскрывать' AND nom.film_crew_members_id IS NULL;

	SELECT nom.id INTO id_nominee_180
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	WHERE m.name = 'Поинт-команда' AND nom.film_crew_members_id IS NULL;

	SELECT nom.id INTO id_nominee_181
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	WHERE m.name = 'Обращаться' AND nom.film_crew_members_id IS NULL;

	SELECT nom.id INTO id_nominee_182
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	WHERE m.name = 'Красивый подъем' AND nom.film_crew_members_id IS NULL;

	SELECT nom.id INTO id_nominee_183
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	WHERE m.name = 'Причина кожи' AND nom.film_crew_members_id IS NULL;

	SELECT nom.id INTO id_nominee_184
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	WHERE m.name = 'Коробка' AND nom.film_crew_members_id IS NULL;

	SELECT nom.id INTO id_nominee_185
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	WHERE m.name = 'Середина' AND nom.film_crew_members_id IS NULL;

	SELECT nom.id INTO id_nominee_186
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	WHERE m.name = 'Рынок другой' AND nom.film_crew_members_id IS NULL;

	SELECT nom.id INTO id_nominee_187
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	WHERE m.name = 'Класс закрыть' AND nom.film_crew_members_id IS NULL;

	SELECT nom.id INTO id_nominee_188
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	WHERE m.name = 'Все вылезает наружу' AND nom.film_crew_members_id IS NULL;

	SELECT nom.id INTO id_nominee_189
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	WHERE m.name = 'Если страдать' AND nom.film_crew_members_id IS NULL;

	SELECT nom.id INTO id_nominee_190
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	WHERE m.name = 'Один раз' AND nom.film_crew_members_id IS NULL;

	SELECT nom.id INTO id_nominee_191
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	WHERE m.name = 'Кусочек' AND nom.film_crew_members_id IS NULL;

	SELECT nom.id INTO id_nominee_192
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	WHERE m.name = 'Потерять магазин вечером' AND nom.film_crew_members_id IS NULL;

	SELECT nom.id INTO id_nominee_193
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	WHERE m.name = 'Поздно счастлив' AND nom.film_crew_members_id IS NULL;

	SELECT nom.id INTO id_nominee_194
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	WHERE m.name = 'Голосуйте за ту же часть' AND nom.film_crew_members_id IS NULL;

	SELECT nom.id INTO id_nominee_195
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	WHERE m.name = 'Все может быть' AND nom.film_crew_members_id IS NULL;

	SELECT nom.id INTO id_nominee_196
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	WHERE m.name = 'Две войны' AND nom.film_crew_members_id IS NULL;

	SELECT nom.id INTO id_nominee_197
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	WHERE m.name = 'До' AND nom.film_crew_members_id IS NULL;

	SELECT nom.id INTO id_nominee_198
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	WHERE m.name = 'Сами благодарю' AND nom.film_crew_members_id IS NULL;

	SELECT nom.id INTO id_nominee_199
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	WHERE m.name = 'Знак суммы момента' AND nom.film_crew_members_id IS NULL;

	SELECT nom.id INTO id_nominee_200
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	WHERE m.name = 'Бал год' AND nom.film_crew_members_id IS NULL;

	SELECT nom.id INTO id_nominee_201
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	WHERE m.name = 'Ничего не упоминай, наш' AND nom.film_crew_members_id IS NULL;

	SELECT nom.id INTO id_nominee_202
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	WHERE m.name = 'Сохранить пропуск' AND nom.film_crew_members_id IS NULL;

	SELECT nom.id INTO id_nominee_203
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	WHERE m.name = 'Ну представьте себе' AND nom.film_crew_members_id IS NULL;

	SELECT nom.id INTO id_nominee_204
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	WHERE m.name = 'Готовый' AND nom.film_crew_members_id IS NULL;

	SELECT nom.id INTO id_nominee_205
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	WHERE m.name = 'Разница' AND nom.film_crew_members_id IS NULL;

	SELECT nom.id INTO id_nominee_206
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	WHERE m.name = 'Окно сто индивидуальное' AND nom.film_crew_members_id IS NULL;

	SELECT nom.id INTO id_nominee_207
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	WHERE m.name = 'Готовься пиши' AND nom.film_crew_members_id IS NULL;

	SELECT nom.id INTO id_nominee_208
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	WHERE m.name = 'Офицер вполне' AND nom.film_crew_members_id IS NULL;

	SELECT nom.id INTO id_nominee_209
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	WHERE m.name = 'Теперь даже' AND nom.film_crew_members_id IS NULL;

	SELECT nom.id INTO id_nominee_210
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	WHERE m.name = 'Сад' AND nom.film_crew_members_id IS NULL;

	SELECT nom.id INTO id_nominee_211
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	WHERE m.name = 'Помнить' AND nom.film_crew_members_id IS NULL;

	SELECT nom.id INTO id_nominee_212
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	WHERE m.name = 'Одно целое раскрытие' AND nom.film_crew_members_id IS NULL;

	SELECT nom.id INTO id_nominee_213
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	WHERE m.name = 'Почувствуйте, опишите производство' AND nom.film_crew_members_id IS NULL;

	SELECT nom.id INTO id_nominee_214
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	WHERE m.name = 'Купить' AND nom.film_crew_members_id IS NULL;

	SELECT nom.id INTO id_nominee_215
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	WHERE m.name = 'Последний официальный точно' AND nom.film_crew_members_id IS NULL;

	SELECT nom.id INTO id_nominee_216
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	WHERE m.name = 'Вода' AND nom.film_crew_members_id IS NULL;

	SELECT nom.id INTO id_nominee_217
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	WHERE m.name = 'Набор отчетов' AND nom.film_crew_members_id IS NULL;

	SELECT nom.id INTO id_nominee_218
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	WHERE m.name = 'Служить производительности создавать' AND nom.film_crew_members_id IS NULL;

	SELECT nom.id INTO id_nominee_219
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	WHERE m.name = 'Современные другие учат' AND nom.film_crew_members_id IS NULL;

	SELECT nom.id INTO id_nominee_220
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	WHERE m.name = 'Все вызывают' AND nom.film_crew_members_id IS NULL;

	SELECT nom.id INTO id_nominee_221
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	WHERE m.name = 'Существующее решение' AND nom.film_crew_members_id IS NULL;

	SELECT nom.id INTO id_nominee_222
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	WHERE m.name = 'Часовое здание' AND nom.film_crew_members_id IS NULL;

	SELECT nom.id INTO id_nominee_223
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	WHERE m.name = 'Поднимись, слушай' AND nom.film_crew_members_id IS NULL;

	SELECT nom.id INTO id_nominee_224
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	WHERE m.name = 'Встряхнуть администрацию' AND nom.film_crew_members_id IS NULL;

	SELECT nom.id INTO id_nominee_225
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	WHERE m.name = 'Авторитетное присоединение' AND nom.film_crew_members_id IS NULL;

	SELECT nom.id INTO id_nominee_226
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	WHERE m.name = 'Надеяться' AND nom.film_crew_members_id IS NULL;

	SELECT nom.id INTO id_nominee_227
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	WHERE m.name = 'Медицинское сообщество' AND nom.film_crew_members_id IS NULL;

	SELECT nom.id INTO id_nominee_228
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	WHERE m.name = 'Земля' AND nom.film_crew_members_id IS NULL;

	SELECT nom.id INTO id_nominee_229
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	WHERE m.name = 'Признайся во всем' AND nom.film_crew_members_id IS NULL;

	SELECT nom.id INTO id_nominee_230
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	WHERE m.name = 'Брат часть средняя' AND nom.film_crew_members_id IS NULL;

	SELECT nom.id INTO id_nominee_231
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	WHERE m.name = 'Дом' AND nom.film_crew_members_id IS NULL;

	SELECT nom.id INTO id_nominee_232
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	WHERE m.name = 'Люди' AND nom.film_crew_members_id IS NULL;

	SELECT nom.id INTO id_nominee_233
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	WHERE m.name = 'Угроза, которой мы служим' AND nom.film_crew_members_id IS NULL;

	SELECT nom.id INTO id_nominee_234
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	WHERE m.name = 'Количество' AND nom.film_crew_members_id IS NULL;

	SELECT nom.id INTO id_nominee_235
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	WHERE m.name = 'Работа' AND nom.film_crew_members_id IS NULL;

	SELECT nom.id INTO id_nominee_236
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	WHERE m.name = 'Возможно, сначала' AND nom.film_crew_members_id IS NULL;

	SELECT nom.id INTO id_nominee_237
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	WHERE m.name = 'Церковь' AND nom.film_crew_members_id IS NULL;

	SELECT nom.id INTO id_nominee_238
	FROM "public.Nominees" nom
	JOIN "public.Movies" m ON nom.movie_id = m.id
	WHERE m.name = 'День национального генерала' AND nom.film_crew_members_id IS NULL;

	SELECT p.id INTO id_prime_0
	FROM "public.Primes" p
	WHERE p.name = 'Сатурн';

	SELECT p.id INTO id_prime_1
	FROM "public.Primes" p
	WHERE p.name = 'Премия Гильдии актеров';

	SELECT p.id INTO id_prime_2
	FROM "public.Primes" p
	WHERE p.name = 'Азиатская киноакадемия';

	SELECT p.id INTO id_prime_3
	FROM "public.Primes" p
	WHERE p.name = 'Золотая малина';

	SELECT p.id INTO id_prime_4
	FROM "public.Primes" p
	WHERE p.name = 'Британская академия';

	SELECT p.id INTO id_prime_5
	FROM "public.Primes" p
	WHERE p.name = 'Европейская киноакадемия';

	SELECT p.id INTO id_prime_6
	FROM "public.Primes" p
	WHERE p.name = 'Премия канала «MTV»';

	SELECT p.id INTO id_prime_7
	FROM "public.Primes" p
	WHERE p.name = 'Эмми';

	SELECT p.id INTO id_prime_8
	FROM "public.Primes" p
	WHERE p.name = 'Золотой глобус';

	SELECT p.id INTO id_prime_9
	FROM "public.Primes" p
	WHERE p.name = 'Гойя';

	SELECT p.id INTO id_prime_10
	FROM "public.Primes" p
	WHERE p.name = 'Оскар';

	SELECT p.id INTO id_prime_11
	FROM "public.Primes" p
	WHERE p.name = 'Сезар';

	INSERT INTO "public.Prime_nominations" (nominee_id, prime_id, nomination, year, "isWon") VALUES
		(id_nominee_0, id_prime_0, 'Лучшая женская роль второго плана', 1986, True),
		(id_nominee_1, id_prime_1, 'Лучшая мужская роль', 2001, True),
		(id_nominee_2, id_prime_2, 'Лучшая женская роль второго плана', 1975, True),
		(id_nominee_3, id_prime_3, 'Лучший актер', 2022, True),
		(id_nominee_4, id_prime_4, 'Лучший актерский состав', 1975, True),
		(id_nominee_5, id_prime_1, 'Лучшая женская роль второго плана', 2012, True),
		(id_nominee_6, id_prime_5, 'Лучший актер', 2001, False),
		(id_nominee_7, id_prime_6, 'Лучшая женская роль второго плана', 2006, True),
		(id_nominee_8, id_prime_7, 'Лучшая женская роль второго плана', 1976, False),
		(id_nominee_9, id_prime_8, 'Лучший актерский состав', 2023, True),
		(id_nominee_10, id_prime_2, 'Лучшая женская роль', 2012, True),
		(id_nominee_11, id_prime_2, 'Лучший актер', 2018, True),
		(id_nominee_12, id_prime_4, 'Лучшая мужская роль второго плана', 2002, False),
		(id_nominee_13, id_prime_4, 'Лучшая мужская роль', 1996, True),
		(id_nominee_14, id_prime_0, 'Лучший актер', 2021, False),
		(id_nominee_15, id_prime_3, 'Лучший актерский состав', 1994, False),
		(id_nominee_16, id_prime_6, 'Лучшая мужская роль', 1980, True),
		(id_nominee_17, id_prime_2, 'Лучшая мужская роль', 1975, False),
		(id_nominee_18, id_prime_6, 'Лучшая мужская роль второго плана', 1979, False),
		(id_nominee_19, id_prime_9, 'Лучшая женская роль второго плана', 1982, False),
		(id_nominee_20, id_prime_1, 'Лучший актер', 2021, True),
		(id_nominee_21, id_prime_3, 'Лучшая мужская роль второго плана', 1980, False),
		(id_nominee_22, id_prime_8, 'Лучшая женская роль второго плана', 1996, True),
		(id_nominee_23, id_prime_0, 'Лучшая женская роль', 1987, False),
		(id_nominee_24, id_prime_8, 'Лучшая женская роль', 1981, True),
		(id_nominee_25, id_prime_0, 'Лучшая мужская роль', 1977, False),
		(id_nominee_26, id_prime_2, 'Лучший актерский состав', 2002, True),
		(id_nominee_27, id_prime_7, 'Лучшая мужская роль второго плана', 2001, True),
		(id_nominee_28, id_prime_0, 'Лучшая мужская роль второго плана', 1975, True),
		(id_nominee_29, id_prime_6, 'Лучший актер', 2013, False),
		(id_nominee_30, id_prime_6, 'Лучшая мужская роль второго плана', 1984, False),
		(id_nominee_31, id_prime_7, 'Лучшая мужская роль', 2021, False),
		(id_nominee_32, id_prime_9, 'Лучший актерский состав', 1978, True),
		(id_nominee_33, id_prime_1, 'Лучшая женская роль', 2018, True),
		(id_nominee_34, id_prime_2, 'Лучшая женская роль', 2002, True),
		(id_nominee_35, id_prime_8, 'Лучший актерский состав', 2013, True),
		(id_nominee_36, id_prime_10, 'Лучшая женская роль', 1981, True),
		(id_nominee_37, id_prime_1, 'Лучшая мужская роль второго плана', 1977, False),
		(id_nominee_38, id_prime_4, 'Лучшая мужская роль', 1983, True),
		(id_nominee_39, id_prime_6, 'Лучшая женская роль второго плана', 2001, False),
		(id_nominee_40, id_prime_6, 'Лучший актерский состав', 2017, True),
		(id_nominee_41, id_prime_2, 'Лучшая женская роль второго плана', 2012, True),
		(id_nominee_42, id_prime_0, 'Лучший актерский состав', 2021, False),
		(id_nominee_43, id_prime_1, 'Лучшая женская роль', 2005, False),
		(id_nominee_44, id_prime_3, 'Лучшая женская роль', 2006, False),
		(id_nominee_45, id_prime_4, 'Лучшая мужская роль', 2016, True),
		(id_nominee_46, id_prime_0, 'Лучший актерский состав', 2016, False),
		(id_nominee_47, id_prime_2, 'Лучшая мужская роль второго плана', 2016, True),
		(id_nominee_48, id_prime_4, 'Лучший актерский состав', 1987, False),
		(id_nominee_49, id_prime_11, 'Лучшая мужская роль второго плана', 1975, True),
		(id_nominee_50, id_prime_11, 'Лучший актерский состав', 2019, False),
		(id_nominee_51, id_prime_9, 'Лучший актер', 2011, True),
		(id_nominee_52, id_prime_9, 'Лучшая женская роль второго плана', 2011, True),
		(id_nominee_53, id_prime_8, 'Лучшая мужская роль второго плана', 2004, False),
		(id_nominee_54, id_prime_4, 'Лучшая женская роль второго плана', 1994, True),
		(id_nominee_55, id_prime_11, 'Лучшая женская роль второго плана', 2006, False),
		(id_nominee_56, id_prime_5, 'Лучший актер', 2018, False),
		(id_nominee_57, id_prime_8, 'Лучший актерский состав', 1978, False),
		(id_nominee_58, id_prime_11, 'Лучшая мужская роль', 2012, True),
		(id_nominee_59, id_prime_9, 'Лучшая женская роль второго плана', 1986, False),
		(id_nominee_60, id_prime_0, 'Лучший актер', 2005, True),
		(id_nominee_61, id_prime_2, 'Лучший актер', 1978, False),
		(id_nominee_62, id_prime_3, 'Лучшая женская роль второго плана', 1984, False),
		(id_nominee_63, id_prime_5, 'Лучшая мужская роль', 2008, False),
		(id_nominee_64, id_prime_5, 'Лучший актерский состав', 1980, False),
		(id_nominee_65, id_prime_5, 'Лучшая женская роль второго плана', 2012, True),
		(id_nominee_66, id_prime_10, 'Лучший актер', 2012, False),
		(id_nominee_67, id_prime_9, 'Лучшая мужская роль второго плана', 2022, True),
		(id_nominee_68, id_prime_0, 'Лучший актер', 1996, True),
		(id_nominee_69, id_prime_7, 'Лучшая мужская роль', 1998, False),
		(id_nominee_70, id_prime_4, 'Лучшая мужская роль второго плана', 1983, True),
		(id_nominee_71, id_prime_2, 'Лучшая мужская роль', 2007, False),
		(id_nominee_72, id_prime_4, 'Лучшая женская роль второго плана', 1993, True),
		(id_nominee_73, id_prime_1, 'Лучшая женская роль', 1996, True),
		(id_nominee_74, id_prime_5, 'Лучшая мужская роль', 2012, True),
		(id_nominee_75, id_prime_6, 'Лучшая мужская роль', 1976, True),
		(id_nominee_76, id_prime_4, 'Лучший актерский состав', 2013, False),
		(id_nominee_77, id_prime_3, 'Лучший актерский состав', 1987, False),
		(id_nominee_78, id_prime_6, 'Лучшая мужская роль второго плана', 1993, True),
		(id_nominee_79, id_prime_8, 'Лучший актер', 1976, False),
		(id_nominee_80, id_prime_2, 'Лучшая женская роль второго плана', 2006, False),
		(id_nominee_81, id_prime_0, 'Лучший актер', 2012, False),
		(id_nominee_82, id_prime_6, 'Лучшая женская роль', 1981, True),
		(id_nominee_83, id_prime_5, 'Лучший актер', 1980, True),
		(id_nominee_84, id_prime_0, 'Лучшая мужская роль', 2011, False),
		(id_nominee_85, id_prime_7, 'Лучший актерский состав', 1975, False),
		(id_nominee_86, id_prime_3, 'Лучшая женская роль второго плана', 2009, True),
		(id_nominee_87, id_prime_10, 'Лучшая женская роль второго плана', 1988, False),
		(id_nominee_88, id_prime_10, 'Лучший актер', 2012, True),
		(id_nominee_89, id_prime_7, 'Лучший актерский состав', 2014, False),
		(id_nominee_90, id_prime_4, 'Лучшая мужская роль', 1977, False),
		(id_nominee_91, id_prime_9, 'Лучшая мужская роль второго плана', 1990, False),
		(id_nominee_92, id_prime_11, 'Лучшая мужская роль', 2022, True),
		(id_nominee_93, id_prime_7, 'Лучшая женская роль', 2022, False),
		(id_nominee_94, id_prime_7, 'Лучшая мужская роль', 2013, False),
		(id_nominee_95, id_prime_1, 'Лучший актерский состав', 1976, False),
		(id_nominee_96, id_prime_3, 'Лучшая женская роль', 2004, True),
		(id_nominee_97, id_prime_5, 'Лучшая женская роль', 1983, True),
		(id_nominee_98, id_prime_6, 'Лучшая женская роль второго плана', 2002, True),
		(id_nominee_99, id_prime_8, 'Лучший актерский состав', 2023, True),
		(id_nominee_100, id_prime_0, 'Лучший актерский состав', 2010, True),
		(id_nominee_101, id_prime_9, 'Лучший актерский состав', 2001, True),
		(id_nominee_102, id_prime_3, 'Лучшая мужская роль второго плана', 1988, True),
		(id_nominee_103, id_prime_2, 'Лучшая мужская роль', 1994, False),
		(id_nominee_104, id_prime_1, 'Лучший актерский состав', 2001, True),
		(id_nominee_105, id_prime_5, 'Лучший актер', 2022, True),
		(id_nominee_106, id_prime_8, 'Лучший актерский состав', 1988, True),
		(id_nominee_107, id_prime_6, 'Лучшая женская роль', 1977, True),
		(id_nominee_108, id_prime_9, 'Лучшая женская роль', 1998, False),
		(id_nominee_109, id_prime_11, 'Лучшая мужская роль', 1995, False),
		(id_nominee_110, id_prime_9, 'Лучший актерский состав', 2005, True),
		(id_nominee_111, id_prime_2, 'Лучший актер', 1987, False),
		(id_nominee_112, id_prime_10, 'Лучшая мужская роль', 1992, True),
		(id_nominee_113, id_prime_6, 'Лучшая женская роль второго плана', 2021, True),
		(id_nominee_114, id_prime_11, 'Лучший актерский состав', 1998, False),
		(id_nominee_115, id_prime_1, 'Лучшая женская роль', 1996, False),
		(id_nominee_116, id_prime_4, 'Лучшая женская роль', 1993, True),
		(id_nominee_117, id_prime_3, 'Лучший актер', 1996, False),
		(id_nominee_118, id_prime_6, 'Лучшая мужская роль', 2006, False),
		(id_nominee_119, id_prime_9, 'Лучший актер', 1986, False),
		(id_nominee_120, id_prime_6, 'Лучший актерский состав', 2016, False),
		(id_nominee_121, id_prime_2, 'Лучшая мужская роль', 1977, False),
		(id_nominee_122, id_prime_1, 'Лучшая женская роль', 1976, True),
		(id_nominee_123, id_prime_9, 'Лучшая мужская роль', 1982, False),
		(id_nominee_124, id_prime_4, 'Лучшая мужская роль', 2002, True),
		(id_nominee_125, id_prime_10, 'Лучший актерский состав', 1981, True),
		(id_nominee_126, id_prime_2, 'Лучший актерский состав', 1976, False),
		(id_nominee_127, id_prime_11, 'Лучшая мужская роль', 2013, True),
		(id_nominee_128, id_prime_8, 'Лучшая женская роль', 2013, True),
		(id_nominee_129, id_prime_8, 'Лучшая женская роль', 1980, True),
		(id_nominee_130, id_prime_9, 'Лучшая мужская роль', 1988, True),
		(id_nominee_131, id_prime_1, 'Лучший актер', 1980, False),
		(id_nominee_132, id_prime_6, 'Лучшая женская роль', 1993, True),
		(id_nominee_133, id_prime_9, 'Лучшая мужская роль второго плана', 2023, True),
		(id_nominee_134, id_prime_11, 'Лучшая женская роль', 1976, True),
		(id_nominee_135, id_prime_3, 'Лучшая женская роль', 1976, True),
		(id_nominee_136, id_prime_9, 'Лучший актерский состав', 1981, False),
		(id_nominee_137, id_prime_6, 'Лучший актер', 2006, False),
		(id_nominee_138, id_prime_5, 'Лучший актер', 2018, False),
		(id_nominee_139, id_prime_7, 'Лучшая женская роль второго плана', 2022, True),
		(id_nominee_140, id_prime_8, 'Лучшая мужская роль', 1980, False),
		(id_nominee_141, id_prime_8, 'Лучшая мужская роль', 2019, True),
		(id_nominee_142, id_prime_5, 'Лучшая мужская роль второго плана', 1977, True),
		(id_nominee_143, id_prime_11, 'Лучшая мужская роль второго плана', 1976, False),
		(id_nominee_144, id_prime_0, 'Лучшая женская роль второго плана', 2011, False),
		(id_nominee_145, id_prime_2, 'Лучший актер', 2023, False),
		(id_nominee_146, id_prime_3, 'Лучшая мужская роль второго плана', 1976, False),
		(id_nominee_147, id_prime_0, 'Лучшая женская роль', 1988, False),
		(id_nominee_148, id_prime_11, 'Лучшая женская роль', 1986, True),
		(id_nominee_149, id_prime_9, 'Лучшая мужская роль', 2001, True),
		(id_nominee_150, id_prime_4, 'Лучший фильм', 2018, True),
		(id_nominee_151, id_prime_6, 'Лучший саундтрек', 1983, False),
		(id_nominee_152, id_prime_11, 'Лучшие визуальные эффекты', 1994, True),
		(id_nominee_153, id_prime_6, 'Лучшие визуальные эффекты', 2022, True),
		(id_nominee_154, id_prime_9, 'Лучшие визуальные эффекты', 2006, False),
		(id_nominee_155, id_prime_6, 'Лучшие визуальные эффекты', 2001, False),
		(id_nominee_156, id_prime_11, 'Лучший фильм', 1986, True),
		(id_nominee_157, id_prime_5, 'Лучший саундтрек', 1984, True),
		(id_nominee_158, id_prime_10, 'Лучший фильм', 2021, False),
		(id_nominee_159, id_prime_6, 'Лучшие визуальные эффекты', 2004, True),
		(id_nominee_160, id_prime_9, 'Лучшие визуальные эффекты', 1977, True),
		(id_nominee_161, id_prime_6, 'Лучшие визуальные эффекты', 2019, False),
		(id_nominee_162, id_prime_5, 'Лучший фильм', 1977, True),
		(id_nominee_163, id_prime_9, 'Лучшие визуальные эффекты', 1993, True),
		(id_nominee_164, id_prime_1, 'Лучшие визуальные эффекты', 2002, True),
		(id_nominee_165, id_prime_6, 'Лучшие визуальные эффекты', 2012, True),
		(id_nominee_166, id_prime_7, 'Лучшие визуальные эффекты', 2022, False),
		(id_nominee_167, id_prime_3, 'Лучший саундтрек', 2022, True),
		(id_nominee_168, id_prime_3, 'Лучшие визуальные эффекты', 1976, False),
		(id_nominee_150, id_prime_8, 'Лучший саундтрек', 2018, False),
		(id_nominee_169, id_prime_4, 'Лучшие визуальные эффекты', 2001, False),
		(id_nominee_170, id_prime_11, 'Лучшие визуальные эффекты', 2011, True),
		(id_nominee_171, id_prime_2, 'Лучший саундтрек', 2015, False),
		(id_nominee_172, id_prime_10, 'Лучший саундтрек', 2013, True),
		(id_nominee_169, id_prime_6, 'Лучшие визуальные эффекты', 2001, True),
		(id_nominee_166, id_prime_5, 'Лучший фильм', 2022, True),
		(id_nominee_173, id_prime_11, 'Лучший фильм', 1995, True),
		(id_nominee_174, id_prime_0, 'Лучший саундтрек', 2017, False),
		(id_nominee_175, id_prime_1, 'Лучший фильм', 2012, False),
		(id_nominee_176, id_prime_4, 'Лучший саундтрек', 1999, False),
		(id_nominee_177, id_prime_8, 'Лучший фильм', 2020, True),
		(id_nominee_178, id_prime_4, 'Лучшие визуальные эффекты', 2005, True),
		(id_nominee_169, id_prime_11, 'Лучший фильм', 2001, True),
		(id_nominee_179, id_prime_5, 'Лучший фильм', 2023, True),
		(id_nominee_180, id_prime_5, 'Лучший саундтрек', 1999, False),
		(id_nominee_181, id_prime_8, 'Лучший фильм', 2021, True),
		(id_nominee_181, id_prime_10, 'Лучшие визуальные эффекты', 2021, False),
		(id_nominee_182, id_prime_3, 'Лучший саундтрек', 1991, False),
		(id_nominee_183, id_prime_5, 'Лучший саундтрек', 1981, False),
		(id_nominee_181, id_prime_1, 'Лучший саундтрек', 2021, True),
		(id_nominee_184, id_prime_2, 'Лучшие визуальные эффекты', 2012, True),
		(id_nominee_185, id_prime_4, 'Лучший саундтрек', 2020, True),
		(id_nominee_186, id_prime_8, 'Лучший саундтрек', 2021, False),
		(id_nominee_187, id_prime_6, 'Лучший саундтрек', 2005, True),
		(id_nominee_188, id_prime_4, 'Лучшие визуальные эффекты', 1977, False),
		(id_nominee_189, id_prime_10, 'Лучшие визуальные эффекты', 1984, True),
		(id_nominee_190, id_prime_6, 'Лучший фильм', 1980, True),
		(id_nominee_151, id_prime_10, 'Лучший саундтрек', 1983, True),
		(id_nominee_191, id_prime_11, 'Лучший саундтрек', 2008, True),
		(id_nominee_192, id_prime_9, 'Лучшие визуальные эффекты', 2018, False),
		(id_nominee_176, id_prime_8, 'Лучший фильм', 1999, True),
		(id_nominee_193, id_prime_1, 'Лучшие визуальные эффекты', 1983, True),
		(id_nominee_194, id_prime_2, 'Лучший саундтрек', 2016, False),
		(id_nominee_195, id_prime_7, 'Лучший фильм', 2012, False),
		(id_nominee_196, id_prime_7, 'Лучшие визуальные эффекты', 1980, False),
		(id_nominee_197, id_prime_11, 'Лучший фильм', 1976, False),
		(id_nominee_198, id_prime_9, 'Лучший саундтрек', 1980, False),
		(id_nominee_199, id_prime_6, 'Лучшие визуальные эффекты', 1993, False),
		(id_nominee_200, id_prime_7, 'Лучшие визуальные эффекты', 1975, True),
		(id_nominee_189, id_prime_1, 'Лучшие визуальные эффекты', 1984, True),
		(id_nominee_165, id_prime_1, 'Лучший саундтрек', 2012, True),
		(id_nominee_192, id_prime_5, 'Лучшие визуальные эффекты', 2018, True),
		(id_nominee_201, id_prime_2, 'Лучший саундтрек', 2013, True),
		(id_nominee_202, id_prime_1, 'Лучшие визуальные эффекты', 2001, True),
		(id_nominee_191, id_prime_2, 'Лучший саундтрек', 2008, False),
		(id_nominee_199, id_prime_5, 'Лучший саундтрек', 1993, False),
		(id_nominee_194, id_prime_4, 'Лучший саундтрек', 2016, True),
		(id_nominee_203, id_prime_8, 'Лучший саундтрек', 2011, False),
		(id_nominee_168, id_prime_2, 'Лучшие визуальные эффекты', 1976, True),
		(id_nominee_192, id_prime_9, 'Лучшие визуальные эффекты', 2018, True),
		(id_nominee_204, id_prime_11, 'Лучший фильм', 1990, True),
		(id_nominee_184, id_prime_6, 'Лучшие визуальные эффекты', 2012, False),
		(id_nominee_174, id_prime_5, 'Лучшие визуальные эффекты', 2017, True),
		(id_nominee_180, id_prime_3, 'Лучший саундтрек', 1999, False),
		(id_nominee_205, id_prime_2, 'Лучшие визуальные эффекты', 1975, False),
		(id_nominee_165, id_prime_8, 'Лучшие визуальные эффекты', 2012, True),
		(id_nominee_206, id_prime_4, 'Лучший фильм', 2006, False),
		(id_nominee_191, id_prime_3, 'Лучшие визуальные эффекты', 2008, True),
		(id_nominee_207, id_prime_2, 'Лучший фильм', 1998, True),
		(id_nominee_208, id_prime_8, 'Лучший саундтрек', 1976, True),
		(id_nominee_209, id_prime_8, 'Лучший саундтрек', 2013, True),
		(id_nominee_210, id_prime_0, 'Лучший фильм', 2014, False),
		(id_nominee_194, id_prime_7, 'Лучший саундтрек', 2016, False),
		(id_nominee_211, id_prime_8, 'Лучшие визуальные эффекты', 1979, False),
		(id_nominee_212, id_prime_11, 'Лучший фильм', 2012, False),
		(id_nominee_191, id_prime_6, 'Лучшие визуальные эффекты', 2008, True),
		(id_nominee_213, id_prime_0, 'Лучший фильм', 1990, True),
		(id_nominee_214, id_prime_6, 'Лучший фильм', 1981, False),
		(id_nominee_215, id_prime_5, 'Лучший фильм', 1983, True),
		(id_nominee_216, id_prime_4, 'Лучший фильм', 1986, True),
		(id_nominee_170, id_prime_1, 'Лучшие визуальные эффекты', 2011, True),
		(id_nominee_150, id_prime_0, 'Лучший фильм', 2018, True),
		(id_nominee_186, id_prime_2, 'Лучший фильм', 2021, True),
		(id_nominee_217, id_prime_9, 'Лучший саундтрек', 1978, True),
		(id_nominee_218, id_prime_4, 'Лучший саундтрек', 2006, True),
		(id_nominee_210, id_prime_2, 'Лучший саундтрек', 2014, False),
		(id_nominee_163, id_prime_5, 'Лучший саундтрек', 1993, False),
		(id_nominee_219, id_prime_10, 'Лучшие визуальные эффекты', 1988, False),
		(id_nominee_212, id_prime_2, 'Лучший фильм', 2012, False),
		(id_nominee_196, id_prime_0, 'Лучший фильм', 1980, False),
		(id_nominee_220, id_prime_6, 'Лучший саундтрек', 1977, True),
		(id_nominee_221, id_prime_4, 'Лучший фильм', 2022, True),
		(id_nominee_222, id_prime_1, 'Лучшие визуальные эффекты', 2020, False),
		(id_nominee_183, id_prime_1, 'Лучший саундтрек', 1981, False),
		(id_nominee_178, id_prime_9, 'Лучшие визуальные эффекты', 2005, True),
		(id_nominee_223, id_prime_9, 'Лучший фильм', 1996, False),
		(id_nominee_224, id_prime_1, 'Лучший саундтрек', 1992, True),
		(id_nominee_225, id_prime_9, 'Лучшие визуальные эффекты', 2001, False),
		(id_nominee_226, id_prime_11, 'Лучший саундтрек', 1996, False),
		(id_nominee_227, id_prime_7, 'Лучший фильм', 1978, True),
		(id_nominee_175, id_prime_3, 'Лучший саундтрек', 2012, False),
		(id_nominee_184, id_prime_10, 'Лучшие визуальные эффекты', 2012, False),
		(id_nominee_175, id_prime_9, 'Лучший фильм', 2012, True),
		(id_nominee_198, id_prime_6, 'Лучший фильм', 1980, True),
		(id_nominee_174, id_prime_11, 'Лучший фильм', 2017, False),
		(id_nominee_228, id_prime_8, 'Лучший саундтрек', 2004, True),
		(id_nominee_214, id_prime_5, 'Лучший фильм', 1981, False),
		(id_nominee_175, id_prime_5, 'Лучший саундтрек', 2013, True),
		(id_nominee_175, id_prime_3, 'Лучшие визуальные эффекты', 2012, False),
		(id_nominee_213, id_prime_3, 'Лучший саундтрек', 1990, False),
		(id_nominee_219, id_prime_2, 'Лучший саундтрек', 1988, True),
		(id_nominee_168, id_prime_5, 'Лучший саундтрек', 1976, True),
		(id_nominee_229, id_prime_0, 'Лучшие визуальные эффекты', 2002, True),
		(id_nominee_184, id_prime_3, 'Лучший саундтрек', 2012, False),
		(id_nominee_184, id_prime_1, 'Лучшие визуальные эффекты', 2012, True),
		(id_nominee_201, id_prime_0, 'Лучший фильм', 2013, True),
		(id_nominee_189, id_prime_6, 'Лучший фильм', 1984, False),
		(id_nominee_163, id_prime_9, 'Лучший фильм', 1993, False),
		(id_nominee_195, id_prime_11, 'Лучший фильм', 2012, True),
		(id_nominee_214, id_prime_6, 'Лучшие визуальные эффекты', 1981, False),
		(id_nominee_230, id_prime_11, 'Лучший саундтрек', 1981, False),
		(id_nominee_231, id_prime_5, 'Лучший фильм', 1980, False),
		(id_nominee_232, id_prime_5, 'Лучший фильм', 1987, True),
		(id_nominee_220, id_prime_8, 'Лучшие визуальные эффекты', 1977, False),
		(id_nominee_190, id_prime_2, 'Лучший саундтрек', 1980, False),
		(id_nominee_233, id_prime_0, 'Лучшие визуальные эффекты', 2019, True),
		(id_nominee_234, id_prime_9, 'Лучший саундтрек', 2014, False),
		(id_nominee_198, id_prime_1, 'Лучший фильм', 1980, True),
		(id_nominee_229, id_prime_3, 'Лучший саундтрек', 2002, True),
		(id_nominee_233, id_prime_5, 'Лучший саундтрек', 2019, True),
		(id_nominee_235, id_prime_2, 'Лучший фильм', 1996, True),
		(id_nominee_178, id_prime_9, 'Лучший фильм', 2005, False),
		(id_nominee_204, id_prime_11, 'Лучший саундтрек', 1990, True),
		(id_nominee_236, id_prime_8, 'Лучший саундтрек', 2009, True),
		(id_nominee_237, id_prime_3, 'Лучшие визуальные эффекты', 1976, False),
		(id_nominee_235, id_prime_1, 'Лучший саундтрек', 1996, False),
		(id_nominee_229, id_prime_7, 'Лучший саундтрек', 2002, True),
		(id_nominee_225, id_prime_11, 'Лучшие визуальные эффекты', 2001, False),
		(id_nominee_163, id_prime_0, 'Лучший фильм', 1993, True),
		(id_nominee_238, id_prime_3, 'Лучший фильм', 2016, False);
END $$;



INSERT INTO "public.Cinemas" (name, location, phone) VALUES
	('Первый','с. Октябрьское (Челяб.), наб. Карла Либкнехта, д. 3/7, 442638','8 242 296 3421'),
	('Второй','клх Волгодонск, бул. Дзержинского, д. 72 стр. 4, 057872','85321985759'),
	('Третий','ст. Шелехов, пр. Дорожный, д. 242 стр. 5/5, 149742','8 (319) 241-62-27'),
	('Четвертый','клх Архыз, пер. Огородный, д. 50, 834145','8 483 551 43 65'),
	('Пятый','клх Партизанск, пр. Восьмого Марта, д. 39 стр. 53, 281753','8 (288) 758-0370'),
	('Шестой','к. Тотьма, ул. Дорожников, д. 459 стр. 18, 242108','8 (282) 014-14-78'),
	('Седьмой','д. Бугуруслан, алл. Кольцова, д. 7/4, 538442','8 (345) 727-94-56'),
	('Восьмой','г. Красноселькуп, ш. Социалистическое, д. 5 к. 2, 200689','8 597 504 38 54'),
	('Девятый','п. Лабытнанги, ул. Сиреневая, д. 5/4 стр. 491, 275940','8 (788) 855-3175'),
	('Десятый','г. Нурлат, пр. Гвардейский, д. 6 стр. 254, 869650','8 786 040 5982'),
	('Одиннадцатый','клх Анива, пер. Карла Маркса, д. 5/3 стр. 854, 270504','88164631917'),
	('Двенадцатый','п. Тула, ул. Речная, д. 3/5 стр. 92, 203652','75861627286'),
	('Тринадцатый','к. Киров (Вятка), ш. Ярославское, д. 570 к. 7, 904041','8 (424) 694-68-83'),
	('Четырнадцатый','ст. Лабинск, пер. Брянский, д. 75 стр. 5/6, 395954','8 (305) 715-1407'),
	('Пятнадцатый','к. Андреаполь, алл. Заречная, д. 7/9, 629391','88639097876'),
	('Шестнадцатый','д. Невинномысск, пер. Слободской, д. 4/9 стр. 825, 047150','8 (731) 422-05-51'),
	('Семнадцатый','ст. Воркута, ул. Владимирская, д. 4 стр. 9, 106072','8 213 086 7914'),
	('Восемнадцатый','п. Кущевская, наб. Ломоносова, д. 3/1 стр. 1, 534704','76148201443'),
	('Девятнадцатый','клх Сузун, ул. Герцена, д. 460 к. 9, 649099','8 980 577 7875'),
	('Двадцатый','д. Вилюйск, пер. Красный, д. 551 стр. 543, 344860','8 (923) 528-66-10'),
	('Двадцать первый','к. Черемхово, бул. Севастопольский, д. 5 стр. 302, 167283','88586964533'),
	('Двадцать второй','с. Якша, алл. Розы Люксембург, д. 25 к. 2/4, 105248','86369544084'),
	('Двадцать третий','д. Воткинск, ш. Выгонное, д. 10 к. 807, 346815','8 (587) 103-61-71'),
	('Двадцать четвертый','к. Устюжна, алл. Юбилейная, д. 63 к. 648, 726197','8 (277) 112-2098'),
	('Двадцать пятый','к. Кириши, ш. Воровского, д. 889 стр. 41, 591072','8 (152) 311-74-08'),
	('Двадцать шестой','клх Асбест, ш. Кавказское, д. 9/6 к. 765, 540461','8 126 080 72 18'),
	('Двадцать седьмой','клх Миллерово, ул. Энергетиков, д. 2, 671815','8 (628) 609-80-11'),
	('Двадцать восьмой','п. Урус-Мартан, ш. Маркса, д. 5 к. 4, 435859','8 (391) 663-24-40'),
	('Двадцать девятый','п. Калач-на-Дону, ш. Минина, д. 21, 861402','8 619 166 3985'),
	('Тридцатый','с. Тольятти, наб. Заливная, д. 40 к. 88, 672009','8 404 505 2272'),
	('Тридцать первый','к. Шахты, пр. Курчатова, д. 71 к. 8/5, 732990','8 (808) 067-8398'),
	('Тридцать второй','г. Октябрьский (Башк.), ш. Ключевое, д. 374, 154234','8 (713) 893-9227'),
	('Тридцать третий','д. Северо-Курильск, ш. Абрикосовое, д. 3/6, 659214','8 (698) 207-61-59'),
	('Тридцать четвертый','к. Эльбрус, наб. Энергетиков, д. 1, 746936','8 235 556 70 44'),
	('Тридцать пятый','клх Поронайск, бул. Володарского, д. 435 стр. 2/2, 608411','8 (304) 159-20-69'),
	('Тридцать шестой','с. Северо-Курильск, бул. Первомайский, д. 8 к. 6/1, 077692','8 (525) 180-94-34'),
	('Тридцать седьмой','с. Домбай, пер. Юбилейный, д. 1 к. 363, 437609','83384555918'),
	('Тридцать восьмой','п. Сковородино, бул. Восьмого Марта, д. 1/7, 980154','8739 582 9404'),
	('Тридцать девятый','д. Рязань, пр. Ленина, д. 6, 299088','8 504 931 6328'),
	('Сороковой','ст. Домодедово, пр. Крымский, д. 746 стр. 62, 779861','8 557 424 7048'),
	('Сорок первый','п. Ведено, алл. Ручейная, д. 137 стр. 82, 062246','8 698 984 0884'),
	('Сорок второй','г. Адыгейск, алл. Разина, д. 3 стр. 59, 791389','8 (404) 551-2662'),
	('Сорок третий','д. Шуя, наб. Павлова, д. 9/9 к. 63, 438334','84478820923'),
	('Сорок четвертый','к. Хасавюрт, бул. Космонавтов, д. 5 к. 7, 334547','8 (822) 149-4224'),
	('Сорок пятый','к. Усть-Кут, алл. Титова, д. 521, 164583','82238991186'),
	('Сорок шестой','клх Гремячинск (Бурят.), наб. Техническая, д. 52 стр. 9/9, 551003','8 296 930 1884'),
	('Сорок седьмой','п. Новокузнецк, алл. Заречная, д. 20, 201144','8 (895) 122-95-90'),
	('Сорок восьмой','ст. Сладково, алл. Лесхозная, д. 99 к. 5, 739809','8 (215) 094-36-22'),
	('Сорок девятый','к. Тарко-Сале, алл. Родниковая, д. 680 к. 69, 428865','71928797197'),
	('Пятидесятый','клх Енисейск, ул. Угловая, д. 1 к. 6, 816495','8 273 816 7515'),
	('Пятьдесят первый','п. Тимашевск, пер. Матросова, д. 48, 373012','8 138 651 0685'),
	('Пятьдесят второй','клх Октябрьский (Башк.), бул. Космонавтов, д. 320 стр. 8, 627276','8 477 152 15 08'),
	('Пятьдесят третий','с. Калач-на-Дону, пер. Осенний, д. 342, 439531','8 (467) 855-5137'),
	('Пятьдесят четвертый','п. Андреаполь, наб. Солнечная, д. 1/9, 656429','8 442 628 49 06'),
	('Пятьдесят пятый','г. Вязьма, ул. Высоковольтная, д. 3/2 стр. 70, 841654','8 (090) 291-23-95'),
	('Пятьдесят шестой','д. Миллерово, бул. 8 Марта, д. 6, 761485','8 764 187 5349'),
	('Пятьдесят седьмой','д. Железногорск(Курск.), пр. Садовый, д. 908, 212053','8 (438) 841-96-34'),
	('Пятьдесят восьмой','п. Новороссийка, пер. Воровского, д. 20 стр. 7, 571338','8 675 015 3340'),
	('Пятьдесят девятый','с. Куртамыш, бул. Толстого, д. 56, 053806','8 841 305 41 36'),
	('Шестидесятый','д. Якша, наб. Приморская, д. 2 стр. 7, 343733','8 (013) 179-70-59'),
	('Шестьдесят первый','г. Тихорецк, бул. Механизаторов, д. 473 стр. 9/7, 523200','8 656 157 63 04'),
	('Шестьдесят второй','к. Рыльск, наб. Буденного, д. 49, 325317','74692735989'),
	('Шестьдесят третий','к. Томари, алл. Выгонная, д. 7/1, 956896','8 542 059 2664'),
	('Шестьдесят четвертый','п. Бузулук, наб. Крестьянская, д. 10 стр. 6, 662138','8 571 388 54 93'),
	('Шестьдесят пятый','г. Можга, алл. Центральная, д. 9/6 к. 56, 899279','8 (959) 356-7642'),
	('Шестьдесят шестой','ст. Петропавловск-Камчатский, наб. Ольховая, д. 615, 721640','8 (032) 595-36-45'),
	('Шестьдесят седьмой','г. Радужный, пр. Тенистый, д. 7, 478132','8 (277) 738-3583'),
	('Шестьдесят восьмой','ст. Сортавала, алл. Гаражная, д. 2/4, 205219','8 (590) 205-9561'),
	('Шестьдесят девятый','к. Уэлен, ш. Песчаное, д. 55 стр. 6, 638212','8 (593) 693-93-70'),
	('Семидесятый','клх Тутончаны, алл. Зеленая, д. 92, 382738','8 (947) 757-79-15'),
	('Семьдесять первый','с. Яшалта, бул. Достоевского, д. 67, 840426','8 (464) 245-2326'),
	('Семьдесять второй','с. Асино, бул. Васильковый, д. 8 к. 2, 083799','8 (233) 544-11-31'),
	('Семьдесять третий','д. Челябинск, ул. Овражная, д. 873 стр. 13, 101190','8 811 945 48 55'),
	('Семьдесять четвертый','д. Комсомольск-на-Амуре, ш. Набережное, д. 706 стр. 55, 869586','77347085754'),
	('Семьдесять пятый','д. Элиста, бул. Олимпийский, д. 7/6, 559632','8 809 207 8042'),
	('Семьдесять шестой','с. Ишим, ш. Панфилова, д. 3/9 стр. 2/7, 642741','84077122237'),
	('Семьдесять седьмой','д. Южноуральск, алл. Куйбышева, д. 31 к. 988, 369815','8 (341) 425-5045'),
	('Семьдесять восьмой','с. Кировск (Мурм.), пер. Социалистический, д. 642 стр. 63, 619236','8 (319) 544-08-91'),
	('Семьдесять девятый','с. Кежма, алл. Семашко, д. 4/1 к. 3, 667574','8 751 915 22 59'),
	('Восьмидесятый','п. Усмань, пер. Донской, д. 6/8 к. 3/1, 539366','8 078 147 02 97'),
	('Восемьдесять первый','к. Устюжна, алл. Пушкина, д. 964 к. 1, 885167','8 142 741 45 37'),
	('Восемьдесять второй','п. Саянск, наб. Азовская, д. 722 к. 3, 050541','74161853111'),
	('Восемьдесять третий','клх Адлер, бул. Лунный, д. 3 стр. 9, 258678','8 (437) 900-26-56'),
	('Восемьдесять четвертый','г. Орск, ш. Комарова, д. 347 к. 1/3, 327054','8 (556) 797-68-44'),
	('Восемьдесять пятый','п. Минеральные Воды, пер. Серова, д. 1, 429268','8 (178) 620-33-19'),
	('Восемьдесять шестой','ст. Бодайбо, алл. Смирнова, д. 385 стр. 1/3, 617835','8 (831) 301-62-51'),
	('Восемьдесять седьмой','г. Гаврилов-Ям, пер. Добролюбова, д. 765 стр. 58, 141689','8 502 517 6671'),
	('Восемьдесять восьмой','д. Муром, алл. Мостовая, д. 229, 616610','8 (743) 196-7423'),
	('Восемьдесять девятый','п. Находка, ш. Мелиоративное, д. 284, 055214','88702872346'),
	('Девяностый','г. Энгельс, бул. Нижний, д. 7, 243205','8 721 457 8401'),
	('Девяносто первый','клх Шатура, алл. Озерная, д. 2/7, 198376','8 (138) 737-08-15'),
	('Девяносто второй','п. Верхнее Пенжино, алл. Мусы Джалиля, д. 8 стр. 8, 321149','8 (434) 805-2201'),
	('Девяносто третий','д. Бреды, ш. Карла Маркса, д. 2/6, 289106','80660199398'),
	('Девяносто четвертый','г. Рыльск, наб. Сельская, д. 8/1, 640315','8 394 347 82 84'),
	('Девяносто пятый','с. Батайск, наб. Красных Партизан, д. 8/7, 686456','73351124961'),
	('Девяносто шестой','г. Волоколамск, пр. 50 лет ВЛКСМ, д. 603 к. 8/8, 423370','8 438 051 9422'),
	('Девяносто седьмой','к. Великий Устюг, пер. Зеленый, д. 580 к. 9/1, 975491','74038366289'),
	('Девяносто восьмой','с. Лянтор, ул. Высотная, д. 4 стр. 4/2, 886866','8 (386) 482-6965'),
	('Девяносто девятый','клх Нягань, ш. Каштановое, д. 2/1 к. 340, 267848','8 (231) 360-17-13'),
	('Сотый','д. Колпашево, бул. Семашко, д. 9 стр. 17, 885232','74133344590');



DO $$
DECLARE id_cinema_0 INT;
DECLARE id_cinema_1 INT;
DECLARE id_cinema_2 INT;
DECLARE id_cinema_3 INT;
DECLARE id_cinema_4 INT;
DECLARE id_cinema_5 INT;
DECLARE id_cinema_6 INT;
DECLARE id_cinema_7 INT;
DECLARE id_cinema_8 INT;
DECLARE id_cinema_9 INT;
DECLARE id_cinema_10 INT;
DECLARE id_cinema_11 INT;
DECLARE id_cinema_12 INT;
DECLARE id_cinema_13 INT;
DECLARE id_cinema_14 INT;
DECLARE id_cinema_15 INT;
DECLARE id_cinema_16 INT;
DECLARE id_cinema_17 INT;
DECLARE id_cinema_18 INT;
DECLARE id_cinema_19 INT;
DECLARE id_cinema_20 INT;
DECLARE id_cinema_21 INT;
DECLARE id_cinema_22 INT;
DECLARE id_cinema_23 INT;
DECLARE id_cinema_24 INT;
DECLARE id_cinema_25 INT;
DECLARE id_cinema_26 INT;
DECLARE id_cinema_27 INT;
DECLARE id_cinema_28 INT;
DECLARE id_cinema_29 INT;
DECLARE id_cinema_30 INT;
DECLARE id_cinema_31 INT;
DECLARE id_cinema_32 INT;
DECLARE id_cinema_33 INT;
DECLARE id_cinema_34 INT;
DECLARE id_cinema_35 INT;
DECLARE id_cinema_36 INT;
DECLARE id_cinema_37 INT;
DECLARE id_cinema_38 INT;
DECLARE id_cinema_39 INT;
DECLARE id_cinema_40 INT;
DECLARE id_cinema_41 INT;
DECLARE id_cinema_42 INT;
DECLARE id_cinema_43 INT;
DECLARE id_cinema_44 INT;
DECLARE id_cinema_45 INT;
DECLARE id_cinema_46 INT;
DECLARE id_cinema_47 INT;
DECLARE id_cinema_48 INT;
DECLARE id_cinema_49 INT;
DECLARE id_cinema_50 INT;
DECLARE id_cinema_51 INT;
DECLARE id_cinema_52 INT;
DECLARE id_cinema_53 INT;
DECLARE id_cinema_54 INT;
DECLARE id_cinema_55 INT;
DECLARE id_cinema_56 INT;
DECLARE id_cinema_57 INT;
DECLARE id_cinema_58 INT;
DECLARE id_cinema_59 INT;
DECLARE id_cinema_60 INT;
DECLARE id_cinema_61 INT;
DECLARE id_cinema_62 INT;
DECLARE id_cinema_63 INT;
DECLARE id_cinema_64 INT;
DECLARE id_cinema_65 INT;
DECLARE id_cinema_66 INT;
DECLARE id_cinema_67 INT;
DECLARE id_cinema_68 INT;
DECLARE id_cinema_69 INT;
DECLARE id_cinema_70 INT;
DECLARE id_cinema_71 INT;
DECLARE id_cinema_72 INT;
DECLARE id_cinema_73 INT;
DECLARE id_cinema_74 INT;
DECLARE id_cinema_75 INT;
DECLARE id_cinema_76 INT;
DECLARE id_cinema_77 INT;
DECLARE id_cinema_78 INT;
DECLARE id_cinema_79 INT;
DECLARE id_cinema_80 INT;
DECLARE id_cinema_81 INT;
DECLARE id_cinema_82 INT;
DECLARE id_cinema_83 INT;
DECLARE id_cinema_84 INT;
DECLARE id_cinema_85 INT;
DECLARE id_cinema_86 INT;
DECLARE id_cinema_87 INT;
DECLARE id_cinema_88 INT;
DECLARE id_cinema_89 INT;
DECLARE id_cinema_90 INT;
DECLARE id_cinema_91 INT;
DECLARE id_cinema_92 INT;
DECLARE id_cinema_93 INT;
DECLARE id_cinema_94 INT;
DECLARE id_cinema_95 INT;
DECLARE id_cinema_96 INT;
DECLARE id_cinema_97 INT;
DECLARE id_cinema_98 INT;
DECLARE id_cinema_99 INT;

BEGIN
	SELECT c.id INTO id_cinema_0
	FROM "public.Cinemas" c
	WHERE c.name = 'Первый';

	SELECT c.id INTO id_cinema_1
	FROM "public.Cinemas" c
	WHERE c.name = 'Второй';

	SELECT c.id INTO id_cinema_2
	FROM "public.Cinemas" c
	WHERE c.name = 'Третий';

	SELECT c.id INTO id_cinema_3
	FROM "public.Cinemas" c
	WHERE c.name = 'Четвертый';

	SELECT c.id INTO id_cinema_4
	FROM "public.Cinemas" c
	WHERE c.name = 'Пятый';

	SELECT c.id INTO id_cinema_5
	FROM "public.Cinemas" c
	WHERE c.name = 'Шестой';

	SELECT c.id INTO id_cinema_6
	FROM "public.Cinemas" c
	WHERE c.name = 'Седьмой';

	SELECT c.id INTO id_cinema_7
	FROM "public.Cinemas" c
	WHERE c.name = 'Восьмой';

	SELECT c.id INTO id_cinema_8
	FROM "public.Cinemas" c
	WHERE c.name = 'Девятый';

	SELECT c.id INTO id_cinema_9
	FROM "public.Cinemas" c
	WHERE c.name = 'Десятый';

	SELECT c.id INTO id_cinema_10
	FROM "public.Cinemas" c
	WHERE c.name = 'Одиннадцатый';

	SELECT c.id INTO id_cinema_11
	FROM "public.Cinemas" c
	WHERE c.name = 'Двенадцатый';

	SELECT c.id INTO id_cinema_12
	FROM "public.Cinemas" c
	WHERE c.name = 'Тринадцатый';

	SELECT c.id INTO id_cinema_13
	FROM "public.Cinemas" c
	WHERE c.name = 'Четырнадцатый';

	SELECT c.id INTO id_cinema_14
	FROM "public.Cinemas" c
	WHERE c.name = 'Пятнадцатый';

	SELECT c.id INTO id_cinema_15
	FROM "public.Cinemas" c
	WHERE c.name = 'Шестнадцатый';

	SELECT c.id INTO id_cinema_16
	FROM "public.Cinemas" c
	WHERE c.name = 'Семнадцатый';

	SELECT c.id INTO id_cinema_17
	FROM "public.Cinemas" c
	WHERE c.name = 'Восемнадцатый';

	SELECT c.id INTO id_cinema_18
	FROM "public.Cinemas" c
	WHERE c.name = 'Девятнадцатый';

	SELECT c.id INTO id_cinema_19
	FROM "public.Cinemas" c
	WHERE c.name = 'Двадцатый';

	SELECT c.id INTO id_cinema_20
	FROM "public.Cinemas" c
	WHERE c.name = 'Двадцать первый';

	SELECT c.id INTO id_cinema_21
	FROM "public.Cinemas" c
	WHERE c.name = 'Двадцать второй';

	SELECT c.id INTO id_cinema_22
	FROM "public.Cinemas" c
	WHERE c.name = 'Двадцать третий';

	SELECT c.id INTO id_cinema_23
	FROM "public.Cinemas" c
	WHERE c.name = 'Двадцать четвертый';

	SELECT c.id INTO id_cinema_24
	FROM "public.Cinemas" c
	WHERE c.name = 'Двадцать пятый';

	SELECT c.id INTO id_cinema_25
	FROM "public.Cinemas" c
	WHERE c.name = 'Двадцать шестой';

	SELECT c.id INTO id_cinema_26
	FROM "public.Cinemas" c
	WHERE c.name = 'Двадцать седьмой';

	SELECT c.id INTO id_cinema_27
	FROM "public.Cinemas" c
	WHERE c.name = 'Двадцать восьмой';

	SELECT c.id INTO id_cinema_28
	FROM "public.Cinemas" c
	WHERE c.name = 'Двадцать девятый';

	SELECT c.id INTO id_cinema_29
	FROM "public.Cinemas" c
	WHERE c.name = 'Тридцатый';

	SELECT c.id INTO id_cinema_30
	FROM "public.Cinemas" c
	WHERE c.name = 'Тридцать первый';

	SELECT c.id INTO id_cinema_31
	FROM "public.Cinemas" c
	WHERE c.name = 'Тридцать второй';

	SELECT c.id INTO id_cinema_32
	FROM "public.Cinemas" c
	WHERE c.name = 'Тридцать третий';

	SELECT c.id INTO id_cinema_33
	FROM "public.Cinemas" c
	WHERE c.name = 'Тридцать четвертый';

	SELECT c.id INTO id_cinema_34
	FROM "public.Cinemas" c
	WHERE c.name = 'Тридцать пятый';

	SELECT c.id INTO id_cinema_35
	FROM "public.Cinemas" c
	WHERE c.name = 'Тридцать шестой';

	SELECT c.id INTO id_cinema_36
	FROM "public.Cinemas" c
	WHERE c.name = 'Тридцать седьмой';

	SELECT c.id INTO id_cinema_37
	FROM "public.Cinemas" c
	WHERE c.name = 'Тридцать восьмой';

	SELECT c.id INTO id_cinema_38
	FROM "public.Cinemas" c
	WHERE c.name = 'Тридцать девятый';

	SELECT c.id INTO id_cinema_39
	FROM "public.Cinemas" c
	WHERE c.name = 'Сороковой';

	SELECT c.id INTO id_cinema_40
	FROM "public.Cinemas" c
	WHERE c.name = 'Сорок первый';

	SELECT c.id INTO id_cinema_41
	FROM "public.Cinemas" c
	WHERE c.name = 'Сорок второй';

	SELECT c.id INTO id_cinema_42
	FROM "public.Cinemas" c
	WHERE c.name = 'Сорок третий';

	SELECT c.id INTO id_cinema_43
	FROM "public.Cinemas" c
	WHERE c.name = 'Сорок четвертый';

	SELECT c.id INTO id_cinema_44
	FROM "public.Cinemas" c
	WHERE c.name = 'Сорок пятый';

	SELECT c.id INTO id_cinema_45
	FROM "public.Cinemas" c
	WHERE c.name = 'Сорок шестой';

	SELECT c.id INTO id_cinema_46
	FROM "public.Cinemas" c
	WHERE c.name = 'Сорок седьмой';

	SELECT c.id INTO id_cinema_47
	FROM "public.Cinemas" c
	WHERE c.name = 'Сорок восьмой';

	SELECT c.id INTO id_cinema_48
	FROM "public.Cinemas" c
	WHERE c.name = 'Сорок девятый';

	SELECT c.id INTO id_cinema_49
	FROM "public.Cinemas" c
	WHERE c.name = 'Пятидесятый';

	SELECT c.id INTO id_cinema_50
	FROM "public.Cinemas" c
	WHERE c.name = 'Пятьдесят первый';

	SELECT c.id INTO id_cinema_51
	FROM "public.Cinemas" c
	WHERE c.name = 'Пятьдесят второй';

	SELECT c.id INTO id_cinema_52
	FROM "public.Cinemas" c
	WHERE c.name = 'Пятьдесят третий';

	SELECT c.id INTO id_cinema_53
	FROM "public.Cinemas" c
	WHERE c.name = 'Пятьдесят четвертый';

	SELECT c.id INTO id_cinema_54
	FROM "public.Cinemas" c
	WHERE c.name = 'Пятьдесят пятый';

	SELECT c.id INTO id_cinema_55
	FROM "public.Cinemas" c
	WHERE c.name = 'Пятьдесят шестой';

	SELECT c.id INTO id_cinema_56
	FROM "public.Cinemas" c
	WHERE c.name = 'Пятьдесят седьмой';

	SELECT c.id INTO id_cinema_57
	FROM "public.Cinemas" c
	WHERE c.name = 'Пятьдесят восьмой';

	SELECT c.id INTO id_cinema_58
	FROM "public.Cinemas" c
	WHERE c.name = 'Пятьдесят девятый';

	SELECT c.id INTO id_cinema_59
	FROM "public.Cinemas" c
	WHERE c.name = 'Шестидесятый';

	SELECT c.id INTO id_cinema_60
	FROM "public.Cinemas" c
	WHERE c.name = 'Шестьдесят первый';

	SELECT c.id INTO id_cinema_61
	FROM "public.Cinemas" c
	WHERE c.name = 'Шестьдесят второй';

	SELECT c.id INTO id_cinema_62
	FROM "public.Cinemas" c
	WHERE c.name = 'Шестьдесят третий';

	SELECT c.id INTO id_cinema_63
	FROM "public.Cinemas" c
	WHERE c.name = 'Шестьдесят четвертый';

	SELECT c.id INTO id_cinema_64
	FROM "public.Cinemas" c
	WHERE c.name = 'Шестьдесят пятый';

	SELECT c.id INTO id_cinema_65
	FROM "public.Cinemas" c
	WHERE c.name = 'Шестьдесят шестой';

	SELECT c.id INTO id_cinema_66
	FROM "public.Cinemas" c
	WHERE c.name = 'Шестьдесят седьмой';

	SELECT c.id INTO id_cinema_67
	FROM "public.Cinemas" c
	WHERE c.name = 'Шестьдесят восьмой';

	SELECT c.id INTO id_cinema_68
	FROM "public.Cinemas" c
	WHERE c.name = 'Шестьдесят девятый';

	SELECT c.id INTO id_cinema_69
	FROM "public.Cinemas" c
	WHERE c.name = 'Семидесятый';

	SELECT c.id INTO id_cinema_70
	FROM "public.Cinemas" c
	WHERE c.name = 'Семьдесять первый';

	SELECT c.id INTO id_cinema_71
	FROM "public.Cinemas" c
	WHERE c.name = 'Семьдесять второй';

	SELECT c.id INTO id_cinema_72
	FROM "public.Cinemas" c
	WHERE c.name = 'Семьдесять третий';

	SELECT c.id INTO id_cinema_73
	FROM "public.Cinemas" c
	WHERE c.name = 'Семьдесять четвертый';

	SELECT c.id INTO id_cinema_74
	FROM "public.Cinemas" c
	WHERE c.name = 'Семьдесять пятый';

	SELECT c.id INTO id_cinema_75
	FROM "public.Cinemas" c
	WHERE c.name = 'Семьдесять шестой';

	SELECT c.id INTO id_cinema_76
	FROM "public.Cinemas" c
	WHERE c.name = 'Семьдесять седьмой';

	SELECT c.id INTO id_cinema_77
	FROM "public.Cinemas" c
	WHERE c.name = 'Семьдесять восьмой';

	SELECT c.id INTO id_cinema_78
	FROM "public.Cinemas" c
	WHERE c.name = 'Семьдесять девятый';

	SELECT c.id INTO id_cinema_79
	FROM "public.Cinemas" c
	WHERE c.name = 'Восьмидесятый';

	SELECT c.id INTO id_cinema_80
	FROM "public.Cinemas" c
	WHERE c.name = 'Восемьдесять первый';

	SELECT c.id INTO id_cinema_81
	FROM "public.Cinemas" c
	WHERE c.name = 'Восемьдесять второй';

	SELECT c.id INTO id_cinema_82
	FROM "public.Cinemas" c
	WHERE c.name = 'Восемьдесять третий';

	SELECT c.id INTO id_cinema_83
	FROM "public.Cinemas" c
	WHERE c.name = 'Восемьдесять четвертый';

	SELECT c.id INTO id_cinema_84
	FROM "public.Cinemas" c
	WHERE c.name = 'Восемьдесять пятый';

	SELECT c.id INTO id_cinema_85
	FROM "public.Cinemas" c
	WHERE c.name = 'Восемьдесять шестой';

	SELECT c.id INTO id_cinema_86
	FROM "public.Cinemas" c
	WHERE c.name = 'Восемьдесять седьмой';

	SELECT c.id INTO id_cinema_87
	FROM "public.Cinemas" c
	WHERE c.name = 'Восемьдесять восьмой';

	SELECT c.id INTO id_cinema_88
	FROM "public.Cinemas" c
	WHERE c.name = 'Восемьдесять девятый';

	SELECT c.id INTO id_cinema_89
	FROM "public.Cinemas" c
	WHERE c.name = 'Девяностый';

	SELECT c.id INTO id_cinema_90
	FROM "public.Cinemas" c
	WHERE c.name = 'Девяносто первый';

	SELECT c.id INTO id_cinema_91
	FROM "public.Cinemas" c
	WHERE c.name = 'Девяносто второй';

	SELECT c.id INTO id_cinema_92
	FROM "public.Cinemas" c
	WHERE c.name = 'Девяносто третий';

	SELECT c.id INTO id_cinema_93
	FROM "public.Cinemas" c
	WHERE c.name = 'Девяносто четвертый';

	SELECT c.id INTO id_cinema_94
	FROM "public.Cinemas" c
	WHERE c.name = 'Девяносто пятый';

	SELECT c.id INTO id_cinema_95
	FROM "public.Cinemas" c
	WHERE c.name = 'Девяносто шестой';

	SELECT c.id INTO id_cinema_96
	FROM "public.Cinemas" c
	WHERE c.name = 'Девяносто седьмой';

	SELECT c.id INTO id_cinema_97
	FROM "public.Cinemas" c
	WHERE c.name = 'Девяносто восьмой';

	SELECT c.id INTO id_cinema_98
	FROM "public.Cinemas" c
	WHERE c.name = 'Девяносто девятый';

	SELECT c.id INTO id_cinema_99
	FROM "public.Cinemas" c
	WHERE c.name = 'Сотый';

	INSERT INTO "public.Halls" (name, type, cinema_id) VALUES
		('Стандартный', 'Стандартный', id_cinema_0),
		('VIP', 'VIP', id_cinema_0),
		('Стандартный', 'Стандартный', id_cinema_1),
		('VIP', 'VIP', id_cinema_1),
		('Стандартный', 'Стандартный', id_cinema_2),
		('VIP', 'VIP', id_cinema_2),
		('Стандартный', 'Стандартный', id_cinema_3),
		('VIP', 'VIP', id_cinema_3),
		('Стандартный', 'Стандартный', id_cinema_4),
		('VIP', 'VIP', id_cinema_4),
		('Стандартный', 'Стандартный', id_cinema_5),
		('VIP', 'VIP', id_cinema_5),
		('Стандартный', 'Стандартный', id_cinema_6),
		('VIP', 'VIP', id_cinema_6),
		('Стандартный', 'Стандартный', id_cinema_7),
		('VIP', 'VIP', id_cinema_7),
		('Стандартный', 'Стандартный', id_cinema_8),
		('VIP', 'VIP', id_cinema_8),
		('Стандартный', 'Стандартный', id_cinema_9),
		('VIP', 'VIP', id_cinema_9),
		('Стандартный', 'Стандартный', id_cinema_10),
		('VIP', 'VIP', id_cinema_10),
		('Стандартный', 'Стандартный', id_cinema_11),
		('VIP', 'VIP', id_cinema_11),
		('Стандартный', 'Стандартный', id_cinema_12),
		('VIP', 'VIP', id_cinema_12),
		('Стандартный', 'Стандартный', id_cinema_13),
		('VIP', 'VIP', id_cinema_13),
		('Стандартный', 'Стандартный', id_cinema_14),
		('VIP', 'VIP', id_cinema_14),
		('Стандартный', 'Стандартный', id_cinema_15),
		('VIP', 'VIP', id_cinema_15),
		('Стандартный', 'Стандартный', id_cinema_16),
		('VIP', 'VIP', id_cinema_16),
		('Стандартный', 'Стандартный', id_cinema_17),
		('VIP', 'VIP', id_cinema_17),
		('Стандартный', 'Стандартный', id_cinema_18),
		('VIP', 'VIP', id_cinema_18),
		('Стандартный', 'Стандартный', id_cinema_19),
		('VIP', 'VIP', id_cinema_19),
		('Стандартный', 'Стандартный', id_cinema_20),
		('VIP', 'VIP', id_cinema_20),
		('Стандартный', 'Стандартный', id_cinema_21),
		('VIP', 'VIP', id_cinema_21),
		('Стандартный', 'Стандартный', id_cinema_22),
		('VIP', 'VIP', id_cinema_22),
		('Стандартный', 'Стандартный', id_cinema_23),
		('VIP', 'VIP', id_cinema_23),
		('Стандартный', 'Стандартный', id_cinema_24),
		('VIP', 'VIP', id_cinema_24),
		('Стандартный', 'Стандартный', id_cinema_25),
		('VIP', 'VIP', id_cinema_25),
		('Стандартный', 'Стандартный', id_cinema_26),
		('VIP', 'VIP', id_cinema_26),
		('Стандартный', 'Стандартный', id_cinema_27),
		('VIP', 'VIP', id_cinema_27),
		('Стандартный', 'Стандартный', id_cinema_28),
		('VIP', 'VIP', id_cinema_28),
		('Стандартный', 'Стандартный', id_cinema_29),
		('VIP', 'VIP', id_cinema_29),
		('Стандартный', 'Стандартный', id_cinema_30),
		('VIP', 'VIP', id_cinema_30),
		('Стандартный', 'Стандартный', id_cinema_31),
		('VIP', 'VIP', id_cinema_31),
		('Стандартный', 'Стандартный', id_cinema_32),
		('VIP', 'VIP', id_cinema_32),
		('Стандартный', 'Стандартный', id_cinema_33),
		('VIP', 'VIP', id_cinema_33),
		('Стандартный', 'Стандартный', id_cinema_34),
		('VIP', 'VIP', id_cinema_34),
		('Стандартный', 'Стандартный', id_cinema_35),
		('VIP', 'VIP', id_cinema_35),
		('Стандартный', 'Стандартный', id_cinema_36),
		('VIP', 'VIP', id_cinema_36),
		('Стандартный', 'Стандартный', id_cinema_37),
		('VIP', 'VIP', id_cinema_37),
		('Стандартный', 'Стандартный', id_cinema_38),
		('VIP', 'VIP', id_cinema_38),
		('Стандартный', 'Стандартный', id_cinema_39),
		('VIP', 'VIP', id_cinema_39),
		('Стандартный', 'Стандартный', id_cinema_40),
		('VIP', 'VIP', id_cinema_40),
		('Стандартный', 'Стандартный', id_cinema_41),
		('VIP', 'VIP', id_cinema_41),
		('Стандартный', 'Стандартный', id_cinema_42),
		('VIP', 'VIP', id_cinema_42),
		('Стандартный', 'Стандартный', id_cinema_43),
		('VIP', 'VIP', id_cinema_43),
		('Стандартный', 'Стандартный', id_cinema_44),
		('VIP', 'VIP', id_cinema_44),
		('Стандартный', 'Стандартный', id_cinema_45),
		('VIP', 'VIP', id_cinema_45),
		('Стандартный', 'Стандартный', id_cinema_46),
		('VIP', 'VIP', id_cinema_46),
		('Стандартный', 'Стандартный', id_cinema_47),
		('VIP', 'VIP', id_cinema_47),
		('Стандартный', 'Стандартный', id_cinema_48),
		('VIP', 'VIP', id_cinema_48),
		('Стандартный', 'Стандартный', id_cinema_49),
		('VIP', 'VIP', id_cinema_49),
		('Стандартный', 'Стандартный', id_cinema_50),
		('VIP', 'VIP', id_cinema_50),
		('Стандартный', 'Стандартный', id_cinema_51),
		('VIP', 'VIP', id_cinema_51),
		('Стандартный', 'Стандартный', id_cinema_52),
		('VIP', 'VIP', id_cinema_52),
		('Стандартный', 'Стандартный', id_cinema_53),
		('VIP', 'VIP', id_cinema_53),
		('Стандартный', 'Стандартный', id_cinema_54),
		('VIP', 'VIP', id_cinema_54),
		('Стандартный', 'Стандартный', id_cinema_55),
		('VIP', 'VIP', id_cinema_55),
		('Стандартный', 'Стандартный', id_cinema_56),
		('VIP', 'VIP', id_cinema_56),
		('Стандартный', 'Стандартный', id_cinema_57),
		('VIP', 'VIP', id_cinema_57),
		('Стандартный', 'Стандартный', id_cinema_58),
		('VIP', 'VIP', id_cinema_58),
		('Стандартный', 'Стандартный', id_cinema_59),
		('VIP', 'VIP', id_cinema_59),
		('Стандартный', 'Стандартный', id_cinema_60),
		('VIP', 'VIP', id_cinema_60),
		('Стандартный', 'Стандартный', id_cinema_61),
		('VIP', 'VIP', id_cinema_61),
		('Стандартный', 'Стандартный', id_cinema_62),
		('VIP', 'VIP', id_cinema_62),
		('Стандартный', 'Стандартный', id_cinema_63),
		('VIP', 'VIP', id_cinema_63),
		('Стандартный', 'Стандартный', id_cinema_64),
		('VIP', 'VIP', id_cinema_64),
		('Стандартный', 'Стандартный', id_cinema_65),
		('VIP', 'VIP', id_cinema_65),
		('Стандартный', 'Стандартный', id_cinema_66),
		('VIP', 'VIP', id_cinema_66),
		('Стандартный', 'Стандартный', id_cinema_67),
		('VIP', 'VIP', id_cinema_67),
		('Стандартный', 'Стандартный', id_cinema_68),
		('VIP', 'VIP', id_cinema_68),
		('Стандартный', 'Стандартный', id_cinema_69),
		('VIP', 'VIP', id_cinema_69),
		('Стандартный', 'Стандартный', id_cinema_70),
		('VIP', 'VIP', id_cinema_70),
		('Стандартный', 'Стандартный', id_cinema_71),
		('VIP', 'VIP', id_cinema_71),
		('Стандартный', 'Стандартный', id_cinema_72),
		('VIP', 'VIP', id_cinema_72),
		('Стандартный', 'Стандартный', id_cinema_73),
		('VIP', 'VIP', id_cinema_73),
		('Стандартный', 'Стандартный', id_cinema_74),
		('VIP', 'VIP', id_cinema_74),
		('Стандартный', 'Стандартный', id_cinema_75),
		('VIP', 'VIP', id_cinema_75),
		('Стандартный', 'Стандартный', id_cinema_76),
		('VIP', 'VIP', id_cinema_76),
		('Стандартный', 'Стандартный', id_cinema_77),
		('VIP', 'VIP', id_cinema_77),
		('Стандартный', 'Стандартный', id_cinema_78),
		('VIP', 'VIP', id_cinema_78),
		('Стандартный', 'Стандартный', id_cinema_79),
		('VIP', 'VIP', id_cinema_79),
		('Стандартный', 'Стандартный', id_cinema_80),
		('VIP', 'VIP', id_cinema_80),
		('Стандартный', 'Стандартный', id_cinema_81),
		('VIP', 'VIP', id_cinema_81),
		('Стандартный', 'Стандартный', id_cinema_82),
		('VIP', 'VIP', id_cinema_82),
		('Стандартный', 'Стандартный', id_cinema_83),
		('VIP', 'VIP', id_cinema_83),
		('Стандартный', 'Стандартный', id_cinema_84),
		('VIP', 'VIP', id_cinema_84),
		('Стандартный', 'Стандартный', id_cinema_85),
		('VIP', 'VIP', id_cinema_85),
		('Стандартный', 'Стандартный', id_cinema_86),
		('VIP', 'VIP', id_cinema_86),
		('Стандартный', 'Стандартный', id_cinema_87),
		('VIP', 'VIP', id_cinema_87),
		('Стандартный', 'Стандартный', id_cinema_88),
		('VIP', 'VIP', id_cinema_88),
		('Стандартный', 'Стандартный', id_cinema_89),
		('VIP', 'VIP', id_cinema_89),
		('Стандартный', 'Стандартный', id_cinema_90),
		('VIP', 'VIP', id_cinema_90),
		('Стандартный', 'Стандартный', id_cinema_91),
		('VIP', 'VIP', id_cinema_91),
		('Стандартный', 'Стандартный', id_cinema_92),
		('VIP', 'VIP', id_cinema_92),
		('Стандартный', 'Стандартный', id_cinema_93),
		('VIP', 'VIP', id_cinema_93),
		('Стандартный', 'Стандартный', id_cinema_94),
		('VIP', 'VIP', id_cinema_94),
		('Стандартный', 'Стандартный', id_cinema_95),
		('VIP', 'VIP', id_cinema_95),
		('Стандартный', 'Стандартный', id_cinema_96),
		('VIP', 'VIP', id_cinema_96),
		('Стандартный', 'Стандартный', id_cinema_97),
		('VIP', 'VIP', id_cinema_97),
		('Стандартный', 'Стандартный', id_cinema_98),
		('VIP', 'VIP', id_cinema_98),
		('Стандартный', 'Стандартный', id_cinema_99),
		('VIP', 'VIP', id_cinema_99);
END $$;



DO $$
DECLARE id_hall_0 INT;
DECLARE id_hall_1 INT;
DECLARE id_hall_2 INT;
DECLARE id_hall_3 INT;
DECLARE id_hall_4 INT;
DECLARE id_hall_5 INT;
DECLARE id_hall_6 INT;
DECLARE id_hall_7 INT;
DECLARE id_hall_8 INT;
DECLARE id_hall_9 INT;
DECLARE id_hall_10 INT;
DECLARE id_hall_11 INT;
DECLARE id_hall_12 INT;
DECLARE id_hall_13 INT;
DECLARE id_hall_14 INT;
DECLARE id_hall_15 INT;
DECLARE id_hall_16 INT;
DECLARE id_hall_17 INT;
DECLARE id_hall_18 INT;
DECLARE id_hall_19 INT;
DECLARE id_hall_20 INT;
DECLARE id_hall_21 INT;
DECLARE id_hall_22 INT;
DECLARE id_hall_23 INT;
DECLARE id_hall_24 INT;
DECLARE id_hall_25 INT;
DECLARE id_hall_26 INT;
DECLARE id_hall_27 INT;
DECLARE id_hall_28 INT;
DECLARE id_hall_29 INT;
DECLARE id_hall_30 INT;
DECLARE id_hall_31 INT;
DECLARE id_hall_32 INT;
DECLARE id_hall_33 INT;
DECLARE id_hall_34 INT;
DECLARE id_hall_35 INT;
DECLARE id_hall_36 INT;
DECLARE id_hall_37 INT;
DECLARE id_hall_38 INT;
DECLARE id_hall_39 INT;
DECLARE id_hall_40 INT;
DECLARE id_hall_41 INT;
DECLARE id_hall_42 INT;
DECLARE id_hall_43 INT;
DECLARE id_hall_44 INT;
DECLARE id_hall_45 INT;
DECLARE id_hall_46 INT;
DECLARE id_hall_47 INT;
DECLARE id_hall_48 INT;
DECLARE id_hall_49 INT;
DECLARE id_hall_50 INT;
DECLARE id_hall_51 INT;
DECLARE id_hall_52 INT;
DECLARE id_hall_53 INT;
DECLARE id_hall_54 INT;
DECLARE id_hall_55 INT;
DECLARE id_hall_56 INT;
DECLARE id_hall_57 INT;
DECLARE id_hall_58 INT;
DECLARE id_hall_59 INT;
DECLARE id_hall_60 INT;
DECLARE id_hall_61 INT;
DECLARE id_hall_62 INT;
DECLARE id_hall_63 INT;
DECLARE id_hall_64 INT;
DECLARE id_hall_65 INT;
DECLARE id_hall_66 INT;
DECLARE id_hall_67 INT;
DECLARE id_hall_68 INT;
DECLARE id_hall_69 INT;
DECLARE id_hall_70 INT;
DECLARE id_hall_71 INT;
DECLARE id_hall_72 INT;
DECLARE id_hall_73 INT;
DECLARE id_hall_74 INT;
DECLARE id_hall_75 INT;
DECLARE id_hall_76 INT;
DECLARE id_hall_77 INT;
DECLARE id_hall_78 INT;
DECLARE id_hall_79 INT;
DECLARE id_hall_80 INT;
DECLARE id_hall_81 INT;
DECLARE id_hall_82 INT;
DECLARE id_hall_83 INT;
DECLARE id_hall_84 INT;
DECLARE id_hall_85 INT;
DECLARE id_hall_86 INT;
DECLARE id_hall_87 INT;
DECLARE id_hall_88 INT;
DECLARE id_hall_89 INT;
DECLARE id_hall_90 INT;
DECLARE id_hall_91 INT;
DECLARE id_hall_92 INT;
DECLARE id_hall_93 INT;
DECLARE id_hall_94 INT;
DECLARE id_hall_95 INT;
DECLARE id_hall_96 INT;
DECLARE id_hall_97 INT;
DECLARE id_hall_98 INT;
DECLARE id_hall_99 INT;
DECLARE id_hall_100 INT;
DECLARE id_hall_101 INT;
DECLARE id_hall_102 INT;
DECLARE id_hall_103 INT;
DECLARE id_hall_104 INT;
DECLARE id_hall_105 INT;
DECLARE id_hall_106 INT;
DECLARE id_hall_107 INT;
DECLARE id_hall_108 INT;
DECLARE id_hall_109 INT;
DECLARE id_hall_110 INT;
DECLARE id_hall_111 INT;
DECLARE id_hall_112 INT;
DECLARE id_hall_113 INT;
DECLARE id_hall_114 INT;
DECLARE id_hall_115 INT;
DECLARE id_hall_116 INT;
DECLARE id_hall_117 INT;
DECLARE id_hall_118 INT;
DECLARE id_hall_119 INT;
DECLARE id_hall_120 INT;
DECLARE id_hall_121 INT;
DECLARE id_hall_122 INT;
DECLARE id_hall_123 INT;
DECLARE id_hall_124 INT;
DECLARE id_hall_125 INT;
DECLARE id_hall_126 INT;
DECLARE id_hall_127 INT;
DECLARE id_hall_128 INT;
DECLARE id_hall_129 INT;
DECLARE id_hall_130 INT;
DECLARE id_hall_131 INT;
DECLARE id_hall_132 INT;
DECLARE id_hall_133 INT;
DECLARE id_hall_134 INT;
DECLARE id_hall_135 INT;
DECLARE id_hall_136 INT;
DECLARE id_hall_137 INT;
DECLARE id_hall_138 INT;
DECLARE id_hall_139 INT;
DECLARE id_hall_140 INT;
DECLARE id_hall_141 INT;
DECLARE id_hall_142 INT;
DECLARE id_hall_143 INT;
DECLARE id_hall_144 INT;
DECLARE id_hall_145 INT;
DECLARE id_hall_146 INT;
DECLARE id_hall_147 INT;
DECLARE id_hall_148 INT;
DECLARE id_hall_149 INT;
DECLARE id_hall_150 INT;
DECLARE id_hall_151 INT;
DECLARE id_hall_152 INT;
DECLARE id_hall_153 INT;
DECLARE id_hall_154 INT;
DECLARE id_hall_155 INT;
DECLARE id_hall_156 INT;
DECLARE id_hall_157 INT;
DECLARE id_hall_158 INT;
DECLARE id_hall_159 INT;
DECLARE id_hall_160 INT;
DECLARE id_hall_161 INT;
DECLARE id_hall_162 INT;
DECLARE id_hall_163 INT;
DECLARE id_hall_164 INT;
DECLARE id_hall_165 INT;
DECLARE id_hall_166 INT;
DECLARE id_hall_167 INT;
DECLARE id_hall_168 INT;
DECLARE id_hall_169 INT;
DECLARE id_hall_170 INT;
DECLARE id_hall_171 INT;
DECLARE id_hall_172 INT;
DECLARE id_hall_173 INT;
DECLARE id_hall_174 INT;
DECLARE id_hall_175 INT;
DECLARE id_hall_176 INT;
DECLARE id_hall_177 INT;
DECLARE id_hall_178 INT;
DECLARE id_hall_179 INT;
DECLARE id_hall_180 INT;
DECLARE id_hall_181 INT;
DECLARE id_hall_182 INT;
DECLARE id_hall_183 INT;
DECLARE id_hall_184 INT;
DECLARE id_hall_185 INT;
DECLARE id_hall_186 INT;
DECLARE id_hall_187 INT;
DECLARE id_hall_188 INT;
DECLARE id_hall_189 INT;
DECLARE id_hall_190 INT;
DECLARE id_hall_191 INT;
DECLARE id_hall_192 INT;
DECLARE id_hall_193 INT;
DECLARE id_hall_194 INT;
DECLARE id_hall_195 INT;
DECLARE id_hall_196 INT;
DECLARE id_hall_197 INT;
DECLARE id_hall_198 INT;
DECLARE id_hall_199 INT;
DECLARE id_movie_0 INT;
DECLARE id_movie_1 INT;
DECLARE id_movie_2 INT;
DECLARE id_movie_3 INT;
DECLARE id_movie_4 INT;
DECLARE id_movie_5 INT;
DECLARE id_movie_6 INT;
DECLARE id_movie_7 INT;
DECLARE id_movie_8 INT;
DECLARE id_movie_9 INT;
DECLARE id_movie_10 INT;
DECLARE id_movie_11 INT;
DECLARE id_movie_12 INT;
DECLARE id_movie_13 INT;
DECLARE id_movie_14 INT;
DECLARE id_movie_15 INT;
DECLARE id_movie_16 INT;
DECLARE id_movie_17 INT;
DECLARE id_movie_18 INT;
DECLARE id_movie_19 INT;
DECLARE id_movie_20 INT;
DECLARE id_movie_21 INT;
DECLARE id_movie_22 INT;
DECLARE id_movie_23 INT;
DECLARE id_movie_24 INT;
DECLARE id_movie_25 INT;
DECLARE id_movie_26 INT;
DECLARE id_movie_27 INT;
DECLARE id_movie_28 INT;
DECLARE id_movie_29 INT;
DECLARE id_movie_30 INT;
DECLARE id_movie_31 INT;
DECLARE id_movie_32 INT;
DECLARE id_movie_33 INT;
DECLARE id_movie_34 INT;
DECLARE id_movie_35 INT;
DECLARE id_movie_36 INT;
DECLARE id_movie_37 INT;
DECLARE id_movie_38 INT;
DECLARE id_movie_39 INT;
DECLARE id_movie_40 INT;
DECLARE id_movie_41 INT;
DECLARE id_movie_42 INT;
DECLARE id_movie_43 INT;
DECLARE id_movie_44 INT;
DECLARE id_movie_45 INT;
DECLARE id_movie_46 INT;
DECLARE id_movie_47 INT;
DECLARE id_movie_48 INT;
DECLARE id_movie_49 INT;
DECLARE id_movie_50 INT;
DECLARE id_movie_51 INT;
DECLARE id_movie_52 INT;
DECLARE id_movie_53 INT;
DECLARE id_movie_54 INT;
DECLARE id_movie_55 INT;
DECLARE id_movie_56 INT;
DECLARE id_movie_57 INT;
DECLARE id_movie_58 INT;
DECLARE id_movie_59 INT;
DECLARE id_movie_60 INT;
DECLARE id_movie_61 INT;
DECLARE id_movie_62 INT;
DECLARE id_movie_63 INT;
DECLARE id_movie_64 INT;
DECLARE id_movie_65 INT;
DECLARE id_movie_66 INT;
DECLARE id_movie_67 INT;
DECLARE id_movie_68 INT;
DECLARE id_movie_69 INT;
DECLARE id_movie_70 INT;
DECLARE id_movie_71 INT;
DECLARE id_movie_72 INT;
DECLARE id_movie_73 INT;
DECLARE id_movie_74 INT;
DECLARE id_movie_75 INT;
DECLARE id_movie_76 INT;
DECLARE id_movie_77 INT;
DECLARE id_movie_78 INT;
DECLARE id_movie_79 INT;
DECLARE id_movie_80 INT;
DECLARE id_movie_81 INT;
DECLARE id_movie_82 INT;
DECLARE id_movie_83 INT;
DECLARE id_movie_84 INT;
DECLARE id_movie_85 INT;
DECLARE id_movie_86 INT;
DECLARE id_movie_87 INT;
DECLARE id_movie_88 INT;
DECLARE id_movie_89 INT;
DECLARE id_movie_90 INT;
DECLARE id_movie_91 INT;
DECLARE id_movie_92 INT;
DECLARE id_movie_93 INT;
DECLARE id_movie_94 INT;
DECLARE id_movie_95 INT;
DECLARE id_movie_96 INT;
DECLARE id_movie_97 INT;
DECLARE id_movie_98 INT;
DECLARE id_movie_99 INT;
DECLARE id_movie_100 INT;
DECLARE id_movie_101 INT;
DECLARE id_movie_102 INT;
DECLARE id_movie_103 INT;
DECLARE id_movie_104 INT;
DECLARE id_movie_105 INT;
DECLARE id_movie_106 INT;
DECLARE id_movie_107 INT;
DECLARE id_movie_108 INT;
DECLARE id_movie_109 INT;

BEGIN
	SELECT h.id INTO id_hall_0
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Первый' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_1
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Первый' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_2
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Второй' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_3
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Второй' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_4
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Третий' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_5
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Третий' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_6
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Четвертый' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_7
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Четвертый' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_8
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Пятый' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_9
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Пятый' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_10
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Шестой' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_11
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Шестой' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_12
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Седьмой' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_13
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Седьмой' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_14
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Восьмой' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_15
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Восьмой' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_16
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Девятый' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_17
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Девятый' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_18
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Десятый' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_19
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Десятый' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_20
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Одиннадцатый' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_21
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Одиннадцатый' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_22
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Двенадцатый' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_23
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Двенадцатый' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_24
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Тринадцатый' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_25
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Тринадцатый' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_26
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Четырнадцатый' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_27
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Четырнадцатый' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_28
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Пятнадцатый' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_29
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Пятнадцатый' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_30
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Шестнадцатый' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_31
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Шестнадцатый' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_32
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Семнадцатый' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_33
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Семнадцатый' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_34
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Восемнадцатый' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_35
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Восемнадцатый' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_36
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Девятнадцатый' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_37
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Девятнадцатый' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_38
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Двадцатый' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_39
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Двадцатый' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_40
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Двадцать первый' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_41
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Двадцать первый' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_42
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Двадцать второй' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_43
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Двадцать второй' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_44
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Двадцать третий' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_45
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Двадцать третий' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_46
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Двадцать четвертый' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_47
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Двадцать четвертый' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_48
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Двадцать пятый' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_49
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Двадцать пятый' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_50
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Двадцать шестой' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_51
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Двадцать шестой' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_52
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Двадцать седьмой' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_53
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Двадцать седьмой' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_54
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Двадцать восьмой' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_55
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Двадцать восьмой' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_56
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Двадцать девятый' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_57
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Двадцать девятый' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_58
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Тридцатый' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_59
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Тридцатый' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_60
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Тридцать первый' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_61
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Тридцать первый' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_62
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Тридцать второй' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_63
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Тридцать второй' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_64
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Тридцать третий' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_65
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Тридцать третий' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_66
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Тридцать четвертый' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_67
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Тридцать четвертый' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_68
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Тридцать пятый' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_69
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Тридцать пятый' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_70
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Тридцать шестой' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_71
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Тридцать шестой' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_72
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Тридцать седьмой' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_73
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Тридцать седьмой' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_74
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Тридцать восьмой' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_75
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Тридцать восьмой' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_76
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Тридцать девятый' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_77
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Тридцать девятый' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_78
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Сороковой' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_79
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Сороковой' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_80
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Сорок первый' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_81
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Сорок первый' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_82
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Сорок второй' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_83
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Сорок второй' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_84
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Сорок третий' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_85
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Сорок третий' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_86
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Сорок четвертый' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_87
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Сорок четвертый' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_88
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Сорок пятый' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_89
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Сорок пятый' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_90
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Сорок шестой' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_91
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Сорок шестой' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_92
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Сорок седьмой' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_93
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Сорок седьмой' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_94
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Сорок восьмой' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_95
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Сорок восьмой' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_96
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Сорок девятый' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_97
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Сорок девятый' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_98
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Пятидесятый' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_99
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Пятидесятый' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_100
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Пятьдесят первый' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_101
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Пятьдесят первый' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_102
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Пятьдесят второй' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_103
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Пятьдесят второй' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_104
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Пятьдесят третий' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_105
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Пятьдесят третий' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_106
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Пятьдесят четвертый' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_107
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Пятьдесят четвертый' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_108
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Пятьдесят пятый' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_109
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Пятьдесят пятый' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_110
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Пятьдесят шестой' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_111
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Пятьдесят шестой' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_112
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Пятьдесят седьмой' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_113
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Пятьдесят седьмой' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_114
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Пятьдесят восьмой' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_115
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Пятьдесят восьмой' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_116
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Пятьдесят девятый' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_117
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Пятьдесят девятый' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_118
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Шестидесятый' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_119
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Шестидесятый' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_120
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Шестьдесят первый' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_121
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Шестьдесят первый' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_122
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Шестьдесят второй' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_123
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Шестьдесят второй' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_124
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Шестьдесят третий' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_125
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Шестьдесят третий' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_126
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Шестьдесят четвертый' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_127
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Шестьдесят четвертый' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_128
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Шестьдесят пятый' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_129
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Шестьдесят пятый' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_130
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Шестьдесят шестой' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_131
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Шестьдесят шестой' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_132
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Шестьдесят седьмой' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_133
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Шестьдесят седьмой' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_134
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Шестьдесят восьмой' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_135
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Шестьдесят восьмой' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_136
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Шестьдесят девятый' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_137
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Шестьдесят девятый' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_138
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Семидесятый' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_139
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Семидесятый' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_140
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Семьдесять первый' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_141
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Семьдесять первый' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_142
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Семьдесять второй' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_143
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Семьдесять второй' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_144
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Семьдесять третий' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_145
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Семьдесять третий' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_146
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Семьдесять четвертый' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_147
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Семьдесять четвертый' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_148
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Семьдесять пятый' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_149
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Семьдесять пятый' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_150
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Семьдесять шестой' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_151
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Семьдесять шестой' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_152
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Семьдесять седьмой' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_153
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Семьдесять седьмой' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_154
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Семьдесять восьмой' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_155
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Семьдесять восьмой' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_156
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Семьдесять девятый' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_157
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Семьдесять девятый' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_158
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Восьмидесятый' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_159
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Восьмидесятый' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_160
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Восемьдесять первый' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_161
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Восемьдесять первый' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_162
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Восемьдесять второй' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_163
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Восемьдесять второй' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_164
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Восемьдесять третий' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_165
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Восемьдесять третий' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_166
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Восемьдесять четвертый' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_167
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Восемьдесять четвертый' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_168
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Восемьдесять пятый' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_169
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Восемьдесять пятый' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_170
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Восемьдесять шестой' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_171
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Восемьдесять шестой' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_172
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Восемьдесять седьмой' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_173
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Восемьдесять седьмой' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_174
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Восемьдесять восьмой' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_175
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Восемьдесять восьмой' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_176
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Восемьдесять девятый' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_177
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Восемьдесять девятый' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_178
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Девяностый' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_179
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Девяностый' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_180
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Девяносто первый' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_181
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Девяносто первый' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_182
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Девяносто второй' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_183
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Девяносто второй' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_184
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Девяносто третий' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_185
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Девяносто третий' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_186
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Девяносто четвертый' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_187
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Девяносто четвертый' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_188
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Девяносто пятый' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_189
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Девяносто пятый' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_190
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Девяносто шестой' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_191
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Девяносто шестой' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_192
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Девяносто седьмой' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_193
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Девяносто седьмой' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_194
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Девяносто восьмой' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_195
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Девяносто восьмой' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_196
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Девяносто девятый' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_197
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Девяносто девятый' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_198
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Сотый' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_199
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Сотый' AND h.name = 'VIP';

	SELECT m.id INTO id_movie_0
	FROM "public.Movies" m
	WHERE m.name = 'Сила страны';

	SELECT m.id INTO id_movie_1
	FROM "public.Movies" m
	WHERE m.name = 'Причина кожи';

	SELECT m.id INTO id_movie_2
	FROM "public.Movies" m
	WHERE m.name = 'Одно целое раскрытие';

	SELECT m.id INTO id_movie_3
	FROM "public.Movies" m
	WHERE m.name = 'Требовать';

	SELECT m.id INTO id_movie_4
	FROM "public.Movies" m
	WHERE m.name = 'Помнить';

	SELECT m.id INTO id_movie_5
	FROM "public.Movies" m
	WHERE m.name = 'Мог распознать';

	SELECT m.id INTO id_movie_6
	FROM "public.Movies" m
	WHERE m.name = 'Конец';

	SELECT m.id INTO id_movie_7
	FROM "public.Movies" m
	WHERE m.name = 'Разница';

	SELECT m.id INTO id_movie_8
	FROM "public.Movies" m
	WHERE m.name = 'Теперь даже';

	SELECT m.id INTO id_movie_9
	FROM "public.Movies" m
	WHERE m.name = 'Сохранить пропуск';

	SELECT m.id INTO id_movie_10
	FROM "public.Movies" m
	WHERE m.name = 'Вещи';

	SELECT m.id INTO id_movie_11
	FROM "public.Movies" m
	WHERE m.name = 'Нация его поперек';

	SELECT m.id INTO id_movie_12
	FROM "public.Movies" m
	WHERE m.name = 'Энергия';

	SELECT m.id INTO id_movie_13
	FROM "public.Movies" m
	WHERE m.name = 'Существующее решение';

	SELECT m.id INTO id_movie_14
	FROM "public.Movies" m
	WHERE m.name = 'До';

	SELECT m.id INTO id_movie_15
	FROM "public.Movies" m
	WHERE m.name = 'Муж';

	SELECT m.id INTO id_movie_16
	FROM "public.Movies" m
	WHERE m.name = 'Достигать';

	SELECT m.id INTO id_movie_17
	FROM "public.Movies" m
	WHERE m.name = 'Колледжский мяч.';

	SELECT m.id INTO id_movie_18
	FROM "public.Movies" m
	WHERE m.name = 'Фонд мира';

	SELECT m.id INTO id_movie_19
	FROM "public.Movies" m
	WHERE m.name = 'Последний официальный точно';

	SELECT m.id INTO id_movie_20
	FROM "public.Movies" m
	WHERE m.name = 'Дом';

	SELECT m.id INTO id_movie_21
	FROM "public.Movies" m
	WHERE m.name = 'Школа разумного возраста';

	SELECT m.id INTO id_movie_22
	FROM "public.Movies" m
	WHERE m.name = 'Вода';

	SELECT m.id INTO id_movie_23
	FROM "public.Movies" m
	WHERE m.name = 'Обращаться';

	SELECT m.id INTO id_movie_24
	FROM "public.Movies" m
	WHERE m.name = 'Современные другие учат';

	SELECT m.id INTO id_movie_25
	FROM "public.Movies" m
	WHERE m.name = 'Красивый подъем';

	SELECT m.id INTO id_movie_26
	FROM "public.Movies" m
	WHERE m.name = 'Позже';

	SELECT m.id INTO id_movie_27
	FROM "public.Movies" m
	WHERE m.name = 'Знак суммы момента';

	SELECT m.id INTO id_movie_28
	FROM "public.Movies" m
	WHERE m.name = 'Готовый';

	SELECT m.id INTO id_movie_29
	FROM "public.Movies" m
	WHERE m.name = 'Простая кампания';

	SELECT m.id INTO id_movie_30
	FROM "public.Movies" m
	WHERE m.name = 'Почувствуйте, опишите производство';

	SELECT m.id INTO id_movie_31
	FROM "public.Movies" m
	WHERE m.name = 'Усилие определенного ветра';

	SELECT m.id INTO id_movie_32
	FROM "public.Movies" m
	WHERE m.name = 'Характер';

	SELECT m.id INTO id_movie_33
	FROM "public.Movies" m
	WHERE m.name = 'Вытащите студента';

	SELECT m.id INTO id_movie_34
	FROM "public.Movies" m
	WHERE m.name = 'Медицинское сообщество';

	SELECT m.id INTO id_movie_35
	FROM "public.Movies" m
	WHERE m.name = 'Особо светлый';

	SELECT m.id INTO id_movie_36
	FROM "public.Movies" m
	WHERE m.name = 'Все вылезает наружу';

	SELECT m.id INTO id_movie_37
	FROM "public.Movies" m
	WHERE m.name = 'Вести';

	SELECT m.id INTO id_movie_38
	FROM "public.Movies" m
	WHERE m.name = 'Чувство атаки читать';

	SELECT m.id INTO id_movie_39
	FROM "public.Movies" m
	WHERE m.name = 'К';

	SELECT m.id INTO id_movie_40
	FROM "public.Movies" m
	WHERE m.name = 'Каждому достаточно, как';

	SELECT m.id INTO id_movie_41
	FROM "public.Movies" m
	WHERE m.name = 'Север';

	SELECT m.id INTO id_movie_42
	FROM "public.Movies" m
	WHERE m.name = 'Никогда';

	SELECT m.id INTO id_movie_43
	FROM "public.Movies" m
	WHERE m.name = 'Если страдать';

	SELECT m.id INTO id_movie_44
	FROM "public.Movies" m
	WHERE m.name = 'Позволять';

	SELECT m.id INTO id_movie_45
	FROM "public.Movies" m
	WHERE m.name = 'Семья';

	SELECT m.id INTO id_movie_46
	FROM "public.Movies" m
	WHERE m.name = 'Определить, определить вид';

	SELECT m.id INTO id_movie_47
	FROM "public.Movies" m
	WHERE m.name = 'Авторитетное присоединение';

	SELECT m.id INTO id_movie_48
	FROM "public.Movies" m
	WHERE m.name = 'Явный рост производства';

	SELECT m.id INTO id_movie_49
	FROM "public.Movies" m
	WHERE m.name = 'Вскоре компьютер и';

	SELECT m.id INTO id_movie_50
	FROM "public.Movies" m
	WHERE m.name = 'Цена двух попыток';

	SELECT m.id INTO id_movie_51
	FROM "public.Movies" m
	WHERE m.name = 'Тип семейства';

	SELECT m.id INTO id_movie_52
	FROM "public.Movies" m
	WHERE m.name = 'Набор отчетов';

	SELECT m.id INTO id_movie_53
	FROM "public.Movies" m
	WHERE m.name = 'Рынок другой';

	SELECT m.id INTO id_movie_54
	FROM "public.Movies" m
	WHERE m.name = 'Угроза, которой мы служим';

	SELECT m.id INTO id_movie_55
	FROM "public.Movies" m
	WHERE m.name = 'Коробка';

	SELECT m.id INTO id_movie_56
	FROM "public.Movies" m
	WHERE m.name = 'Церковь';

	SELECT m.id INTO id_movie_57
	FROM "public.Movies" m
	WHERE m.name = 'День национального генерала';

	SELECT m.id INTO id_movie_58
	FROM "public.Movies" m
	WHERE m.name = 'Общество войной';

	SELECT m.id INTO id_movie_59
	FROM "public.Movies" m
	WHERE m.name = 'Религиозный демократ';

	SELECT m.id INTO id_movie_60
	FROM "public.Movies" m
	WHERE m.name = 'Предлагать';

	SELECT m.id INTO id_movie_61
	FROM "public.Movies" m
	WHERE m.name = 'Запад';

	SELECT m.id INTO id_movie_62
	FROM "public.Movies" m
	WHERE m.name = 'Этот адвокат по заданию';

	SELECT m.id INTO id_movie_63
	FROM "public.Movies" m
	WHERE m.name = 'Включая';

	SELECT m.id INTO id_movie_64
	FROM "public.Movies" m
	WHERE m.name = 'По появлению';

	SELECT m.id INTO id_movie_65
	FROM "public.Movies" m
	WHERE m.name = 'Беспокоите нас';

	SELECT m.id INTO id_movie_66
	FROM "public.Movies" m
	WHERE m.name = 'Жестко их';

	SELECT m.id INTO id_movie_67
	FROM "public.Movies" m
	WHERE m.name = 'Один раз';

	SELECT m.id INTO id_movie_68
	FROM "public.Movies" m
	WHERE m.name = 'Ну представьте себе';

	SELECT m.id INTO id_movie_69
	FROM "public.Movies" m
	WHERE m.name = 'Еще';

	SELECT m.id INTO id_movie_70
	FROM "public.Movies" m
	WHERE m.name = 'Живой мальчик, звук';

	SELECT m.id INTO id_movie_71
	FROM "public.Movies" m
	WHERE m.name = 'Сад';

	SELECT m.id INTO id_movie_72
	FROM "public.Movies" m
	WHERE m.name = 'Поднимись, слушай';

	SELECT m.id INTO id_movie_73
	FROM "public.Movies" m
	WHERE m.name = 'Означает поддержку когда-либо';

	SELECT m.id INTO id_movie_74
	FROM "public.Movies" m
	WHERE m.name = 'Продолжить аналогичную сторону';

	SELECT m.id INTO id_movie_75
	FROM "public.Movies" m
	WHERE m.name = 'Бесплатно';

	SELECT m.id INTO id_movie_76
	FROM "public.Movies" m
	WHERE m.name = 'Земля';

	SELECT m.id INTO id_movie_77
	FROM "public.Movies" m
	WHERE m.name = 'Голосуйте за ту же часть';

	SELECT m.id INTO id_movie_78
	FROM "public.Movies" m
	WHERE m.name = 'Поздно счастлив';

	SELECT m.id INTO id_movie_79
	FROM "public.Movies" m
	WHERE m.name = 'Служить производительности создавать';

	SELECT m.id INTO id_movie_80
	FROM "public.Movies" m
	WHERE m.name = 'Другие тоже сами';

	SELECT m.id INTO id_movie_81
	FROM "public.Movies" m
	WHERE m.name = 'Различный';

	SELECT m.id INTO id_movie_82
	FROM "public.Movies" m
	WHERE m.name = 'Никогда не режь';

	SELECT m.id INTO id_movie_83
	FROM "public.Movies" m
	WHERE m.name = 'Иностранный довольно';

	SELECT m.id INTO id_movie_84
	FROM "public.Movies" m
	WHERE m.name = 'Количество';

	SELECT m.id INTO id_movie_85
	FROM "public.Movies" m
	WHERE m.name = 'Признайся во всем';

	SELECT m.id INTO id_movie_86
	FROM "public.Movies" m
	WHERE m.name = 'Каждое близкое открытие';

	SELECT m.id INTO id_movie_87
	FROM "public.Movies" m
	WHERE m.name = 'Две войны';

	SELECT m.id INTO id_movie_88
	FROM "public.Movies" m
	WHERE m.name = 'Служить';

	SELECT m.id INTO id_movie_89
	FROM "public.Movies" m
	WHERE m.name = 'Введите другой';

	SELECT m.id INTO id_movie_90
	FROM "public.Movies" m
	WHERE m.name = 'Потерять магазин вечером';

	SELECT m.id INTO id_movie_91
	FROM "public.Movies" m
	WHERE m.name = 'Агент по отцу';

	SELECT m.id INTO id_movie_92
	FROM "public.Movies" m
	WHERE m.name = 'Музыка Миссис';

	SELECT m.id INTO id_movie_93
	FROM "public.Movies" m
	WHERE m.name = 'Влияние на сайт';

	SELECT m.id INTO id_movie_94
	FROM "public.Movies" m
	WHERE m.name = 'Кусочек';

	SELECT m.id INTO id_movie_95
	FROM "public.Movies" m
	WHERE m.name = 'Мировая сумка-машина';

	SELECT m.id INTO id_movie_96
	FROM "public.Movies" m
	WHERE m.name = 'Ничего не упоминай, наш';

	SELECT m.id INTO id_movie_97
	FROM "public.Movies" m
	WHERE m.name = 'Место, желающее место';

	SELECT m.id INTO id_movie_98
	FROM "public.Movies" m
	WHERE m.name = 'Ударять';

	SELECT m.id INTO id_movie_99
	FROM "public.Movies" m
	WHERE m.name = 'Надеяться';

	SELECT m.id INTO id_movie_100
	FROM "public.Movies" m
	WHERE m.name = 'Работа';

	SELECT m.id INTO id_movie_101
	FROM "public.Movies" m
	WHERE m.name = 'Окно сто индивидуальное';

	SELECT m.id INTO id_movie_102
	FROM "public.Movies" m
	WHERE m.name = 'Купить';

	SELECT m.id INTO id_movie_103
	FROM "public.Movies" m
	WHERE m.name = 'Знакомство с природой';

	SELECT m.id INTO id_movie_104
	FROM "public.Movies" m
	WHERE m.name = 'Люди';

	SELECT m.id INTO id_movie_105
	FROM "public.Movies" m
	WHERE m.name = 'Сегодня вечером';

	SELECT m.id INTO id_movie_106
	FROM "public.Movies" m
	WHERE m.name = 'Все вызывают';

	SELECT m.id INTO id_movie_107
	FROM "public.Movies" m
	WHERE m.name = 'Миссис Мейн Муха';

	SELECT m.id INTO id_movie_108
	FROM "public.Movies" m
	WHERE m.name = 'Все может быть';

	SELECT m.id INTO id_movie_109
	FROM "public.Movies" m
	WHERE m.name = 'Отец смены станции';

	INSERT INTO "public.Sessions" (hall_id, movie_id, time_start, time_end) VALUES
		(id_hall_0, id_movie_0, '2023-11-05 12:00:00', '2023-11-05 15:00:00'),
		(id_hall_1, id_movie_1, '2023-11-05 15:00:00', '2023-11-05 18:00:00'),
		(id_hall_2, id_movie_2, '2023-11-05 12:00:00', '2023-11-05 15:00:00'),
		(id_hall_3, id_movie_3, '2023-11-05 15:00:00', '2023-11-05 18:00:00'),
		(id_hall_4, id_movie_4, '2023-11-05 12:00:00', '2023-11-05 15:00:00'),
		(id_hall_5, id_movie_5, '2023-11-05 15:00:00', '2023-11-05 18:00:00'),
		(id_hall_6, id_movie_6, '2023-11-05 12:00:00', '2023-11-05 15:00:00'),
		(id_hall_7, id_movie_7, '2023-11-05 15:00:00', '2023-11-05 18:00:00'),
		(id_hall_8, id_movie_8, '2023-11-05 12:00:00', '2023-11-05 15:00:00'),
		(id_hall_9, id_movie_9, '2023-11-05 15:00:00', '2023-11-05 18:00:00'),
		(id_hall_10, id_movie_10, '2023-11-05 12:00:00', '2023-11-05 15:00:00'),
		(id_hall_11, id_movie_11, '2023-11-05 15:00:00', '2023-11-05 18:00:00'),
		(id_hall_12, id_movie_12, '2023-11-05 12:00:00', '2023-11-05 15:00:00'),
		(id_hall_13, id_movie_13, '2023-11-05 15:00:00', '2023-11-05 18:00:00'),
		(id_hall_14, id_movie_14, '2023-11-05 12:00:00', '2023-11-05 15:00:00'),
		(id_hall_15, id_movie_15, '2023-11-05 15:00:00', '2023-11-05 18:00:00'),
		(id_hall_16, id_movie_0, '2023-11-05 12:00:00', '2023-11-05 15:00:00'),
		(id_hall_17, id_movie_16, '2023-11-05 15:00:00', '2023-11-05 18:00:00'),
		(id_hall_18, id_movie_17, '2023-11-05 12:00:00', '2023-11-05 15:00:00'),
		(id_hall_19, id_movie_18, '2023-11-05 15:00:00', '2023-11-05 18:00:00'),
		(id_hall_20, id_movie_14, '2023-11-05 12:00:00', '2023-11-05 15:00:00'),
		(id_hall_21, id_movie_19, '2023-11-05 15:00:00', '2023-11-05 18:00:00'),
		(id_hall_22, id_movie_20, '2023-11-05 12:00:00', '2023-11-05 15:00:00'),
		(id_hall_23, id_movie_21, '2023-11-05 15:00:00', '2023-11-05 18:00:00'),
		(id_hall_24, id_movie_22, '2023-11-05 12:00:00', '2023-11-05 15:00:00'),
		(id_hall_25, id_movie_23, '2023-11-05 15:00:00', '2023-11-05 18:00:00'),
		(id_hall_26, id_movie_24, '2023-11-05 12:00:00', '2023-11-05 15:00:00'),
		(id_hall_27, id_movie_25, '2023-11-05 15:00:00', '2023-11-05 18:00:00'),
		(id_hall_28, id_movie_26, '2023-11-05 12:00:00', '2023-11-05 15:00:00'),
		(id_hall_29, id_movie_27, '2023-11-05 15:00:00', '2023-11-05 18:00:00'),
		(id_hall_30, id_movie_28, '2023-11-05 12:00:00', '2023-11-05 15:00:00'),
		(id_hall_31, id_movie_29, '2023-11-05 15:00:00', '2023-11-05 18:00:00'),
		(id_hall_32, id_movie_30, '2023-11-05 12:00:00', '2023-11-05 15:00:00'),
		(id_hall_33, id_movie_31, '2023-11-05 15:00:00', '2023-11-05 18:00:00'),
		(id_hall_34, id_movie_32, '2023-11-05 12:00:00', '2023-11-05 15:00:00'),
		(id_hall_35, id_movie_33, '2023-11-05 15:00:00', '2023-11-05 18:00:00'),
		(id_hall_36, id_movie_5, '2023-11-05 12:00:00', '2023-11-05 15:00:00'),
		(id_hall_37, id_movie_34, '2023-11-05 15:00:00', '2023-11-05 18:00:00'),
		(id_hall_38, id_movie_23, '2023-11-05 12:00:00', '2023-11-05 15:00:00'),
		(id_hall_39, id_movie_35, '2023-11-05 15:00:00', '2023-11-05 18:00:00'),
		(id_hall_40, id_movie_36, '2023-11-05 12:00:00', '2023-11-05 15:00:00'),
		(id_hall_41, id_movie_37, '2023-11-05 15:00:00', '2023-11-05 18:00:00'),
		(id_hall_42, id_movie_16, '2023-11-05 12:00:00', '2023-11-05 15:00:00'),
		(id_hall_43, id_movie_38, '2023-11-05 15:00:00', '2023-11-05 18:00:00'),
		(id_hall_44, id_movie_39, '2023-11-05 12:00:00', '2023-11-05 15:00:00'),
		(id_hall_45, id_movie_15, '2023-11-05 15:00:00', '2023-11-05 18:00:00'),
		(id_hall_46, id_movie_40, '2023-11-05 12:00:00', '2023-11-05 15:00:00'),
		(id_hall_47, id_movie_41, '2023-11-05 15:00:00', '2023-11-05 18:00:00'),
		(id_hall_48, id_movie_42, '2023-11-05 12:00:00', '2023-11-05 15:00:00'),
		(id_hall_49, id_movie_43, '2023-11-05 15:00:00', '2023-11-05 18:00:00'),
		(id_hall_50, id_movie_24, '2023-11-05 12:00:00', '2023-11-05 15:00:00'),
		(id_hall_51, id_movie_44, '2023-11-05 15:00:00', '2023-11-05 18:00:00'),
		(id_hall_52, id_movie_45, '2023-11-05 12:00:00', '2023-11-05 15:00:00'),
		(id_hall_53, id_movie_46, '2023-11-05 15:00:00', '2023-11-05 18:00:00'),
		(id_hall_54, id_movie_47, '2023-11-05 12:00:00', '2023-11-05 15:00:00'),
		(id_hall_55, id_movie_48, '2023-11-05 15:00:00', '2023-11-05 18:00:00'),
		(id_hall_56, id_movie_49, '2023-11-05 12:00:00', '2023-11-05 15:00:00'),
		(id_hall_57, id_movie_50, '2023-11-05 15:00:00', '2023-11-05 18:00:00'),
		(id_hall_58, id_movie_13, '2023-11-05 12:00:00', '2023-11-05 15:00:00'),
		(id_hall_59, id_movie_51, '2023-11-05 15:00:00', '2023-11-05 18:00:00'),
		(id_hall_60, id_movie_52, '2023-11-05 12:00:00', '2023-11-05 15:00:00'),
		(id_hall_61, id_movie_53, '2023-11-05 15:00:00', '2023-11-05 18:00:00'),
		(id_hall_62, id_movie_54, '2023-11-05 12:00:00', '2023-11-05 15:00:00'),
		(id_hall_63, id_movie_55, '2023-11-05 15:00:00', '2023-11-05 18:00:00'),
		(id_hall_64, id_movie_35, '2023-11-05 12:00:00', '2023-11-05 15:00:00'),
		(id_hall_65, id_movie_56, '2023-11-05 15:00:00', '2023-11-05 18:00:00'),
		(id_hall_66, id_movie_55, '2023-11-05 12:00:00', '2023-11-05 15:00:00'),
		(id_hall_67, id_movie_17, '2023-11-05 15:00:00', '2023-11-05 18:00:00'),
		(id_hall_68, id_movie_31, '2023-11-05 12:00:00', '2023-11-05 15:00:00'),
		(id_hall_69, id_movie_57, '2023-11-05 15:00:00', '2023-11-05 18:00:00'),
		(id_hall_70, id_movie_24, '2023-11-05 12:00:00', '2023-11-05 15:00:00'),
		(id_hall_71, id_movie_21, '2023-11-05 15:00:00', '2023-11-05 18:00:00'),
		(id_hall_72, id_movie_58, '2023-11-05 12:00:00', '2023-11-05 15:00:00'),
		(id_hall_73, id_movie_59, '2023-11-05 15:00:00', '2023-11-05 18:00:00'),
		(id_hall_74, id_movie_60, '2023-11-05 12:00:00', '2023-11-05 15:00:00'),
		(id_hall_75, id_movie_40, '2023-11-05 15:00:00', '2023-11-05 18:00:00'),
		(id_hall_76, id_movie_61, '2023-11-05 12:00:00', '2023-11-05 15:00:00'),
		(id_hall_77, id_movie_62, '2023-11-05 15:00:00', '2023-11-05 18:00:00'),
		(id_hall_78, id_movie_12, '2023-11-05 12:00:00', '2023-11-05 15:00:00'),
		(id_hall_79, id_movie_63, '2023-11-05 15:00:00', '2023-11-05 18:00:00'),
		(id_hall_80, id_movie_30, '2023-11-05 12:00:00', '2023-11-05 15:00:00'),
		(id_hall_81, id_movie_2, '2023-11-05 15:00:00', '2023-11-05 18:00:00'),
		(id_hall_82, id_movie_18, '2023-11-05 12:00:00', '2023-11-05 15:00:00'),
		(id_hall_83, id_movie_35, '2023-11-05 15:00:00', '2023-11-05 18:00:00'),
		(id_hall_84, id_movie_64, '2023-11-05 12:00:00', '2023-11-05 15:00:00'),
		(id_hall_85, id_movie_65, '2023-11-05 15:00:00', '2023-11-05 18:00:00'),
		(id_hall_86, id_movie_66, '2023-11-05 12:00:00', '2023-11-05 15:00:00'),
		(id_hall_87, id_movie_14, '2023-11-05 15:00:00', '2023-11-05 18:00:00'),
		(id_hall_88, id_movie_5, '2023-11-05 12:00:00', '2023-11-05 15:00:00'),
		(id_hall_89, id_movie_67, '2023-11-05 15:00:00', '2023-11-05 18:00:00'),
		(id_hall_90, id_movie_59, '2023-11-05 12:00:00', '2023-11-05 15:00:00'),
		(id_hall_91, id_movie_68, '2023-11-05 15:00:00', '2023-11-05 18:00:00'),
		(id_hall_92, id_movie_69, '2023-11-05 12:00:00', '2023-11-05 15:00:00'),
		(id_hall_93, id_movie_70, '2023-11-05 15:00:00', '2023-11-05 18:00:00'),
		(id_hall_94, id_movie_71, '2023-11-05 12:00:00', '2023-11-05 15:00:00'),
		(id_hall_95, id_movie_22, '2023-11-05 15:00:00', '2023-11-05 18:00:00'),
		(id_hall_96, id_movie_5, '2023-11-05 12:00:00', '2023-11-05 15:00:00'),
		(id_hall_97, id_movie_56, '2023-11-05 15:00:00', '2023-11-05 18:00:00'),
		(id_hall_98, id_movie_50, '2023-11-05 12:00:00', '2023-11-05 15:00:00'),
		(id_hall_99, id_movie_72, '2023-11-05 15:00:00', '2023-11-05 18:00:00'),
		(id_hall_100, id_movie_71, '2023-11-05 12:00:00', '2023-11-05 15:00:00'),
		(id_hall_101, id_movie_10, '2023-11-05 15:00:00', '2023-11-05 18:00:00'),
		(id_hall_102, id_movie_64, '2023-11-05 12:00:00', '2023-11-05 15:00:00'),
		(id_hall_103, id_movie_67, '2023-11-05 15:00:00', '2023-11-05 18:00:00'),
		(id_hall_104, id_movie_65, '2023-11-05 12:00:00', '2023-11-05 15:00:00'),
		(id_hall_105, id_movie_73, '2023-11-05 15:00:00', '2023-11-05 18:00:00'),
		(id_hall_106, id_movie_74, '2023-11-05 12:00:00', '2023-11-05 15:00:00'),
		(id_hall_107, id_movie_32, '2023-11-05 15:00:00', '2023-11-05 18:00:00'),
		(id_hall_108, id_movie_27, '2023-11-05 12:00:00', '2023-11-05 15:00:00'),
		(id_hall_109, id_movie_75, '2023-11-05 15:00:00', '2023-11-05 18:00:00'),
		(id_hall_110, id_movie_10, '2023-11-05 12:00:00', '2023-11-05 15:00:00'),
		(id_hall_111, id_movie_38, '2023-11-05 15:00:00', '2023-11-05 18:00:00'),
		(id_hall_112, id_movie_76, '2023-11-05 12:00:00', '2023-11-05 15:00:00'),
		(id_hall_113, id_movie_22, '2023-11-05 15:00:00', '2023-11-05 18:00:00'),
		(id_hall_114, id_movie_77, '2023-11-05 12:00:00', '2023-11-05 15:00:00'),
		(id_hall_115, id_movie_12, '2023-11-05 15:00:00', '2023-11-05 18:00:00'),
		(id_hall_116, id_movie_5, '2023-11-05 12:00:00', '2023-11-05 15:00:00'),
		(id_hall_117, id_movie_69, '2023-11-05 15:00:00', '2023-11-05 18:00:00'),
		(id_hall_118, id_movie_78, '2023-11-05 12:00:00', '2023-11-05 15:00:00'),
		(id_hall_119, id_movie_79, '2023-11-05 15:00:00', '2023-11-05 18:00:00'),
		(id_hall_120, id_movie_80, '2023-11-05 12:00:00', '2023-11-05 15:00:00'),
		(id_hall_121, id_movie_21, '2023-11-05 15:00:00', '2023-11-05 18:00:00'),
		(id_hall_122, id_movie_7, '2023-11-05 12:00:00', '2023-11-05 15:00:00'),
		(id_hall_123, id_movie_81, '2023-11-05 15:00:00', '2023-11-05 18:00:00'),
		(id_hall_124, id_movie_10, '2023-11-05 12:00:00', '2023-11-05 15:00:00'),
		(id_hall_125, id_movie_27, '2023-11-05 15:00:00', '2023-11-05 18:00:00'),
		(id_hall_126, id_movie_51, '2023-11-05 12:00:00', '2023-11-05 15:00:00'),
		(id_hall_127, id_movie_82, '2023-11-05 15:00:00', '2023-11-05 18:00:00'),
		(id_hall_128, id_movie_80, '2023-11-05 12:00:00', '2023-11-05 15:00:00'),
		(id_hall_129, id_movie_83, '2023-11-05 15:00:00', '2023-11-05 18:00:00'),
		(id_hall_130, id_movie_43, '2023-11-05 12:00:00', '2023-11-05 15:00:00'),
		(id_hall_131, id_movie_62, '2023-11-05 15:00:00', '2023-11-05 18:00:00'),
		(id_hall_132, id_movie_84, '2023-11-05 12:00:00', '2023-11-05 15:00:00'),
		(id_hall_133, id_movie_85, '2023-11-05 15:00:00', '2023-11-05 18:00:00'),
		(id_hall_134, id_movie_1, '2023-11-05 12:00:00', '2023-11-05 15:00:00'),
		(id_hall_135, id_movie_48, '2023-11-05 15:00:00', '2023-11-05 18:00:00'),
		(id_hall_136, id_movie_86, '2023-11-05 12:00:00', '2023-11-05 15:00:00'),
		(id_hall_137, id_movie_32, '2023-11-05 15:00:00', '2023-11-05 18:00:00'),
		(id_hall_138, id_movie_87, '2023-11-05 12:00:00', '2023-11-05 15:00:00'),
		(id_hall_139, id_movie_83, '2023-11-05 15:00:00', '2023-11-05 18:00:00'),
		(id_hall_140, id_movie_40, '2023-11-05 12:00:00', '2023-11-05 15:00:00'),
		(id_hall_141, id_movie_88, '2023-11-05 15:00:00', '2023-11-05 18:00:00'),
		(id_hall_142, id_movie_83, '2023-11-05 12:00:00', '2023-11-05 15:00:00'),
		(id_hall_143, id_movie_89, '2023-11-05 15:00:00', '2023-11-05 18:00:00'),
		(id_hall_144, id_movie_90, '2023-11-05 12:00:00', '2023-11-05 15:00:00'),
		(id_hall_145, id_movie_91, '2023-11-05 15:00:00', '2023-11-05 18:00:00'),
		(id_hall_146, id_movie_60, '2023-11-05 12:00:00', '2023-11-05 15:00:00'),
		(id_hall_147, id_movie_16, '2023-11-05 15:00:00', '2023-11-05 18:00:00'),
		(id_hall_148, id_movie_92, '2023-11-05 12:00:00', '2023-11-05 15:00:00'),
		(id_hall_149, id_movie_64, '2023-11-05 15:00:00', '2023-11-05 18:00:00'),
		(id_hall_150, id_movie_14, '2023-11-05 12:00:00', '2023-11-05 15:00:00'),
		(id_hall_151, id_movie_44, '2023-11-05 15:00:00', '2023-11-05 18:00:00'),
		(id_hall_152, id_movie_93, '2023-11-05 12:00:00', '2023-11-05 15:00:00'),
		(id_hall_153, id_movie_83, '2023-11-05 15:00:00', '2023-11-05 18:00:00'),
		(id_hall_154, id_movie_31, '2023-11-05 12:00:00', '2023-11-05 15:00:00'),
		(id_hall_155, id_movie_28, '2023-11-05 15:00:00', '2023-11-05 18:00:00'),
		(id_hall_156, id_movie_94, '2023-11-05 12:00:00', '2023-11-05 15:00:00'),
		(id_hall_157, id_movie_95, '2023-11-05 15:00:00', '2023-11-05 18:00:00'),
		(id_hall_158, id_movie_96, '2023-11-05 12:00:00', '2023-11-05 15:00:00'),
		(id_hall_159, id_movie_32, '2023-11-05 15:00:00', '2023-11-05 18:00:00'),
		(id_hall_160, id_movie_97, '2023-11-05 12:00:00', '2023-11-05 15:00:00'),
		(id_hall_161, id_movie_98, '2023-11-05 15:00:00', '2023-11-05 18:00:00'),
		(id_hall_162, id_movie_99, '2023-11-05 12:00:00', '2023-11-05 15:00:00'),
		(id_hall_163, id_movie_100, '2023-11-05 15:00:00', '2023-11-05 18:00:00'),
		(id_hall_164, id_movie_83, '2023-11-05 12:00:00', '2023-11-05 15:00:00'),
		(id_hall_165, id_movie_62, '2023-11-05 15:00:00', '2023-11-05 18:00:00'),
		(id_hall_166, id_movie_101, '2023-11-05 12:00:00', '2023-11-05 15:00:00'),
		(id_hall_167, id_movie_56, '2023-11-05 15:00:00', '2023-11-05 18:00:00'),
		(id_hall_168, id_movie_102, '2023-11-05 12:00:00', '2023-11-05 15:00:00'),
		(id_hall_169, id_movie_103, '2023-11-05 15:00:00', '2023-11-05 18:00:00'),
		(id_hall_170, id_movie_58, '2023-11-05 12:00:00', '2023-11-05 15:00:00'),
		(id_hall_171, id_movie_104, '2023-11-05 15:00:00', '2023-11-05 18:00:00'),
		(id_hall_172, id_movie_47, '2023-11-05 12:00:00', '2023-11-05 15:00:00'),
		(id_hall_173, id_movie_48, '2023-11-05 15:00:00', '2023-11-05 18:00:00'),
		(id_hall_174, id_movie_84, '2023-11-05 12:00:00', '2023-11-05 15:00:00'),
		(id_hall_175, id_movie_11, '2023-11-05 15:00:00', '2023-11-05 18:00:00'),
		(id_hall_176, id_movie_105, '2023-11-05 12:00:00', '2023-11-05 15:00:00'),
		(id_hall_177, id_movie_23, '2023-11-05 15:00:00', '2023-11-05 18:00:00'),
		(id_hall_178, id_movie_42, '2023-11-05 12:00:00', '2023-11-05 15:00:00'),
		(id_hall_179, id_movie_9, '2023-11-05 15:00:00', '2023-11-05 18:00:00'),
		(id_hall_180, id_movie_48, '2023-11-05 12:00:00', '2023-11-05 15:00:00'),
		(id_hall_181, id_movie_69, '2023-11-05 15:00:00', '2023-11-05 18:00:00'),
		(id_hall_182, id_movie_53, '2023-11-05 12:00:00', '2023-11-05 15:00:00'),
		(id_hall_183, id_movie_57, '2023-11-05 15:00:00', '2023-11-05 18:00:00'),
		(id_hall_184, id_movie_16, '2023-11-05 12:00:00', '2023-11-05 15:00:00'),
		(id_hall_185, id_movie_106, '2023-11-05 15:00:00', '2023-11-05 18:00:00'),
		(id_hall_186, id_movie_87, '2023-11-05 12:00:00', '2023-11-05 15:00:00'),
		(id_hall_187, id_movie_12, '2023-11-05 15:00:00', '2023-11-05 18:00:00'),
		(id_hall_188, id_movie_81, '2023-11-05 12:00:00', '2023-11-05 15:00:00'),
		(id_hall_189, id_movie_5, '2023-11-05 15:00:00', '2023-11-05 18:00:00'),
		(id_hall_190, id_movie_106, '2023-11-05 12:00:00', '2023-11-05 15:00:00'),
		(id_hall_191, id_movie_9, '2023-11-05 15:00:00', '2023-11-05 18:00:00'),
		(id_hall_192, id_movie_21, '2023-11-05 12:00:00', '2023-11-05 15:00:00'),
		(id_hall_193, id_movie_107, '2023-11-05 15:00:00', '2023-11-05 18:00:00'),
		(id_hall_194, id_movie_107, '2023-11-05 12:00:00', '2023-11-05 15:00:00'),
		(id_hall_195, id_movie_69, '2023-11-05 15:00:00', '2023-11-05 18:00:00'),
		(id_hall_196, id_movie_44, '2023-11-05 12:00:00', '2023-11-05 15:00:00'),
		(id_hall_197, id_movie_108, '2023-11-05 15:00:00', '2023-11-05 18:00:00'),
		(id_hall_198, id_movie_109, '2023-11-05 12:00:00', '2023-11-05 15:00:00'),
		(id_hall_199, id_movie_95, '2023-11-05 15:00:00', '2023-11-05 18:00:00');
END $$;



DO $$
DECLARE id_hall_0 INT;
DECLARE id_hall_1 INT;
DECLARE id_hall_2 INT;
DECLARE id_hall_3 INT;
DECLARE id_hall_4 INT;
DECLARE id_hall_5 INT;
DECLARE id_hall_6 INT;
DECLARE id_hall_7 INT;
DECLARE id_hall_8 INT;
DECLARE id_hall_9 INT;
DECLARE id_hall_10 INT;
DECLARE id_hall_11 INT;
DECLARE id_hall_12 INT;
DECLARE id_hall_13 INT;
DECLARE id_hall_14 INT;
DECLARE id_hall_15 INT;
DECLARE id_hall_16 INT;
DECLARE id_hall_17 INT;
DECLARE id_hall_18 INT;
DECLARE id_hall_19 INT;
DECLARE id_hall_20 INT;
DECLARE id_hall_21 INT;
DECLARE id_hall_22 INT;
DECLARE id_hall_23 INT;
DECLARE id_hall_24 INT;
DECLARE id_hall_25 INT;
DECLARE id_hall_26 INT;
DECLARE id_hall_27 INT;
DECLARE id_hall_28 INT;
DECLARE id_hall_29 INT;
DECLARE id_hall_30 INT;
DECLARE id_hall_31 INT;
DECLARE id_hall_32 INT;
DECLARE id_hall_33 INT;
DECLARE id_hall_34 INT;
DECLARE id_hall_35 INT;
DECLARE id_hall_36 INT;
DECLARE id_hall_37 INT;
DECLARE id_hall_38 INT;
DECLARE id_hall_39 INT;
DECLARE id_hall_40 INT;
DECLARE id_hall_41 INT;
DECLARE id_hall_42 INT;
DECLARE id_hall_43 INT;
DECLARE id_hall_44 INT;
DECLARE id_hall_45 INT;
DECLARE id_hall_46 INT;
DECLARE id_hall_47 INT;
DECLARE id_hall_48 INT;
DECLARE id_hall_49 INT;
DECLARE id_hall_50 INT;
DECLARE id_hall_51 INT;
DECLARE id_hall_52 INT;
DECLARE id_hall_53 INT;
DECLARE id_hall_54 INT;
DECLARE id_hall_55 INT;
DECLARE id_hall_56 INT;
DECLARE id_hall_57 INT;
DECLARE id_hall_58 INT;
DECLARE id_hall_59 INT;
DECLARE id_hall_60 INT;
DECLARE id_hall_61 INT;
DECLARE id_hall_62 INT;
DECLARE id_hall_63 INT;
DECLARE id_hall_64 INT;
DECLARE id_hall_65 INT;
DECLARE id_hall_66 INT;
DECLARE id_hall_67 INT;
DECLARE id_hall_68 INT;
DECLARE id_hall_69 INT;
DECLARE id_hall_70 INT;
DECLARE id_hall_71 INT;
DECLARE id_hall_72 INT;
DECLARE id_hall_73 INT;
DECLARE id_hall_74 INT;
DECLARE id_hall_75 INT;
DECLARE id_hall_76 INT;
DECLARE id_hall_77 INT;
DECLARE id_hall_78 INT;
DECLARE id_hall_79 INT;
DECLARE id_hall_80 INT;
DECLARE id_hall_81 INT;
DECLARE id_hall_82 INT;
DECLARE id_hall_83 INT;
DECLARE id_hall_84 INT;
DECLARE id_hall_85 INT;
DECLARE id_hall_86 INT;
DECLARE id_hall_87 INT;
DECLARE id_hall_88 INT;
DECLARE id_hall_89 INT;
DECLARE id_hall_90 INT;
DECLARE id_hall_91 INT;
DECLARE id_hall_92 INT;
DECLARE id_hall_93 INT;
DECLARE id_hall_94 INT;
DECLARE id_hall_95 INT;
DECLARE id_hall_96 INT;
DECLARE id_hall_97 INT;
DECLARE id_hall_98 INT;
DECLARE id_hall_99 INT;
DECLARE id_hall_100 INT;
DECLARE id_hall_101 INT;
DECLARE id_hall_102 INT;
DECLARE id_hall_103 INT;
DECLARE id_hall_104 INT;
DECLARE id_hall_105 INT;
DECLARE id_hall_106 INT;
DECLARE id_hall_107 INT;
DECLARE id_hall_108 INT;
DECLARE id_hall_109 INT;
DECLARE id_hall_110 INT;
DECLARE id_hall_111 INT;
DECLARE id_hall_112 INT;
DECLARE id_hall_113 INT;
DECLARE id_hall_114 INT;
DECLARE id_hall_115 INT;
DECLARE id_hall_116 INT;
DECLARE id_hall_117 INT;
DECLARE id_hall_118 INT;
DECLARE id_hall_119 INT;
DECLARE id_hall_120 INT;
DECLARE id_hall_121 INT;
DECLARE id_hall_122 INT;
DECLARE id_hall_123 INT;
DECLARE id_hall_124 INT;
DECLARE id_hall_125 INT;
DECLARE id_hall_126 INT;
DECLARE id_hall_127 INT;
DECLARE id_hall_128 INT;
DECLARE id_hall_129 INT;
DECLARE id_hall_130 INT;
DECLARE id_hall_131 INT;
DECLARE id_hall_132 INT;
DECLARE id_hall_133 INT;
DECLARE id_hall_134 INT;
DECLARE id_hall_135 INT;
DECLARE id_hall_136 INT;
DECLARE id_hall_137 INT;
DECLARE id_hall_138 INT;
DECLARE id_hall_139 INT;
DECLARE id_hall_140 INT;
DECLARE id_hall_141 INT;
DECLARE id_hall_142 INT;
DECLARE id_hall_143 INT;
DECLARE id_hall_144 INT;
DECLARE id_hall_145 INT;
DECLARE id_hall_146 INT;
DECLARE id_hall_147 INT;
DECLARE id_hall_148 INT;
DECLARE id_hall_149 INT;
DECLARE id_hall_150 INT;
DECLARE id_hall_151 INT;
DECLARE id_hall_152 INT;
DECLARE id_hall_153 INT;
DECLARE id_hall_154 INT;
DECLARE id_hall_155 INT;
DECLARE id_hall_156 INT;
DECLARE id_hall_157 INT;
DECLARE id_hall_158 INT;
DECLARE id_hall_159 INT;
DECLARE id_hall_160 INT;
DECLARE id_hall_161 INT;
DECLARE id_hall_162 INT;
DECLARE id_hall_163 INT;
DECLARE id_hall_164 INT;
DECLARE id_hall_165 INT;
DECLARE id_hall_166 INT;
DECLARE id_hall_167 INT;
DECLARE id_hall_168 INT;
DECLARE id_hall_169 INT;
DECLARE id_hall_170 INT;
DECLARE id_hall_171 INT;
DECLARE id_hall_172 INT;
DECLARE id_hall_173 INT;
DECLARE id_hall_174 INT;
DECLARE id_hall_175 INT;
DECLARE id_hall_176 INT;
DECLARE id_hall_177 INT;
DECLARE id_hall_178 INT;
DECLARE id_hall_179 INT;
DECLARE id_hall_180 INT;
DECLARE id_hall_181 INT;
DECLARE id_hall_182 INT;
DECLARE id_hall_183 INT;
DECLARE id_hall_184 INT;
DECLARE id_hall_185 INT;
DECLARE id_hall_186 INT;
DECLARE id_hall_187 INT;
DECLARE id_hall_188 INT;
DECLARE id_hall_189 INT;
DECLARE id_hall_190 INT;
DECLARE id_hall_191 INT;
DECLARE id_hall_192 INT;
DECLARE id_hall_193 INT;
DECLARE id_hall_194 INT;
DECLARE id_hall_195 INT;
DECLARE id_hall_196 INT;
DECLARE id_hall_197 INT;
DECLARE id_hall_198 INT;
DECLARE id_hall_199 INT;

BEGIN
	SELECT h.id INTO id_hall_0
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Первый' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_1
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Первый' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_2
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Второй' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_3
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Второй' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_4
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Третий' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_5
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Третий' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_6
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Четвертый' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_7
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Четвертый' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_8
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Пятый' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_9
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Пятый' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_10
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Шестой' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_11
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Шестой' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_12
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Седьмой' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_13
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Седьмой' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_14
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Восьмой' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_15
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Восьмой' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_16
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Девятый' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_17
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Девятый' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_18
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Десятый' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_19
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Десятый' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_20
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Одиннадцатый' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_21
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Одиннадцатый' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_22
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Двенадцатый' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_23
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Двенадцатый' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_24
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Тринадцатый' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_25
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Тринадцатый' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_26
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Четырнадцатый' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_27
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Четырнадцатый' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_28
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Пятнадцатый' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_29
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Пятнадцатый' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_30
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Шестнадцатый' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_31
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Шестнадцатый' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_32
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Семнадцатый' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_33
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Семнадцатый' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_34
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Восемнадцатый' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_35
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Восемнадцатый' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_36
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Девятнадцатый' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_37
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Девятнадцатый' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_38
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Двадцатый' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_39
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Двадцатый' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_40
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Двадцать первый' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_41
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Двадцать первый' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_42
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Двадцать второй' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_43
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Двадцать второй' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_44
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Двадцать третий' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_45
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Двадцать третий' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_46
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Двадцать четвертый' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_47
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Двадцать четвертый' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_48
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Двадцать пятый' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_49
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Двадцать пятый' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_50
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Двадцать шестой' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_51
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Двадцать шестой' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_52
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Двадцать седьмой' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_53
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Двадцать седьмой' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_54
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Двадцать восьмой' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_55
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Двадцать восьмой' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_56
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Двадцать девятый' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_57
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Двадцать девятый' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_58
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Тридцатый' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_59
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Тридцатый' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_60
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Тридцать первый' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_61
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Тридцать первый' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_62
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Тридцать второй' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_63
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Тридцать второй' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_64
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Тридцать третий' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_65
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Тридцать третий' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_66
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Тридцать четвертый' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_67
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Тридцать четвертый' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_68
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Тридцать пятый' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_69
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Тридцать пятый' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_70
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Тридцать шестой' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_71
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Тридцать шестой' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_72
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Тридцать седьмой' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_73
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Тридцать седьмой' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_74
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Тридцать восьмой' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_75
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Тридцать восьмой' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_76
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Тридцать девятый' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_77
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Тридцать девятый' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_78
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Сороковой' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_79
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Сороковой' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_80
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Сорок первый' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_81
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Сорок первый' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_82
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Сорок второй' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_83
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Сорок второй' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_84
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Сорок третий' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_85
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Сорок третий' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_86
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Сорок четвертый' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_87
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Сорок четвертый' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_88
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Сорок пятый' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_89
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Сорок пятый' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_90
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Сорок шестой' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_91
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Сорок шестой' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_92
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Сорок седьмой' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_93
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Сорок седьмой' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_94
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Сорок восьмой' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_95
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Сорок восьмой' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_96
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Сорок девятый' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_97
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Сорок девятый' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_98
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Пятидесятый' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_99
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Пятидесятый' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_100
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Пятьдесят первый' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_101
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Пятьдесят первый' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_102
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Пятьдесят второй' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_103
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Пятьдесят второй' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_104
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Пятьдесят третий' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_105
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Пятьдесят третий' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_106
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Пятьдесят четвертый' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_107
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Пятьдесят четвертый' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_108
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Пятьдесят пятый' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_109
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Пятьдесят пятый' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_110
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Пятьдесят шестой' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_111
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Пятьдесят шестой' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_112
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Пятьдесят седьмой' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_113
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Пятьдесят седьмой' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_114
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Пятьдесят восьмой' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_115
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Пятьдесят восьмой' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_116
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Пятьдесят девятый' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_117
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Пятьдесят девятый' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_118
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Шестидесятый' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_119
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Шестидесятый' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_120
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Шестьдесят первый' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_121
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Шестьдесят первый' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_122
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Шестьдесят второй' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_123
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Шестьдесят второй' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_124
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Шестьдесят третий' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_125
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Шестьдесят третий' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_126
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Шестьдесят четвертый' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_127
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Шестьдесят четвертый' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_128
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Шестьдесят пятый' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_129
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Шестьдесят пятый' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_130
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Шестьдесят шестой' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_131
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Шестьдесят шестой' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_132
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Шестьдесят седьмой' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_133
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Шестьдесят седьмой' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_134
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Шестьдесят восьмой' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_135
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Шестьдесят восьмой' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_136
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Шестьдесят девятый' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_137
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Шестьдесят девятый' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_138
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Семидесятый' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_139
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Семидесятый' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_140
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Семьдесять первый' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_141
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Семьдесять первый' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_142
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Семьдесять второй' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_143
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Семьдесять второй' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_144
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Семьдесять третий' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_145
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Семьдесять третий' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_146
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Семьдесять четвертый' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_147
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Семьдесять четвертый' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_148
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Семьдесять пятый' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_149
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Семьдесять пятый' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_150
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Семьдесять шестой' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_151
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Семьдесять шестой' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_152
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Семьдесять седьмой' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_153
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Семьдесять седьмой' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_154
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Семьдесять восьмой' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_155
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Семьдесять восьмой' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_156
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Семьдесять девятый' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_157
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Семьдесять девятый' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_158
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Восьмидесятый' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_159
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Восьмидесятый' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_160
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Восемьдесять первый' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_161
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Восемьдесять первый' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_162
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Восемьдесять второй' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_163
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Восемьдесять второй' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_164
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Восемьдесять третий' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_165
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Восемьдесять третий' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_166
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Восемьдесять четвертый' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_167
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Восемьдесять четвертый' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_168
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Восемьдесять пятый' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_169
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Восемьдесять пятый' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_170
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Восемьдесять шестой' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_171
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Восемьдесять шестой' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_172
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Восемьдесять седьмой' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_173
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Восемьдесять седьмой' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_174
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Восемьдесять восьмой' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_175
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Восемьдесять восьмой' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_176
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Восемьдесять девятый' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_177
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Восемьдесять девятый' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_178
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Девяностый' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_179
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Девяностый' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_180
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Девяносто первый' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_181
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Девяносто первый' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_182
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Девяносто второй' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_183
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Девяносто второй' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_184
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Девяносто третий' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_185
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Девяносто третий' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_186
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Девяносто четвертый' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_187
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Девяносто четвертый' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_188
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Девяносто пятый' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_189
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Девяносто пятый' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_190
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Девяносто шестой' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_191
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Девяносто шестой' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_192
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Девяносто седьмой' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_193
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Девяносто седьмой' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_194
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Девяносто восьмой' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_195
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Девяносто восьмой' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_196
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Девяносто девятый' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_197
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Девяносто девятый' AND h.name = 'VIP';

	SELECT h.id INTO id_hall_198
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Сотый' AND h.name = 'Стандартный';

	SELECT h.id INTO id_hall_199
	FROM "public.Halls" h
	JOIN "public.Cinemas" c ON h.cinema_id = c.id
	WHERE c.name = 'Сотый' AND h.name = 'VIP';

	INSERT INTO "public.Seats" (hall_id, row, place) VALUES
		(id_hall_0, 1, 1),(id_hall_0, 1, 2),(id_hall_0, 1, 3),(id_hall_0, 1, 4),(id_hall_0, 1, 5),(id_hall_0, 1, 6),(id_hall_0, 1, 7),(id_hall_0, 1, 8),
		(id_hall_0, 2, 1),(id_hall_0, 2, 2),(id_hall_0, 2, 3),(id_hall_0, 2, 4),(id_hall_0, 2, 5),(id_hall_0, 2, 6),(id_hall_0, 2, 7),(id_hall_0, 2, 8),
		(id_hall_0, 3, 1),(id_hall_0, 3, 2),(id_hall_0, 3, 3),(id_hall_0, 3, 4),(id_hall_0, 3, 5),(id_hall_0, 3, 6),(id_hall_0, 3, 7),(id_hall_0, 3, 8),
		(id_hall_0, 4, 1),(id_hall_0, 4, 2),(id_hall_0, 4, 3),(id_hall_0, 4, 4),(id_hall_0, 4, 5),(id_hall_0, 4, 6),(id_hall_0, 4, 7),(id_hall_0, 4, 8),
		(id_hall_0, 5, 1),(id_hall_0, 5, 2),(id_hall_0, 5, 3),(id_hall_0, 5, 4),(id_hall_0, 5, 5),(id_hall_0, 5, 6),(id_hall_0, 5, 7),(id_hall_0, 5, 8),
		(id_hall_0, 6, 1),(id_hall_0, 6, 2),(id_hall_0, 6, 3),(id_hall_0, 6, 4),(id_hall_0, 6, 5),(id_hall_0, 6, 6),(id_hall_0, 6, 7),(id_hall_0, 6, 8),
		(id_hall_0, 7, 1),(id_hall_0, 7, 2),(id_hall_0, 7, 3),(id_hall_0, 7, 4),(id_hall_0, 7, 5),(id_hall_0, 7, 6),(id_hall_0, 7, 7),(id_hall_0, 7, 8),
		(id_hall_1, 1, 1),(id_hall_1, 1, 2),(id_hall_1, 1, 3),(id_hall_1, 1, 4),(id_hall_1, 1, 5),(id_hall_1, 1, 6),(id_hall_1, 1, 7),(id_hall_1, 1, 8),
		(id_hall_1, 2, 1),(id_hall_1, 2, 2),(id_hall_1, 2, 3),(id_hall_1, 2, 4),(id_hall_1, 2, 5),(id_hall_1, 2, 6),(id_hall_1, 2, 7),(id_hall_1, 2, 8),
		(id_hall_1, 3, 1),(id_hall_1, 3, 2),(id_hall_1, 3, 3),(id_hall_1, 3, 4),(id_hall_1, 3, 5),(id_hall_1, 3, 6),(id_hall_1, 3, 7),(id_hall_1, 3, 8),
		(id_hall_1, 4, 1),(id_hall_1, 4, 2),(id_hall_1, 4, 3),(id_hall_1, 4, 4),(id_hall_1, 4, 5),(id_hall_1, 4, 6),(id_hall_1, 4, 7),(id_hall_1, 4, 8),
		(id_hall_1, 5, 1),(id_hall_1, 5, 2),(id_hall_1, 5, 3),(id_hall_1, 5, 4),(id_hall_1, 5, 5),(id_hall_1, 5, 6),(id_hall_1, 5, 7),(id_hall_1, 5, 8),
		(id_hall_1, 6, 1),(id_hall_1, 6, 2),(id_hall_1, 6, 3),(id_hall_1, 6, 4),(id_hall_1, 6, 5),(id_hall_1, 6, 6),(id_hall_1, 6, 7),(id_hall_1, 6, 8),
		(id_hall_1, 7, 1),(id_hall_1, 7, 2),(id_hall_1, 7, 3),(id_hall_1, 7, 4),(id_hall_1, 7, 5),(id_hall_1, 7, 6),(id_hall_1, 7, 7),(id_hall_1, 7, 8),
		(id_hall_2, 1, 1),(id_hall_2, 1, 2),(id_hall_2, 1, 3),(id_hall_2, 1, 4),(id_hall_2, 1, 5),(id_hall_2, 1, 6),(id_hall_2, 1, 7),(id_hall_2, 1, 8),
		(id_hall_2, 2, 1),(id_hall_2, 2, 2),(id_hall_2, 2, 3),(id_hall_2, 2, 4),(id_hall_2, 2, 5),(id_hall_2, 2, 6),(id_hall_2, 2, 7),(id_hall_2, 2, 8),
		(id_hall_2, 3, 1),(id_hall_2, 3, 2),(id_hall_2, 3, 3),(id_hall_2, 3, 4),(id_hall_2, 3, 5),(id_hall_2, 3, 6),(id_hall_2, 3, 7),(id_hall_2, 3, 8),
		(id_hall_2, 4, 1),(id_hall_2, 4, 2),(id_hall_2, 4, 3),(id_hall_2, 4, 4),(id_hall_2, 4, 5),(id_hall_2, 4, 6),(id_hall_2, 4, 7),(id_hall_2, 4, 8),
		(id_hall_2, 5, 1),(id_hall_2, 5, 2),(id_hall_2, 5, 3),(id_hall_2, 5, 4),(id_hall_2, 5, 5),(id_hall_2, 5, 6),(id_hall_2, 5, 7),(id_hall_2, 5, 8),
		(id_hall_2, 6, 1),(id_hall_2, 6, 2),(id_hall_2, 6, 3),(id_hall_2, 6, 4),(id_hall_2, 6, 5),(id_hall_2, 6, 6),(id_hall_2, 6, 7),(id_hall_2, 6, 8),
		(id_hall_2, 7, 1),(id_hall_2, 7, 2),(id_hall_2, 7, 3),(id_hall_2, 7, 4),(id_hall_2, 7, 5),(id_hall_2, 7, 6),(id_hall_2, 7, 7),(id_hall_2, 7, 8),
		(id_hall_3, 1, 1),(id_hall_3, 1, 2),(id_hall_3, 1, 3),(id_hall_3, 1, 4),(id_hall_3, 1, 5),(id_hall_3, 1, 6),(id_hall_3, 1, 7),(id_hall_3, 1, 8),
		(id_hall_3, 2, 1),(id_hall_3, 2, 2),(id_hall_3, 2, 3),(id_hall_3, 2, 4),(id_hall_3, 2, 5),(id_hall_3, 2, 6),(id_hall_3, 2, 7),(id_hall_3, 2, 8),
		(id_hall_3, 3, 1),(id_hall_3, 3, 2),(id_hall_3, 3, 3),(id_hall_3, 3, 4),(id_hall_3, 3, 5),(id_hall_3, 3, 6),(id_hall_3, 3, 7),(id_hall_3, 3, 8),
		(id_hall_3, 4, 1),(id_hall_3, 4, 2),(id_hall_3, 4, 3),(id_hall_3, 4, 4),(id_hall_3, 4, 5),(id_hall_3, 4, 6),(id_hall_3, 4, 7),(id_hall_3, 4, 8),
		(id_hall_3, 5, 1),(id_hall_3, 5, 2),(id_hall_3, 5, 3),(id_hall_3, 5, 4),(id_hall_3, 5, 5),(id_hall_3, 5, 6),(id_hall_3, 5, 7),(id_hall_3, 5, 8),
		(id_hall_3, 6, 1),(id_hall_3, 6, 2),(id_hall_3, 6, 3),(id_hall_3, 6, 4),(id_hall_3, 6, 5),(id_hall_3, 6, 6),(id_hall_3, 6, 7),(id_hall_3, 6, 8),
		(id_hall_3, 7, 1),(id_hall_3, 7, 2),(id_hall_3, 7, 3),(id_hall_3, 7, 4),(id_hall_3, 7, 5),(id_hall_3, 7, 6),(id_hall_3, 7, 7),(id_hall_3, 7, 8),
		(id_hall_4, 1, 1),(id_hall_4, 1, 2),(id_hall_4, 1, 3),(id_hall_4, 1, 4),(id_hall_4, 1, 5),(id_hall_4, 1, 6),(id_hall_4, 1, 7),(id_hall_4, 1, 8),
		(id_hall_4, 2, 1),(id_hall_4, 2, 2),(id_hall_4, 2, 3),(id_hall_4, 2, 4),(id_hall_4, 2, 5),(id_hall_4, 2, 6),(id_hall_4, 2, 7),(id_hall_4, 2, 8),
		(id_hall_4, 3, 1),(id_hall_4, 3, 2),(id_hall_4, 3, 3),(id_hall_4, 3, 4),(id_hall_4, 3, 5),(id_hall_4, 3, 6),(id_hall_4, 3, 7),(id_hall_4, 3, 8),
		(id_hall_4, 4, 1),(id_hall_4, 4, 2),(id_hall_4, 4, 3),(id_hall_4, 4, 4),(id_hall_4, 4, 5),(id_hall_4, 4, 6),(id_hall_4, 4, 7),(id_hall_4, 4, 8),
		(id_hall_4, 5, 1),(id_hall_4, 5, 2),(id_hall_4, 5, 3),(id_hall_4, 5, 4),(id_hall_4, 5, 5),(id_hall_4, 5, 6),(id_hall_4, 5, 7),(id_hall_4, 5, 8),
		(id_hall_4, 6, 1),(id_hall_4, 6, 2),(id_hall_4, 6, 3),(id_hall_4, 6, 4),(id_hall_4, 6, 5),(id_hall_4, 6, 6),(id_hall_4, 6, 7),(id_hall_4, 6, 8),
		(id_hall_4, 7, 1),(id_hall_4, 7, 2),(id_hall_4, 7, 3),(id_hall_4, 7, 4),(id_hall_4, 7, 5),(id_hall_4, 7, 6),(id_hall_4, 7, 7),(id_hall_4, 7, 8),
		(id_hall_5, 1, 1),(id_hall_5, 1, 2),(id_hall_5, 1, 3),(id_hall_5, 1, 4),(id_hall_5, 1, 5),(id_hall_5, 1, 6),(id_hall_5, 1, 7),(id_hall_5, 1, 8),
		(id_hall_5, 2, 1),(id_hall_5, 2, 2),(id_hall_5, 2, 3),(id_hall_5, 2, 4),(id_hall_5, 2, 5),(id_hall_5, 2, 6),(id_hall_5, 2, 7),(id_hall_5, 2, 8),
		(id_hall_5, 3, 1),(id_hall_5, 3, 2),(id_hall_5, 3, 3),(id_hall_5, 3, 4),(id_hall_5, 3, 5),(id_hall_5, 3, 6),(id_hall_5, 3, 7),(id_hall_5, 3, 8),
		(id_hall_5, 4, 1),(id_hall_5, 4, 2),(id_hall_5, 4, 3),(id_hall_5, 4, 4),(id_hall_5, 4, 5),(id_hall_5, 4, 6),(id_hall_5, 4, 7),(id_hall_5, 4, 8),
		(id_hall_5, 5, 1),(id_hall_5, 5, 2),(id_hall_5, 5, 3),(id_hall_5, 5, 4),(id_hall_5, 5, 5),(id_hall_5, 5, 6),(id_hall_5, 5, 7),(id_hall_5, 5, 8),
		(id_hall_5, 6, 1),(id_hall_5, 6, 2),(id_hall_5, 6, 3),(id_hall_5, 6, 4),(id_hall_5, 6, 5),(id_hall_5, 6, 6),(id_hall_5, 6, 7),(id_hall_5, 6, 8),
		(id_hall_5, 7, 1),(id_hall_5, 7, 2),(id_hall_5, 7, 3),(id_hall_5, 7, 4),(id_hall_5, 7, 5),(id_hall_5, 7, 6),(id_hall_5, 7, 7),(id_hall_5, 7, 8),
		(id_hall_6, 1, 1),(id_hall_6, 1, 2),(id_hall_6, 1, 3),(id_hall_6, 1, 4),(id_hall_6, 1, 5),(id_hall_6, 1, 6),(id_hall_6, 1, 7),(id_hall_6, 1, 8),
		(id_hall_6, 2, 1),(id_hall_6, 2, 2),(id_hall_6, 2, 3),(id_hall_6, 2, 4),(id_hall_6, 2, 5),(id_hall_6, 2, 6),(id_hall_6, 2, 7),(id_hall_6, 2, 8),
		(id_hall_6, 3, 1),(id_hall_6, 3, 2),(id_hall_6, 3, 3),(id_hall_6, 3, 4),(id_hall_6, 3, 5),(id_hall_6, 3, 6),(id_hall_6, 3, 7),(id_hall_6, 3, 8),
		(id_hall_6, 4, 1),(id_hall_6, 4, 2),(id_hall_6, 4, 3),(id_hall_6, 4, 4),(id_hall_6, 4, 5),(id_hall_6, 4, 6),(id_hall_6, 4, 7),(id_hall_6, 4, 8),
		(id_hall_6, 5, 1),(id_hall_6, 5, 2),(id_hall_6, 5, 3),(id_hall_6, 5, 4),(id_hall_6, 5, 5),(id_hall_6, 5, 6),(id_hall_6, 5, 7),(id_hall_6, 5, 8),
		(id_hall_6, 6, 1),(id_hall_6, 6, 2),(id_hall_6, 6, 3),(id_hall_6, 6, 4),(id_hall_6, 6, 5),(id_hall_6, 6, 6),(id_hall_6, 6, 7),(id_hall_6, 6, 8),
		(id_hall_6, 7, 1),(id_hall_6, 7, 2),(id_hall_6, 7, 3),(id_hall_6, 7, 4),(id_hall_6, 7, 5),(id_hall_6, 7, 6),(id_hall_6, 7, 7),(id_hall_6, 7, 8),
		(id_hall_7, 1, 1),(id_hall_7, 1, 2),(id_hall_7, 1, 3),(id_hall_7, 1, 4),(id_hall_7, 1, 5),(id_hall_7, 1, 6),(id_hall_7, 1, 7),(id_hall_7, 1, 8),
		(id_hall_7, 2, 1),(id_hall_7, 2, 2),(id_hall_7, 2, 3),(id_hall_7, 2, 4),(id_hall_7, 2, 5),(id_hall_7, 2, 6),(id_hall_7, 2, 7),(id_hall_7, 2, 8),
		(id_hall_7, 3, 1),(id_hall_7, 3, 2),(id_hall_7, 3, 3),(id_hall_7, 3, 4),(id_hall_7, 3, 5),(id_hall_7, 3, 6),(id_hall_7, 3, 7),(id_hall_7, 3, 8),
		(id_hall_7, 4, 1),(id_hall_7, 4, 2),(id_hall_7, 4, 3),(id_hall_7, 4, 4),(id_hall_7, 4, 5),(id_hall_7, 4, 6),(id_hall_7, 4, 7),(id_hall_7, 4, 8),
		(id_hall_7, 5, 1),(id_hall_7, 5, 2),(id_hall_7, 5, 3),(id_hall_7, 5, 4),(id_hall_7, 5, 5),(id_hall_7, 5, 6),(id_hall_7, 5, 7),(id_hall_7, 5, 8),
		(id_hall_7, 6, 1),(id_hall_7, 6, 2),(id_hall_7, 6, 3),(id_hall_7, 6, 4),(id_hall_7, 6, 5),(id_hall_7, 6, 6),(id_hall_7, 6, 7),(id_hall_7, 6, 8),
		(id_hall_7, 7, 1),(id_hall_7, 7, 2),(id_hall_7, 7, 3),(id_hall_7, 7, 4),(id_hall_7, 7, 5),(id_hall_7, 7, 6),(id_hall_7, 7, 7),(id_hall_7, 7, 8),
		(id_hall_8, 1, 1),(id_hall_8, 1, 2),(id_hall_8, 1, 3),(id_hall_8, 1, 4),(id_hall_8, 1, 5),(id_hall_8, 1, 6),(id_hall_8, 1, 7),(id_hall_8, 1, 8),
		(id_hall_8, 2, 1),(id_hall_8, 2, 2),(id_hall_8, 2, 3),(id_hall_8, 2, 4),(id_hall_8, 2, 5),(id_hall_8, 2, 6),(id_hall_8, 2, 7),(id_hall_8, 2, 8),
		(id_hall_8, 3, 1),(id_hall_8, 3, 2),(id_hall_8, 3, 3),(id_hall_8, 3, 4),(id_hall_8, 3, 5),(id_hall_8, 3, 6),(id_hall_8, 3, 7),(id_hall_8, 3, 8),
		(id_hall_8, 4, 1),(id_hall_8, 4, 2),(id_hall_8, 4, 3),(id_hall_8, 4, 4),(id_hall_8, 4, 5),(id_hall_8, 4, 6),(id_hall_8, 4, 7),(id_hall_8, 4, 8),
		(id_hall_8, 5, 1),(id_hall_8, 5, 2),(id_hall_8, 5, 3),(id_hall_8, 5, 4),(id_hall_8, 5, 5),(id_hall_8, 5, 6),(id_hall_8, 5, 7),(id_hall_8, 5, 8),
		(id_hall_8, 6, 1),(id_hall_8, 6, 2),(id_hall_8, 6, 3),(id_hall_8, 6, 4),(id_hall_8, 6, 5),(id_hall_8, 6, 6),(id_hall_8, 6, 7),(id_hall_8, 6, 8),
		(id_hall_8, 7, 1),(id_hall_8, 7, 2),(id_hall_8, 7, 3),(id_hall_8, 7, 4),(id_hall_8, 7, 5),(id_hall_8, 7, 6),(id_hall_8, 7, 7),(id_hall_8, 7, 8),
		(id_hall_9, 1, 1),(id_hall_9, 1, 2),(id_hall_9, 1, 3),(id_hall_9, 1, 4),(id_hall_9, 1, 5),(id_hall_9, 1, 6),(id_hall_9, 1, 7),(id_hall_9, 1, 8),
		(id_hall_9, 2, 1),(id_hall_9, 2, 2),(id_hall_9, 2, 3),(id_hall_9, 2, 4),(id_hall_9, 2, 5),(id_hall_9, 2, 6),(id_hall_9, 2, 7),(id_hall_9, 2, 8),
		(id_hall_9, 3, 1),(id_hall_9, 3, 2),(id_hall_9, 3, 3),(id_hall_9, 3, 4),(id_hall_9, 3, 5),(id_hall_9, 3, 6),(id_hall_9, 3, 7),(id_hall_9, 3, 8),
		(id_hall_9, 4, 1),(id_hall_9, 4, 2),(id_hall_9, 4, 3),(id_hall_9, 4, 4),(id_hall_9, 4, 5),(id_hall_9, 4, 6),(id_hall_9, 4, 7),(id_hall_9, 4, 8),
		(id_hall_9, 5, 1),(id_hall_9, 5, 2),(id_hall_9, 5, 3),(id_hall_9, 5, 4),(id_hall_9, 5, 5),(id_hall_9, 5, 6),(id_hall_9, 5, 7),(id_hall_9, 5, 8),
		(id_hall_9, 6, 1),(id_hall_9, 6, 2),(id_hall_9, 6, 3),(id_hall_9, 6, 4),(id_hall_9, 6, 5),(id_hall_9, 6, 6),(id_hall_9, 6, 7),(id_hall_9, 6, 8),
		(id_hall_9, 7, 1),(id_hall_9, 7, 2),(id_hall_9, 7, 3),(id_hall_9, 7, 4),(id_hall_9, 7, 5),(id_hall_9, 7, 6),(id_hall_9, 7, 7),(id_hall_9, 7, 8),
		(id_hall_10, 1, 1),(id_hall_10, 1, 2),(id_hall_10, 1, 3),(id_hall_10, 1, 4),(id_hall_10, 1, 5),(id_hall_10, 1, 6),(id_hall_10, 1, 7),(id_hall_10, 1, 8),
		(id_hall_10, 2, 1),(id_hall_10, 2, 2),(id_hall_10, 2, 3),(id_hall_10, 2, 4),(id_hall_10, 2, 5),(id_hall_10, 2, 6),(id_hall_10, 2, 7),(id_hall_10, 2, 8),
		(id_hall_10, 3, 1),(id_hall_10, 3, 2),(id_hall_10, 3, 3),(id_hall_10, 3, 4),(id_hall_10, 3, 5),(id_hall_10, 3, 6),(id_hall_10, 3, 7),(id_hall_10, 3, 8),
		(id_hall_10, 4, 1),(id_hall_10, 4, 2),(id_hall_10, 4, 3),(id_hall_10, 4, 4),(id_hall_10, 4, 5),(id_hall_10, 4, 6),(id_hall_10, 4, 7),(id_hall_10, 4, 8),
		(id_hall_10, 5, 1),(id_hall_10, 5, 2),(id_hall_10, 5, 3),(id_hall_10, 5, 4),(id_hall_10, 5, 5),(id_hall_10, 5, 6),(id_hall_10, 5, 7),(id_hall_10, 5, 8),
		(id_hall_10, 6, 1),(id_hall_10, 6, 2),(id_hall_10, 6, 3),(id_hall_10, 6, 4),(id_hall_10, 6, 5),(id_hall_10, 6, 6),(id_hall_10, 6, 7),(id_hall_10, 6, 8),
		(id_hall_10, 7, 1),(id_hall_10, 7, 2),(id_hall_10, 7, 3),(id_hall_10, 7, 4),(id_hall_10, 7, 5),(id_hall_10, 7, 6),(id_hall_10, 7, 7),(id_hall_10, 7, 8),
		(id_hall_11, 1, 1),(id_hall_11, 1, 2),(id_hall_11, 1, 3),(id_hall_11, 1, 4),(id_hall_11, 1, 5),(id_hall_11, 1, 6),(id_hall_11, 1, 7),(id_hall_11, 1, 8),
		(id_hall_11, 2, 1),(id_hall_11, 2, 2),(id_hall_11, 2, 3),(id_hall_11, 2, 4),(id_hall_11, 2, 5),(id_hall_11, 2, 6),(id_hall_11, 2, 7),(id_hall_11, 2, 8),
		(id_hall_11, 3, 1),(id_hall_11, 3, 2),(id_hall_11, 3, 3),(id_hall_11, 3, 4),(id_hall_11, 3, 5),(id_hall_11, 3, 6),(id_hall_11, 3, 7),(id_hall_11, 3, 8),
		(id_hall_11, 4, 1),(id_hall_11, 4, 2),(id_hall_11, 4, 3),(id_hall_11, 4, 4),(id_hall_11, 4, 5),(id_hall_11, 4, 6),(id_hall_11, 4, 7),(id_hall_11, 4, 8),
		(id_hall_11, 5, 1),(id_hall_11, 5, 2),(id_hall_11, 5, 3),(id_hall_11, 5, 4),(id_hall_11, 5, 5),(id_hall_11, 5, 6),(id_hall_11, 5, 7),(id_hall_11, 5, 8),
		(id_hall_11, 6, 1),(id_hall_11, 6, 2),(id_hall_11, 6, 3),(id_hall_11, 6, 4),(id_hall_11, 6, 5),(id_hall_11, 6, 6),(id_hall_11, 6, 7),(id_hall_11, 6, 8),
		(id_hall_11, 7, 1),(id_hall_11, 7, 2),(id_hall_11, 7, 3),(id_hall_11, 7, 4),(id_hall_11, 7, 5),(id_hall_11, 7, 6),(id_hall_11, 7, 7),(id_hall_11, 7, 8),
		(id_hall_12, 1, 1),(id_hall_12, 1, 2),(id_hall_12, 1, 3),(id_hall_12, 1, 4),(id_hall_12, 1, 5),(id_hall_12, 1, 6),(id_hall_12, 1, 7),(id_hall_12, 1, 8),
		(id_hall_12, 2, 1),(id_hall_12, 2, 2),(id_hall_12, 2, 3),(id_hall_12, 2, 4),(id_hall_12, 2, 5),(id_hall_12, 2, 6),(id_hall_12, 2, 7),(id_hall_12, 2, 8),
		(id_hall_12, 3, 1),(id_hall_12, 3, 2),(id_hall_12, 3, 3),(id_hall_12, 3, 4),(id_hall_12, 3, 5),(id_hall_12, 3, 6),(id_hall_12, 3, 7),(id_hall_12, 3, 8),
		(id_hall_12, 4, 1),(id_hall_12, 4, 2),(id_hall_12, 4, 3),(id_hall_12, 4, 4),(id_hall_12, 4, 5),(id_hall_12, 4, 6),(id_hall_12, 4, 7),(id_hall_12, 4, 8),
		(id_hall_12, 5, 1),(id_hall_12, 5, 2),(id_hall_12, 5, 3),(id_hall_12, 5, 4),(id_hall_12, 5, 5),(id_hall_12, 5, 6),(id_hall_12, 5, 7),(id_hall_12, 5, 8),
		(id_hall_12, 6, 1),(id_hall_12, 6, 2),(id_hall_12, 6, 3),(id_hall_12, 6, 4),(id_hall_12, 6, 5),(id_hall_12, 6, 6),(id_hall_12, 6, 7),(id_hall_12, 6, 8),
		(id_hall_12, 7, 1),(id_hall_12, 7, 2),(id_hall_12, 7, 3),(id_hall_12, 7, 4),(id_hall_12, 7, 5),(id_hall_12, 7, 6),(id_hall_12, 7, 7),(id_hall_12, 7, 8),
		(id_hall_13, 1, 1),(id_hall_13, 1, 2),(id_hall_13, 1, 3),(id_hall_13, 1, 4),(id_hall_13, 1, 5),(id_hall_13, 1, 6),(id_hall_13, 1, 7),(id_hall_13, 1, 8),
		(id_hall_13, 2, 1),(id_hall_13, 2, 2),(id_hall_13, 2, 3),(id_hall_13, 2, 4),(id_hall_13, 2, 5),(id_hall_13, 2, 6),(id_hall_13, 2, 7),(id_hall_13, 2, 8),
		(id_hall_13, 3, 1),(id_hall_13, 3, 2),(id_hall_13, 3, 3),(id_hall_13, 3, 4),(id_hall_13, 3, 5),(id_hall_13, 3, 6),(id_hall_13, 3, 7),(id_hall_13, 3, 8),
		(id_hall_13, 4, 1),(id_hall_13, 4, 2),(id_hall_13, 4, 3),(id_hall_13, 4, 4),(id_hall_13, 4, 5),(id_hall_13, 4, 6),(id_hall_13, 4, 7),(id_hall_13, 4, 8),
		(id_hall_13, 5, 1),(id_hall_13, 5, 2),(id_hall_13, 5, 3),(id_hall_13, 5, 4),(id_hall_13, 5, 5),(id_hall_13, 5, 6),(id_hall_13, 5, 7),(id_hall_13, 5, 8),
		(id_hall_13, 6, 1),(id_hall_13, 6, 2),(id_hall_13, 6, 3),(id_hall_13, 6, 4),(id_hall_13, 6, 5),(id_hall_13, 6, 6),(id_hall_13, 6, 7),(id_hall_13, 6, 8),
		(id_hall_13, 7, 1),(id_hall_13, 7, 2),(id_hall_13, 7, 3),(id_hall_13, 7, 4),(id_hall_13, 7, 5),(id_hall_13, 7, 6),(id_hall_13, 7, 7),(id_hall_13, 7, 8),
		(id_hall_14, 1, 1),(id_hall_14, 1, 2),(id_hall_14, 1, 3),(id_hall_14, 1, 4),(id_hall_14, 1, 5),(id_hall_14, 1, 6),(id_hall_14, 1, 7),(id_hall_14, 1, 8),
		(id_hall_14, 2, 1),(id_hall_14, 2, 2),(id_hall_14, 2, 3),(id_hall_14, 2, 4),(id_hall_14, 2, 5),(id_hall_14, 2, 6),(id_hall_14, 2, 7),(id_hall_14, 2, 8),
		(id_hall_14, 3, 1),(id_hall_14, 3, 2),(id_hall_14, 3, 3),(id_hall_14, 3, 4),(id_hall_14, 3, 5),(id_hall_14, 3, 6),(id_hall_14, 3, 7),(id_hall_14, 3, 8),
		(id_hall_14, 4, 1),(id_hall_14, 4, 2),(id_hall_14, 4, 3),(id_hall_14, 4, 4),(id_hall_14, 4, 5),(id_hall_14, 4, 6),(id_hall_14, 4, 7),(id_hall_14, 4, 8),
		(id_hall_14, 5, 1),(id_hall_14, 5, 2),(id_hall_14, 5, 3),(id_hall_14, 5, 4),(id_hall_14, 5, 5),(id_hall_14, 5, 6),(id_hall_14, 5, 7),(id_hall_14, 5, 8),
		(id_hall_14, 6, 1),(id_hall_14, 6, 2),(id_hall_14, 6, 3),(id_hall_14, 6, 4),(id_hall_14, 6, 5),(id_hall_14, 6, 6),(id_hall_14, 6, 7),(id_hall_14, 6, 8),
		(id_hall_14, 7, 1),(id_hall_14, 7, 2),(id_hall_14, 7, 3),(id_hall_14, 7, 4),(id_hall_14, 7, 5),(id_hall_14, 7, 6),(id_hall_14, 7, 7),(id_hall_14, 7, 8),
		(id_hall_15, 1, 1),(id_hall_15, 1, 2),(id_hall_15, 1, 3),(id_hall_15, 1, 4),(id_hall_15, 1, 5),(id_hall_15, 1, 6),(id_hall_15, 1, 7),(id_hall_15, 1, 8),
		(id_hall_15, 2, 1),(id_hall_15, 2, 2),(id_hall_15, 2, 3),(id_hall_15, 2, 4),(id_hall_15, 2, 5),(id_hall_15, 2, 6),(id_hall_15, 2, 7),(id_hall_15, 2, 8),
		(id_hall_15, 3, 1),(id_hall_15, 3, 2),(id_hall_15, 3, 3),(id_hall_15, 3, 4),(id_hall_15, 3, 5),(id_hall_15, 3, 6),(id_hall_15, 3, 7),(id_hall_15, 3, 8),
		(id_hall_15, 4, 1),(id_hall_15, 4, 2),(id_hall_15, 4, 3),(id_hall_15, 4, 4),(id_hall_15, 4, 5),(id_hall_15, 4, 6),(id_hall_15, 4, 7),(id_hall_15, 4, 8),
		(id_hall_15, 5, 1),(id_hall_15, 5, 2),(id_hall_15, 5, 3),(id_hall_15, 5, 4),(id_hall_15, 5, 5),(id_hall_15, 5, 6),(id_hall_15, 5, 7),(id_hall_15, 5, 8),
		(id_hall_15, 6, 1),(id_hall_15, 6, 2),(id_hall_15, 6, 3),(id_hall_15, 6, 4),(id_hall_15, 6, 5),(id_hall_15, 6, 6),(id_hall_15, 6, 7),(id_hall_15, 6, 8),
		(id_hall_15, 7, 1),(id_hall_15, 7, 2),(id_hall_15, 7, 3),(id_hall_15, 7, 4),(id_hall_15, 7, 5),(id_hall_15, 7, 6),(id_hall_15, 7, 7),(id_hall_15, 7, 8),
		(id_hall_16, 1, 1),(id_hall_16, 1, 2),(id_hall_16, 1, 3),(id_hall_16, 1, 4),(id_hall_16, 1, 5),(id_hall_16, 1, 6),(id_hall_16, 1, 7),(id_hall_16, 1, 8),
		(id_hall_16, 2, 1),(id_hall_16, 2, 2),(id_hall_16, 2, 3),(id_hall_16, 2, 4),(id_hall_16, 2, 5),(id_hall_16, 2, 6),(id_hall_16, 2, 7),(id_hall_16, 2, 8),
		(id_hall_16, 3, 1),(id_hall_16, 3, 2),(id_hall_16, 3, 3),(id_hall_16, 3, 4),(id_hall_16, 3, 5),(id_hall_16, 3, 6),(id_hall_16, 3, 7),(id_hall_16, 3, 8),
		(id_hall_16, 4, 1),(id_hall_16, 4, 2),(id_hall_16, 4, 3),(id_hall_16, 4, 4),(id_hall_16, 4, 5),(id_hall_16, 4, 6),(id_hall_16, 4, 7),(id_hall_16, 4, 8),
		(id_hall_16, 5, 1),(id_hall_16, 5, 2),(id_hall_16, 5, 3),(id_hall_16, 5, 4),(id_hall_16, 5, 5),(id_hall_16, 5, 6),(id_hall_16, 5, 7),(id_hall_16, 5, 8),
		(id_hall_16, 6, 1),(id_hall_16, 6, 2),(id_hall_16, 6, 3),(id_hall_16, 6, 4),(id_hall_16, 6, 5),(id_hall_16, 6, 6),(id_hall_16, 6, 7),(id_hall_16, 6, 8),
		(id_hall_16, 7, 1),(id_hall_16, 7, 2),(id_hall_16, 7, 3),(id_hall_16, 7, 4),(id_hall_16, 7, 5),(id_hall_16, 7, 6),(id_hall_16, 7, 7),(id_hall_16, 7, 8),
		(id_hall_17, 1, 1),(id_hall_17, 1, 2),(id_hall_17, 1, 3),(id_hall_17, 1, 4),(id_hall_17, 1, 5),(id_hall_17, 1, 6),(id_hall_17, 1, 7),(id_hall_17, 1, 8),
		(id_hall_17, 2, 1),(id_hall_17, 2, 2),(id_hall_17, 2, 3),(id_hall_17, 2, 4),(id_hall_17, 2, 5),(id_hall_17, 2, 6),(id_hall_17, 2, 7),(id_hall_17, 2, 8),
		(id_hall_17, 3, 1),(id_hall_17, 3, 2),(id_hall_17, 3, 3),(id_hall_17, 3, 4),(id_hall_17, 3, 5),(id_hall_17, 3, 6),(id_hall_17, 3, 7),(id_hall_17, 3, 8),
		(id_hall_17, 4, 1),(id_hall_17, 4, 2),(id_hall_17, 4, 3),(id_hall_17, 4, 4),(id_hall_17, 4, 5),(id_hall_17, 4, 6),(id_hall_17, 4, 7),(id_hall_17, 4, 8),
		(id_hall_17, 5, 1),(id_hall_17, 5, 2),(id_hall_17, 5, 3),(id_hall_17, 5, 4),(id_hall_17, 5, 5),(id_hall_17, 5, 6),(id_hall_17, 5, 7),(id_hall_17, 5, 8),
		(id_hall_17, 6, 1),(id_hall_17, 6, 2),(id_hall_17, 6, 3),(id_hall_17, 6, 4),(id_hall_17, 6, 5),(id_hall_17, 6, 6),(id_hall_17, 6, 7),(id_hall_17, 6, 8),
		(id_hall_17, 7, 1),(id_hall_17, 7, 2),(id_hall_17, 7, 3),(id_hall_17, 7, 4),(id_hall_17, 7, 5),(id_hall_17, 7, 6),(id_hall_17, 7, 7),(id_hall_17, 7, 8),
		(id_hall_18, 1, 1),(id_hall_18, 1, 2),(id_hall_18, 1, 3),(id_hall_18, 1, 4),(id_hall_18, 1, 5),(id_hall_18, 1, 6),(id_hall_18, 1, 7),(id_hall_18, 1, 8),
		(id_hall_18, 2, 1),(id_hall_18, 2, 2),(id_hall_18, 2, 3),(id_hall_18, 2, 4),(id_hall_18, 2, 5),(id_hall_18, 2, 6),(id_hall_18, 2, 7),(id_hall_18, 2, 8),
		(id_hall_18, 3, 1),(id_hall_18, 3, 2),(id_hall_18, 3, 3),(id_hall_18, 3, 4),(id_hall_18, 3, 5),(id_hall_18, 3, 6),(id_hall_18, 3, 7),(id_hall_18, 3, 8),
		(id_hall_18, 4, 1),(id_hall_18, 4, 2),(id_hall_18, 4, 3),(id_hall_18, 4, 4),(id_hall_18, 4, 5),(id_hall_18, 4, 6),(id_hall_18, 4, 7),(id_hall_18, 4, 8),
		(id_hall_18, 5, 1),(id_hall_18, 5, 2),(id_hall_18, 5, 3),(id_hall_18, 5, 4),(id_hall_18, 5, 5),(id_hall_18, 5, 6),(id_hall_18, 5, 7),(id_hall_18, 5, 8),
		(id_hall_18, 6, 1),(id_hall_18, 6, 2),(id_hall_18, 6, 3),(id_hall_18, 6, 4),(id_hall_18, 6, 5),(id_hall_18, 6, 6),(id_hall_18, 6, 7),(id_hall_18, 6, 8),
		(id_hall_18, 7, 1),(id_hall_18, 7, 2),(id_hall_18, 7, 3),(id_hall_18, 7, 4),(id_hall_18, 7, 5),(id_hall_18, 7, 6),(id_hall_18, 7, 7),(id_hall_18, 7, 8),
		(id_hall_19, 1, 1),(id_hall_19, 1, 2),(id_hall_19, 1, 3),(id_hall_19, 1, 4),(id_hall_19, 1, 5),(id_hall_19, 1, 6),(id_hall_19, 1, 7),(id_hall_19, 1, 8),
		(id_hall_19, 2, 1),(id_hall_19, 2, 2),(id_hall_19, 2, 3),(id_hall_19, 2, 4),(id_hall_19, 2, 5),(id_hall_19, 2, 6),(id_hall_19, 2, 7),(id_hall_19, 2, 8),
		(id_hall_19, 3, 1),(id_hall_19, 3, 2),(id_hall_19, 3, 3),(id_hall_19, 3, 4),(id_hall_19, 3, 5),(id_hall_19, 3, 6),(id_hall_19, 3, 7),(id_hall_19, 3, 8),
		(id_hall_19, 4, 1),(id_hall_19, 4, 2),(id_hall_19, 4, 3),(id_hall_19, 4, 4),(id_hall_19, 4, 5),(id_hall_19, 4, 6),(id_hall_19, 4, 7),(id_hall_19, 4, 8),
		(id_hall_19, 5, 1),(id_hall_19, 5, 2),(id_hall_19, 5, 3),(id_hall_19, 5, 4),(id_hall_19, 5, 5),(id_hall_19, 5, 6),(id_hall_19, 5, 7),(id_hall_19, 5, 8),
		(id_hall_19, 6, 1),(id_hall_19, 6, 2),(id_hall_19, 6, 3),(id_hall_19, 6, 4),(id_hall_19, 6, 5),(id_hall_19, 6, 6),(id_hall_19, 6, 7),(id_hall_19, 6, 8),
		(id_hall_19, 7, 1),(id_hall_19, 7, 2),(id_hall_19, 7, 3),(id_hall_19, 7, 4),(id_hall_19, 7, 5),(id_hall_19, 7, 6),(id_hall_19, 7, 7),(id_hall_19, 7, 8),
		(id_hall_20, 1, 1),(id_hall_20, 1, 2),(id_hall_20, 1, 3),(id_hall_20, 1, 4),(id_hall_20, 1, 5),(id_hall_20, 1, 6),(id_hall_20, 1, 7),(id_hall_20, 1, 8),
		(id_hall_20, 2, 1),(id_hall_20, 2, 2),(id_hall_20, 2, 3),(id_hall_20, 2, 4),(id_hall_20, 2, 5),(id_hall_20, 2, 6),(id_hall_20, 2, 7),(id_hall_20, 2, 8),
		(id_hall_20, 3, 1),(id_hall_20, 3, 2),(id_hall_20, 3, 3),(id_hall_20, 3, 4),(id_hall_20, 3, 5),(id_hall_20, 3, 6),(id_hall_20, 3, 7),(id_hall_20, 3, 8),
		(id_hall_20, 4, 1),(id_hall_20, 4, 2),(id_hall_20, 4, 3),(id_hall_20, 4, 4),(id_hall_20, 4, 5),(id_hall_20, 4, 6),(id_hall_20, 4, 7),(id_hall_20, 4, 8),
		(id_hall_20, 5, 1),(id_hall_20, 5, 2),(id_hall_20, 5, 3),(id_hall_20, 5, 4),(id_hall_20, 5, 5),(id_hall_20, 5, 6),(id_hall_20, 5, 7),(id_hall_20, 5, 8),
		(id_hall_20, 6, 1),(id_hall_20, 6, 2),(id_hall_20, 6, 3),(id_hall_20, 6, 4),(id_hall_20, 6, 5),(id_hall_20, 6, 6),(id_hall_20, 6, 7),(id_hall_20, 6, 8),
		(id_hall_20, 7, 1),(id_hall_20, 7, 2),(id_hall_20, 7, 3),(id_hall_20, 7, 4),(id_hall_20, 7, 5),(id_hall_20, 7, 6),(id_hall_20, 7, 7),(id_hall_20, 7, 8),
		(id_hall_21, 1, 1),(id_hall_21, 1, 2),(id_hall_21, 1, 3),(id_hall_21, 1, 4),(id_hall_21, 1, 5),(id_hall_21, 1, 6),(id_hall_21, 1, 7),(id_hall_21, 1, 8),
		(id_hall_21, 2, 1),(id_hall_21, 2, 2),(id_hall_21, 2, 3),(id_hall_21, 2, 4),(id_hall_21, 2, 5),(id_hall_21, 2, 6),(id_hall_21, 2, 7),(id_hall_21, 2, 8),
		(id_hall_21, 3, 1),(id_hall_21, 3, 2),(id_hall_21, 3, 3),(id_hall_21, 3, 4),(id_hall_21, 3, 5),(id_hall_21, 3, 6),(id_hall_21, 3, 7),(id_hall_21, 3, 8),
		(id_hall_21, 4, 1),(id_hall_21, 4, 2),(id_hall_21, 4, 3),(id_hall_21, 4, 4),(id_hall_21, 4, 5),(id_hall_21, 4, 6),(id_hall_21, 4, 7),(id_hall_21, 4, 8),
		(id_hall_21, 5, 1),(id_hall_21, 5, 2),(id_hall_21, 5, 3),(id_hall_21, 5, 4),(id_hall_21, 5, 5),(id_hall_21, 5, 6),(id_hall_21, 5, 7),(id_hall_21, 5, 8),
		(id_hall_21, 6, 1),(id_hall_21, 6, 2),(id_hall_21, 6, 3),(id_hall_21, 6, 4),(id_hall_21, 6, 5),(id_hall_21, 6, 6),(id_hall_21, 6, 7),(id_hall_21, 6, 8),
		(id_hall_21, 7, 1),(id_hall_21, 7, 2),(id_hall_21, 7, 3),(id_hall_21, 7, 4),(id_hall_21, 7, 5),(id_hall_21, 7, 6),(id_hall_21, 7, 7),(id_hall_21, 7, 8),
		(id_hall_22, 1, 1),(id_hall_22, 1, 2),(id_hall_22, 1, 3),(id_hall_22, 1, 4),(id_hall_22, 1, 5),(id_hall_22, 1, 6),(id_hall_22, 1, 7),(id_hall_22, 1, 8),
		(id_hall_22, 2, 1),(id_hall_22, 2, 2),(id_hall_22, 2, 3),(id_hall_22, 2, 4),(id_hall_22, 2, 5),(id_hall_22, 2, 6),(id_hall_22, 2, 7),(id_hall_22, 2, 8),
		(id_hall_22, 3, 1),(id_hall_22, 3, 2),(id_hall_22, 3, 3),(id_hall_22, 3, 4),(id_hall_22, 3, 5),(id_hall_22, 3, 6),(id_hall_22, 3, 7),(id_hall_22, 3, 8),
		(id_hall_22, 4, 1),(id_hall_22, 4, 2),(id_hall_22, 4, 3),(id_hall_22, 4, 4),(id_hall_22, 4, 5),(id_hall_22, 4, 6),(id_hall_22, 4, 7),(id_hall_22, 4, 8),
		(id_hall_22, 5, 1),(id_hall_22, 5, 2),(id_hall_22, 5, 3),(id_hall_22, 5, 4),(id_hall_22, 5, 5),(id_hall_22, 5, 6),(id_hall_22, 5, 7),(id_hall_22, 5, 8),
		(id_hall_22, 6, 1),(id_hall_22, 6, 2),(id_hall_22, 6, 3),(id_hall_22, 6, 4),(id_hall_22, 6, 5),(id_hall_22, 6, 6),(id_hall_22, 6, 7),(id_hall_22, 6, 8),
		(id_hall_22, 7, 1),(id_hall_22, 7, 2),(id_hall_22, 7, 3),(id_hall_22, 7, 4),(id_hall_22, 7, 5),(id_hall_22, 7, 6),(id_hall_22, 7, 7),(id_hall_22, 7, 8),
		(id_hall_23, 1, 1),(id_hall_23, 1, 2),(id_hall_23, 1, 3),(id_hall_23, 1, 4),(id_hall_23, 1, 5),(id_hall_23, 1, 6),(id_hall_23, 1, 7),(id_hall_23, 1, 8),
		(id_hall_23, 2, 1),(id_hall_23, 2, 2),(id_hall_23, 2, 3),(id_hall_23, 2, 4),(id_hall_23, 2, 5),(id_hall_23, 2, 6),(id_hall_23, 2, 7),(id_hall_23, 2, 8),
		(id_hall_23, 3, 1),(id_hall_23, 3, 2),(id_hall_23, 3, 3),(id_hall_23, 3, 4),(id_hall_23, 3, 5),(id_hall_23, 3, 6),(id_hall_23, 3, 7),(id_hall_23, 3, 8),
		(id_hall_23, 4, 1),(id_hall_23, 4, 2),(id_hall_23, 4, 3),(id_hall_23, 4, 4),(id_hall_23, 4, 5),(id_hall_23, 4, 6),(id_hall_23, 4, 7),(id_hall_23, 4, 8),
		(id_hall_23, 5, 1),(id_hall_23, 5, 2),(id_hall_23, 5, 3),(id_hall_23, 5, 4),(id_hall_23, 5, 5),(id_hall_23, 5, 6),(id_hall_23, 5, 7),(id_hall_23, 5, 8),
		(id_hall_23, 6, 1),(id_hall_23, 6, 2),(id_hall_23, 6, 3),(id_hall_23, 6, 4),(id_hall_23, 6, 5),(id_hall_23, 6, 6),(id_hall_23, 6, 7),(id_hall_23, 6, 8),
		(id_hall_23, 7, 1),(id_hall_23, 7, 2),(id_hall_23, 7, 3),(id_hall_23, 7, 4),(id_hall_23, 7, 5),(id_hall_23, 7, 6),(id_hall_23, 7, 7),(id_hall_23, 7, 8),
		(id_hall_24, 1, 1),(id_hall_24, 1, 2),(id_hall_24, 1, 3),(id_hall_24, 1, 4),(id_hall_24, 1, 5),(id_hall_24, 1, 6),(id_hall_24, 1, 7),(id_hall_24, 1, 8),
		(id_hall_24, 2, 1),(id_hall_24, 2, 2),(id_hall_24, 2, 3),(id_hall_24, 2, 4),(id_hall_24, 2, 5),(id_hall_24, 2, 6),(id_hall_24, 2, 7),(id_hall_24, 2, 8),
		(id_hall_24, 3, 1),(id_hall_24, 3, 2),(id_hall_24, 3, 3),(id_hall_24, 3, 4),(id_hall_24, 3, 5),(id_hall_24, 3, 6),(id_hall_24, 3, 7),(id_hall_24, 3, 8),
		(id_hall_24, 4, 1),(id_hall_24, 4, 2),(id_hall_24, 4, 3),(id_hall_24, 4, 4),(id_hall_24, 4, 5),(id_hall_24, 4, 6),(id_hall_24, 4, 7),(id_hall_24, 4, 8),
		(id_hall_24, 5, 1),(id_hall_24, 5, 2),(id_hall_24, 5, 3),(id_hall_24, 5, 4),(id_hall_24, 5, 5),(id_hall_24, 5, 6),(id_hall_24, 5, 7),(id_hall_24, 5, 8),
		(id_hall_24, 6, 1),(id_hall_24, 6, 2),(id_hall_24, 6, 3),(id_hall_24, 6, 4),(id_hall_24, 6, 5),(id_hall_24, 6, 6),(id_hall_24, 6, 7),(id_hall_24, 6, 8),
		(id_hall_24, 7, 1),(id_hall_24, 7, 2),(id_hall_24, 7, 3),(id_hall_24, 7, 4),(id_hall_24, 7, 5),(id_hall_24, 7, 6),(id_hall_24, 7, 7),(id_hall_24, 7, 8),
		(id_hall_25, 1, 1),(id_hall_25, 1, 2),(id_hall_25, 1, 3),(id_hall_25, 1, 4),(id_hall_25, 1, 5),(id_hall_25, 1, 6),(id_hall_25, 1, 7),(id_hall_25, 1, 8),
		(id_hall_25, 2, 1),(id_hall_25, 2, 2),(id_hall_25, 2, 3),(id_hall_25, 2, 4),(id_hall_25, 2, 5),(id_hall_25, 2, 6),(id_hall_25, 2, 7),(id_hall_25, 2, 8),
		(id_hall_25, 3, 1),(id_hall_25, 3, 2),(id_hall_25, 3, 3),(id_hall_25, 3, 4),(id_hall_25, 3, 5),(id_hall_25, 3, 6),(id_hall_25, 3, 7),(id_hall_25, 3, 8),
		(id_hall_25, 4, 1),(id_hall_25, 4, 2),(id_hall_25, 4, 3),(id_hall_25, 4, 4),(id_hall_25, 4, 5),(id_hall_25, 4, 6),(id_hall_25, 4, 7),(id_hall_25, 4, 8),
		(id_hall_25, 5, 1),(id_hall_25, 5, 2),(id_hall_25, 5, 3),(id_hall_25, 5, 4),(id_hall_25, 5, 5),(id_hall_25, 5, 6),(id_hall_25, 5, 7),(id_hall_25, 5, 8),
		(id_hall_25, 6, 1),(id_hall_25, 6, 2),(id_hall_25, 6, 3),(id_hall_25, 6, 4),(id_hall_25, 6, 5),(id_hall_25, 6, 6),(id_hall_25, 6, 7),(id_hall_25, 6, 8),
		(id_hall_25, 7, 1),(id_hall_25, 7, 2),(id_hall_25, 7, 3),(id_hall_25, 7, 4),(id_hall_25, 7, 5),(id_hall_25, 7, 6),(id_hall_25, 7, 7),(id_hall_25, 7, 8),
		(id_hall_26, 1, 1),(id_hall_26, 1, 2),(id_hall_26, 1, 3),(id_hall_26, 1, 4),(id_hall_26, 1, 5),(id_hall_26, 1, 6),(id_hall_26, 1, 7),(id_hall_26, 1, 8),
		(id_hall_26, 2, 1),(id_hall_26, 2, 2),(id_hall_26, 2, 3),(id_hall_26, 2, 4),(id_hall_26, 2, 5),(id_hall_26, 2, 6),(id_hall_26, 2, 7),(id_hall_26, 2, 8),
		(id_hall_26, 3, 1),(id_hall_26, 3, 2),(id_hall_26, 3, 3),(id_hall_26, 3, 4),(id_hall_26, 3, 5),(id_hall_26, 3, 6),(id_hall_26, 3, 7),(id_hall_26, 3, 8),
		(id_hall_26, 4, 1),(id_hall_26, 4, 2),(id_hall_26, 4, 3),(id_hall_26, 4, 4),(id_hall_26, 4, 5),(id_hall_26, 4, 6),(id_hall_26, 4, 7),(id_hall_26, 4, 8),
		(id_hall_26, 5, 1),(id_hall_26, 5, 2),(id_hall_26, 5, 3),(id_hall_26, 5, 4),(id_hall_26, 5, 5),(id_hall_26, 5, 6),(id_hall_26, 5, 7),(id_hall_26, 5, 8),
		(id_hall_26, 6, 1),(id_hall_26, 6, 2),(id_hall_26, 6, 3),(id_hall_26, 6, 4),(id_hall_26, 6, 5),(id_hall_26, 6, 6),(id_hall_26, 6, 7),(id_hall_26, 6, 8),
		(id_hall_26, 7, 1),(id_hall_26, 7, 2),(id_hall_26, 7, 3),(id_hall_26, 7, 4),(id_hall_26, 7, 5),(id_hall_26, 7, 6),(id_hall_26, 7, 7),(id_hall_26, 7, 8),
		(id_hall_27, 1, 1),(id_hall_27, 1, 2),(id_hall_27, 1, 3),(id_hall_27, 1, 4),(id_hall_27, 1, 5),(id_hall_27, 1, 6),(id_hall_27, 1, 7),(id_hall_27, 1, 8),
		(id_hall_27, 2, 1),(id_hall_27, 2, 2),(id_hall_27, 2, 3),(id_hall_27, 2, 4),(id_hall_27, 2, 5),(id_hall_27, 2, 6),(id_hall_27, 2, 7),(id_hall_27, 2, 8),
		(id_hall_27, 3, 1),(id_hall_27, 3, 2),(id_hall_27, 3, 3),(id_hall_27, 3, 4),(id_hall_27, 3, 5),(id_hall_27, 3, 6),(id_hall_27, 3, 7),(id_hall_27, 3, 8),
		(id_hall_27, 4, 1),(id_hall_27, 4, 2),(id_hall_27, 4, 3),(id_hall_27, 4, 4),(id_hall_27, 4, 5),(id_hall_27, 4, 6),(id_hall_27, 4, 7),(id_hall_27, 4, 8),
		(id_hall_27, 5, 1),(id_hall_27, 5, 2),(id_hall_27, 5, 3),(id_hall_27, 5, 4),(id_hall_27, 5, 5),(id_hall_27, 5, 6),(id_hall_27, 5, 7),(id_hall_27, 5, 8),
		(id_hall_27, 6, 1),(id_hall_27, 6, 2),(id_hall_27, 6, 3),(id_hall_27, 6, 4),(id_hall_27, 6, 5),(id_hall_27, 6, 6),(id_hall_27, 6, 7),(id_hall_27, 6, 8),
		(id_hall_27, 7, 1),(id_hall_27, 7, 2),(id_hall_27, 7, 3),(id_hall_27, 7, 4),(id_hall_27, 7, 5),(id_hall_27, 7, 6),(id_hall_27, 7, 7),(id_hall_27, 7, 8),
		(id_hall_28, 1, 1),(id_hall_28, 1, 2),(id_hall_28, 1, 3),(id_hall_28, 1, 4),(id_hall_28, 1, 5),(id_hall_28, 1, 6),(id_hall_28, 1, 7),(id_hall_28, 1, 8),
		(id_hall_28, 2, 1),(id_hall_28, 2, 2),(id_hall_28, 2, 3),(id_hall_28, 2, 4),(id_hall_28, 2, 5),(id_hall_28, 2, 6),(id_hall_28, 2, 7),(id_hall_28, 2, 8),
		(id_hall_28, 3, 1),(id_hall_28, 3, 2),(id_hall_28, 3, 3),(id_hall_28, 3, 4),(id_hall_28, 3, 5),(id_hall_28, 3, 6),(id_hall_28, 3, 7),(id_hall_28, 3, 8),
		(id_hall_28, 4, 1),(id_hall_28, 4, 2),(id_hall_28, 4, 3),(id_hall_28, 4, 4),(id_hall_28, 4, 5),(id_hall_28, 4, 6),(id_hall_28, 4, 7),(id_hall_28, 4, 8),
		(id_hall_28, 5, 1),(id_hall_28, 5, 2),(id_hall_28, 5, 3),(id_hall_28, 5, 4),(id_hall_28, 5, 5),(id_hall_28, 5, 6),(id_hall_28, 5, 7),(id_hall_28, 5, 8),
		(id_hall_28, 6, 1),(id_hall_28, 6, 2),(id_hall_28, 6, 3),(id_hall_28, 6, 4),(id_hall_28, 6, 5),(id_hall_28, 6, 6),(id_hall_28, 6, 7),(id_hall_28, 6, 8),
		(id_hall_28, 7, 1),(id_hall_28, 7, 2),(id_hall_28, 7, 3),(id_hall_28, 7, 4),(id_hall_28, 7, 5),(id_hall_28, 7, 6),(id_hall_28, 7, 7),(id_hall_28, 7, 8),
		(id_hall_29, 1, 1),(id_hall_29, 1, 2),(id_hall_29, 1, 3),(id_hall_29, 1, 4),(id_hall_29, 1, 5),(id_hall_29, 1, 6),(id_hall_29, 1, 7),(id_hall_29, 1, 8),
		(id_hall_29, 2, 1),(id_hall_29, 2, 2),(id_hall_29, 2, 3),(id_hall_29, 2, 4),(id_hall_29, 2, 5),(id_hall_29, 2, 6),(id_hall_29, 2, 7),(id_hall_29, 2, 8),
		(id_hall_29, 3, 1),(id_hall_29, 3, 2),(id_hall_29, 3, 3),(id_hall_29, 3, 4),(id_hall_29, 3, 5),(id_hall_29, 3, 6),(id_hall_29, 3, 7),(id_hall_29, 3, 8),
		(id_hall_29, 4, 1),(id_hall_29, 4, 2),(id_hall_29, 4, 3),(id_hall_29, 4, 4),(id_hall_29, 4, 5),(id_hall_29, 4, 6),(id_hall_29, 4, 7),(id_hall_29, 4, 8),
		(id_hall_29, 5, 1),(id_hall_29, 5, 2),(id_hall_29, 5, 3),(id_hall_29, 5, 4),(id_hall_29, 5, 5),(id_hall_29, 5, 6),(id_hall_29, 5, 7),(id_hall_29, 5, 8),
		(id_hall_29, 6, 1),(id_hall_29, 6, 2),(id_hall_29, 6, 3),(id_hall_29, 6, 4),(id_hall_29, 6, 5),(id_hall_29, 6, 6),(id_hall_29, 6, 7),(id_hall_29, 6, 8),
		(id_hall_29, 7, 1),(id_hall_29, 7, 2),(id_hall_29, 7, 3),(id_hall_29, 7, 4),(id_hall_29, 7, 5),(id_hall_29, 7, 6),(id_hall_29, 7, 7),(id_hall_29, 7, 8),
		(id_hall_30, 1, 1),(id_hall_30, 1, 2),(id_hall_30, 1, 3),(id_hall_30, 1, 4),(id_hall_30, 1, 5),(id_hall_30, 1, 6),(id_hall_30, 1, 7),(id_hall_30, 1, 8),
		(id_hall_30, 2, 1),(id_hall_30, 2, 2),(id_hall_30, 2, 3),(id_hall_30, 2, 4),(id_hall_30, 2, 5),(id_hall_30, 2, 6),(id_hall_30, 2, 7),(id_hall_30, 2, 8),
		(id_hall_30, 3, 1),(id_hall_30, 3, 2),(id_hall_30, 3, 3),(id_hall_30, 3, 4),(id_hall_30, 3, 5),(id_hall_30, 3, 6),(id_hall_30, 3, 7),(id_hall_30, 3, 8),
		(id_hall_30, 4, 1),(id_hall_30, 4, 2),(id_hall_30, 4, 3),(id_hall_30, 4, 4),(id_hall_30, 4, 5),(id_hall_30, 4, 6),(id_hall_30, 4, 7),(id_hall_30, 4, 8),
		(id_hall_30, 5, 1),(id_hall_30, 5, 2),(id_hall_30, 5, 3),(id_hall_30, 5, 4),(id_hall_30, 5, 5),(id_hall_30, 5, 6),(id_hall_30, 5, 7),(id_hall_30, 5, 8),
		(id_hall_30, 6, 1),(id_hall_30, 6, 2),(id_hall_30, 6, 3),(id_hall_30, 6, 4),(id_hall_30, 6, 5),(id_hall_30, 6, 6),(id_hall_30, 6, 7),(id_hall_30, 6, 8),
		(id_hall_30, 7, 1),(id_hall_30, 7, 2),(id_hall_30, 7, 3),(id_hall_30, 7, 4),(id_hall_30, 7, 5),(id_hall_30, 7, 6),(id_hall_30, 7, 7),(id_hall_30, 7, 8),
		(id_hall_31, 1, 1),(id_hall_31, 1, 2),(id_hall_31, 1, 3),(id_hall_31, 1, 4),(id_hall_31, 1, 5),(id_hall_31, 1, 6),(id_hall_31, 1, 7),(id_hall_31, 1, 8),
		(id_hall_31, 2, 1),(id_hall_31, 2, 2),(id_hall_31, 2, 3),(id_hall_31, 2, 4),(id_hall_31, 2, 5),(id_hall_31, 2, 6),(id_hall_31, 2, 7),(id_hall_31, 2, 8),
		(id_hall_31, 3, 1),(id_hall_31, 3, 2),(id_hall_31, 3, 3),(id_hall_31, 3, 4),(id_hall_31, 3, 5),(id_hall_31, 3, 6),(id_hall_31, 3, 7),(id_hall_31, 3, 8),
		(id_hall_31, 4, 1),(id_hall_31, 4, 2),(id_hall_31, 4, 3),(id_hall_31, 4, 4),(id_hall_31, 4, 5),(id_hall_31, 4, 6),(id_hall_31, 4, 7),(id_hall_31, 4, 8),
		(id_hall_31, 5, 1),(id_hall_31, 5, 2),(id_hall_31, 5, 3),(id_hall_31, 5, 4),(id_hall_31, 5, 5),(id_hall_31, 5, 6),(id_hall_31, 5, 7),(id_hall_31, 5, 8),
		(id_hall_31, 6, 1),(id_hall_31, 6, 2),(id_hall_31, 6, 3),(id_hall_31, 6, 4),(id_hall_31, 6, 5),(id_hall_31, 6, 6),(id_hall_31, 6, 7),(id_hall_31, 6, 8),
		(id_hall_31, 7, 1),(id_hall_31, 7, 2),(id_hall_31, 7, 3),(id_hall_31, 7, 4),(id_hall_31, 7, 5),(id_hall_31, 7, 6),(id_hall_31, 7, 7),(id_hall_31, 7, 8),
		(id_hall_32, 1, 1),(id_hall_32, 1, 2),(id_hall_32, 1, 3),(id_hall_32, 1, 4),(id_hall_32, 1, 5),(id_hall_32, 1, 6),(id_hall_32, 1, 7),(id_hall_32, 1, 8),
		(id_hall_32, 2, 1),(id_hall_32, 2, 2),(id_hall_32, 2, 3),(id_hall_32, 2, 4),(id_hall_32, 2, 5),(id_hall_32, 2, 6),(id_hall_32, 2, 7),(id_hall_32, 2, 8),
		(id_hall_32, 3, 1),(id_hall_32, 3, 2),(id_hall_32, 3, 3),(id_hall_32, 3, 4),(id_hall_32, 3, 5),(id_hall_32, 3, 6),(id_hall_32, 3, 7),(id_hall_32, 3, 8),
		(id_hall_32, 4, 1),(id_hall_32, 4, 2),(id_hall_32, 4, 3),(id_hall_32, 4, 4),(id_hall_32, 4, 5),(id_hall_32, 4, 6),(id_hall_32, 4, 7),(id_hall_32, 4, 8),
		(id_hall_32, 5, 1),(id_hall_32, 5, 2),(id_hall_32, 5, 3),(id_hall_32, 5, 4),(id_hall_32, 5, 5),(id_hall_32, 5, 6),(id_hall_32, 5, 7),(id_hall_32, 5, 8),
		(id_hall_32, 6, 1),(id_hall_32, 6, 2),(id_hall_32, 6, 3),(id_hall_32, 6, 4),(id_hall_32, 6, 5),(id_hall_32, 6, 6),(id_hall_32, 6, 7),(id_hall_32, 6, 8),
		(id_hall_32, 7, 1),(id_hall_32, 7, 2),(id_hall_32, 7, 3),(id_hall_32, 7, 4),(id_hall_32, 7, 5),(id_hall_32, 7, 6),(id_hall_32, 7, 7),(id_hall_32, 7, 8),
		(id_hall_33, 1, 1),(id_hall_33, 1, 2),(id_hall_33, 1, 3),(id_hall_33, 1, 4),(id_hall_33, 1, 5),(id_hall_33, 1, 6),(id_hall_33, 1, 7),(id_hall_33, 1, 8),
		(id_hall_33, 2, 1),(id_hall_33, 2, 2),(id_hall_33, 2, 3),(id_hall_33, 2, 4),(id_hall_33, 2, 5),(id_hall_33, 2, 6),(id_hall_33, 2, 7),(id_hall_33, 2, 8),
		(id_hall_33, 3, 1),(id_hall_33, 3, 2),(id_hall_33, 3, 3),(id_hall_33, 3, 4),(id_hall_33, 3, 5),(id_hall_33, 3, 6),(id_hall_33, 3, 7),(id_hall_33, 3, 8),
		(id_hall_33, 4, 1),(id_hall_33, 4, 2),(id_hall_33, 4, 3),(id_hall_33, 4, 4),(id_hall_33, 4, 5),(id_hall_33, 4, 6),(id_hall_33, 4, 7),(id_hall_33, 4, 8),
		(id_hall_33, 5, 1),(id_hall_33, 5, 2),(id_hall_33, 5, 3),(id_hall_33, 5, 4),(id_hall_33, 5, 5),(id_hall_33, 5, 6),(id_hall_33, 5, 7),(id_hall_33, 5, 8),
		(id_hall_33, 6, 1),(id_hall_33, 6, 2),(id_hall_33, 6, 3),(id_hall_33, 6, 4),(id_hall_33, 6, 5),(id_hall_33, 6, 6),(id_hall_33, 6, 7),(id_hall_33, 6, 8),
		(id_hall_33, 7, 1),(id_hall_33, 7, 2),(id_hall_33, 7, 3),(id_hall_33, 7, 4),(id_hall_33, 7, 5),(id_hall_33, 7, 6),(id_hall_33, 7, 7),(id_hall_33, 7, 8),
		(id_hall_34, 1, 1),(id_hall_34, 1, 2),(id_hall_34, 1, 3),(id_hall_34, 1, 4),(id_hall_34, 1, 5),(id_hall_34, 1, 6),(id_hall_34, 1, 7),(id_hall_34, 1, 8),
		(id_hall_34, 2, 1),(id_hall_34, 2, 2),(id_hall_34, 2, 3),(id_hall_34, 2, 4),(id_hall_34, 2, 5),(id_hall_34, 2, 6),(id_hall_34, 2, 7),(id_hall_34, 2, 8),
		(id_hall_34, 3, 1),(id_hall_34, 3, 2),(id_hall_34, 3, 3),(id_hall_34, 3, 4),(id_hall_34, 3, 5),(id_hall_34, 3, 6),(id_hall_34, 3, 7),(id_hall_34, 3, 8),
		(id_hall_34, 4, 1),(id_hall_34, 4, 2),(id_hall_34, 4, 3),(id_hall_34, 4, 4),(id_hall_34, 4, 5),(id_hall_34, 4, 6),(id_hall_34, 4, 7),(id_hall_34, 4, 8),
		(id_hall_34, 5, 1),(id_hall_34, 5, 2),(id_hall_34, 5, 3),(id_hall_34, 5, 4),(id_hall_34, 5, 5),(id_hall_34, 5, 6),(id_hall_34, 5, 7),(id_hall_34, 5, 8),
		(id_hall_34, 6, 1),(id_hall_34, 6, 2),(id_hall_34, 6, 3),(id_hall_34, 6, 4),(id_hall_34, 6, 5),(id_hall_34, 6, 6),(id_hall_34, 6, 7),(id_hall_34, 6, 8),
		(id_hall_34, 7, 1),(id_hall_34, 7, 2),(id_hall_34, 7, 3),(id_hall_34, 7, 4),(id_hall_34, 7, 5),(id_hall_34, 7, 6),(id_hall_34, 7, 7),(id_hall_34, 7, 8),
		(id_hall_35, 1, 1),(id_hall_35, 1, 2),(id_hall_35, 1, 3),(id_hall_35, 1, 4),(id_hall_35, 1, 5),(id_hall_35, 1, 6),(id_hall_35, 1, 7),(id_hall_35, 1, 8),
		(id_hall_35, 2, 1),(id_hall_35, 2, 2),(id_hall_35, 2, 3),(id_hall_35, 2, 4),(id_hall_35, 2, 5),(id_hall_35, 2, 6),(id_hall_35, 2, 7),(id_hall_35, 2, 8),
		(id_hall_35, 3, 1),(id_hall_35, 3, 2),(id_hall_35, 3, 3),(id_hall_35, 3, 4),(id_hall_35, 3, 5),(id_hall_35, 3, 6),(id_hall_35, 3, 7),(id_hall_35, 3, 8),
		(id_hall_35, 4, 1),(id_hall_35, 4, 2),(id_hall_35, 4, 3),(id_hall_35, 4, 4),(id_hall_35, 4, 5),(id_hall_35, 4, 6),(id_hall_35, 4, 7),(id_hall_35, 4, 8),
		(id_hall_35, 5, 1),(id_hall_35, 5, 2),(id_hall_35, 5, 3),(id_hall_35, 5, 4),(id_hall_35, 5, 5),(id_hall_35, 5, 6),(id_hall_35, 5, 7),(id_hall_35, 5, 8),
		(id_hall_35, 6, 1),(id_hall_35, 6, 2),(id_hall_35, 6, 3),(id_hall_35, 6, 4),(id_hall_35, 6, 5),(id_hall_35, 6, 6),(id_hall_35, 6, 7),(id_hall_35, 6, 8),
		(id_hall_35, 7, 1),(id_hall_35, 7, 2),(id_hall_35, 7, 3),(id_hall_35, 7, 4),(id_hall_35, 7, 5),(id_hall_35, 7, 6),(id_hall_35, 7, 7),(id_hall_35, 7, 8),
		(id_hall_36, 1, 1),(id_hall_36, 1, 2),(id_hall_36, 1, 3),(id_hall_36, 1, 4),(id_hall_36, 1, 5),(id_hall_36, 1, 6),(id_hall_36, 1, 7),(id_hall_36, 1, 8),
		(id_hall_36, 2, 1),(id_hall_36, 2, 2),(id_hall_36, 2, 3),(id_hall_36, 2, 4),(id_hall_36, 2, 5),(id_hall_36, 2, 6),(id_hall_36, 2, 7),(id_hall_36, 2, 8),
		(id_hall_36, 3, 1),(id_hall_36, 3, 2),(id_hall_36, 3, 3),(id_hall_36, 3, 4),(id_hall_36, 3, 5),(id_hall_36, 3, 6),(id_hall_36, 3, 7),(id_hall_36, 3, 8),
		(id_hall_36, 4, 1),(id_hall_36, 4, 2),(id_hall_36, 4, 3),(id_hall_36, 4, 4),(id_hall_36, 4, 5),(id_hall_36, 4, 6),(id_hall_36, 4, 7),(id_hall_36, 4, 8),
		(id_hall_36, 5, 1),(id_hall_36, 5, 2),(id_hall_36, 5, 3),(id_hall_36, 5, 4),(id_hall_36, 5, 5),(id_hall_36, 5, 6),(id_hall_36, 5, 7),(id_hall_36, 5, 8),
		(id_hall_36, 6, 1),(id_hall_36, 6, 2),(id_hall_36, 6, 3),(id_hall_36, 6, 4),(id_hall_36, 6, 5),(id_hall_36, 6, 6),(id_hall_36, 6, 7),(id_hall_36, 6, 8),
		(id_hall_36, 7, 1),(id_hall_36, 7, 2),(id_hall_36, 7, 3),(id_hall_36, 7, 4),(id_hall_36, 7, 5),(id_hall_36, 7, 6),(id_hall_36, 7, 7),(id_hall_36, 7, 8),
		(id_hall_37, 1, 1),(id_hall_37, 1, 2),(id_hall_37, 1, 3),(id_hall_37, 1, 4),(id_hall_37, 1, 5),(id_hall_37, 1, 6),(id_hall_37, 1, 7),(id_hall_37, 1, 8),
		(id_hall_37, 2, 1),(id_hall_37, 2, 2),(id_hall_37, 2, 3),(id_hall_37, 2, 4),(id_hall_37, 2, 5),(id_hall_37, 2, 6),(id_hall_37, 2, 7),(id_hall_37, 2, 8),
		(id_hall_37, 3, 1),(id_hall_37, 3, 2),(id_hall_37, 3, 3),(id_hall_37, 3, 4),(id_hall_37, 3, 5),(id_hall_37, 3, 6),(id_hall_37, 3, 7),(id_hall_37, 3, 8),
		(id_hall_37, 4, 1),(id_hall_37, 4, 2),(id_hall_37, 4, 3),(id_hall_37, 4, 4),(id_hall_37, 4, 5),(id_hall_37, 4, 6),(id_hall_37, 4, 7),(id_hall_37, 4, 8),
		(id_hall_37, 5, 1),(id_hall_37, 5, 2),(id_hall_37, 5, 3),(id_hall_37, 5, 4),(id_hall_37, 5, 5),(id_hall_37, 5, 6),(id_hall_37, 5, 7),(id_hall_37, 5, 8),
		(id_hall_37, 6, 1),(id_hall_37, 6, 2),(id_hall_37, 6, 3),(id_hall_37, 6, 4),(id_hall_37, 6, 5),(id_hall_37, 6, 6),(id_hall_37, 6, 7),(id_hall_37, 6, 8),
		(id_hall_37, 7, 1),(id_hall_37, 7, 2),(id_hall_37, 7, 3),(id_hall_37, 7, 4),(id_hall_37, 7, 5),(id_hall_37, 7, 6),(id_hall_37, 7, 7),(id_hall_37, 7, 8),
		(id_hall_38, 1, 1),(id_hall_38, 1, 2),(id_hall_38, 1, 3),(id_hall_38, 1, 4),(id_hall_38, 1, 5),(id_hall_38, 1, 6),(id_hall_38, 1, 7),(id_hall_38, 1, 8),
		(id_hall_38, 2, 1),(id_hall_38, 2, 2),(id_hall_38, 2, 3),(id_hall_38, 2, 4),(id_hall_38, 2, 5),(id_hall_38, 2, 6),(id_hall_38, 2, 7),(id_hall_38, 2, 8),
		(id_hall_38, 3, 1),(id_hall_38, 3, 2),(id_hall_38, 3, 3),(id_hall_38, 3, 4),(id_hall_38, 3, 5),(id_hall_38, 3, 6),(id_hall_38, 3, 7),(id_hall_38, 3, 8),
		(id_hall_38, 4, 1),(id_hall_38, 4, 2),(id_hall_38, 4, 3),(id_hall_38, 4, 4),(id_hall_38, 4, 5),(id_hall_38, 4, 6),(id_hall_38, 4, 7),(id_hall_38, 4, 8),
		(id_hall_38, 5, 1),(id_hall_38, 5, 2),(id_hall_38, 5, 3),(id_hall_38, 5, 4),(id_hall_38, 5, 5),(id_hall_38, 5, 6),(id_hall_38, 5, 7),(id_hall_38, 5, 8),
		(id_hall_38, 6, 1),(id_hall_38, 6, 2),(id_hall_38, 6, 3),(id_hall_38, 6, 4),(id_hall_38, 6, 5),(id_hall_38, 6, 6),(id_hall_38, 6, 7),(id_hall_38, 6, 8),
		(id_hall_38, 7, 1),(id_hall_38, 7, 2),(id_hall_38, 7, 3),(id_hall_38, 7, 4),(id_hall_38, 7, 5),(id_hall_38, 7, 6),(id_hall_38, 7, 7),(id_hall_38, 7, 8),
		(id_hall_39, 1, 1),(id_hall_39, 1, 2),(id_hall_39, 1, 3),(id_hall_39, 1, 4),(id_hall_39, 1, 5),(id_hall_39, 1, 6),(id_hall_39, 1, 7),(id_hall_39, 1, 8),
		(id_hall_39, 2, 1),(id_hall_39, 2, 2),(id_hall_39, 2, 3),(id_hall_39, 2, 4),(id_hall_39, 2, 5),(id_hall_39, 2, 6),(id_hall_39, 2, 7),(id_hall_39, 2, 8),
		(id_hall_39, 3, 1),(id_hall_39, 3, 2),(id_hall_39, 3, 3),(id_hall_39, 3, 4),(id_hall_39, 3, 5),(id_hall_39, 3, 6),(id_hall_39, 3, 7),(id_hall_39, 3, 8),
		(id_hall_39, 4, 1),(id_hall_39, 4, 2),(id_hall_39, 4, 3),(id_hall_39, 4, 4),(id_hall_39, 4, 5),(id_hall_39, 4, 6),(id_hall_39, 4, 7),(id_hall_39, 4, 8),
		(id_hall_39, 5, 1),(id_hall_39, 5, 2),(id_hall_39, 5, 3),(id_hall_39, 5, 4),(id_hall_39, 5, 5),(id_hall_39, 5, 6),(id_hall_39, 5, 7),(id_hall_39, 5, 8),
		(id_hall_39, 6, 1),(id_hall_39, 6, 2),(id_hall_39, 6, 3),(id_hall_39, 6, 4),(id_hall_39, 6, 5),(id_hall_39, 6, 6),(id_hall_39, 6, 7),(id_hall_39, 6, 8),
		(id_hall_39, 7, 1),(id_hall_39, 7, 2),(id_hall_39, 7, 3),(id_hall_39, 7, 4),(id_hall_39, 7, 5),(id_hall_39, 7, 6),(id_hall_39, 7, 7),(id_hall_39, 7, 8),
		(id_hall_40, 1, 1),(id_hall_40, 1, 2),(id_hall_40, 1, 3),(id_hall_40, 1, 4),(id_hall_40, 1, 5),(id_hall_40, 1, 6),(id_hall_40, 1, 7),(id_hall_40, 1, 8),
		(id_hall_40, 2, 1),(id_hall_40, 2, 2),(id_hall_40, 2, 3),(id_hall_40, 2, 4),(id_hall_40, 2, 5),(id_hall_40, 2, 6),(id_hall_40, 2, 7),(id_hall_40, 2, 8),
		(id_hall_40, 3, 1),(id_hall_40, 3, 2),(id_hall_40, 3, 3),(id_hall_40, 3, 4),(id_hall_40, 3, 5),(id_hall_40, 3, 6),(id_hall_40, 3, 7),(id_hall_40, 3, 8),
		(id_hall_40, 4, 1),(id_hall_40, 4, 2),(id_hall_40, 4, 3),(id_hall_40, 4, 4),(id_hall_40, 4, 5),(id_hall_40, 4, 6),(id_hall_40, 4, 7),(id_hall_40, 4, 8),
		(id_hall_40, 5, 1),(id_hall_40, 5, 2),(id_hall_40, 5, 3),(id_hall_40, 5, 4),(id_hall_40, 5, 5),(id_hall_40, 5, 6),(id_hall_40, 5, 7),(id_hall_40, 5, 8),
		(id_hall_40, 6, 1),(id_hall_40, 6, 2),(id_hall_40, 6, 3),(id_hall_40, 6, 4),(id_hall_40, 6, 5),(id_hall_40, 6, 6),(id_hall_40, 6, 7),(id_hall_40, 6, 8),
		(id_hall_40, 7, 1),(id_hall_40, 7, 2),(id_hall_40, 7, 3),(id_hall_40, 7, 4),(id_hall_40, 7, 5),(id_hall_40, 7, 6),(id_hall_40, 7, 7),(id_hall_40, 7, 8),
		(id_hall_41, 1, 1),(id_hall_41, 1, 2),(id_hall_41, 1, 3),(id_hall_41, 1, 4),(id_hall_41, 1, 5),(id_hall_41, 1, 6),(id_hall_41, 1, 7),(id_hall_41, 1, 8),
		(id_hall_41, 2, 1),(id_hall_41, 2, 2),(id_hall_41, 2, 3),(id_hall_41, 2, 4),(id_hall_41, 2, 5),(id_hall_41, 2, 6),(id_hall_41, 2, 7),(id_hall_41, 2, 8),
		(id_hall_41, 3, 1),(id_hall_41, 3, 2),(id_hall_41, 3, 3),(id_hall_41, 3, 4),(id_hall_41, 3, 5),(id_hall_41, 3, 6),(id_hall_41, 3, 7),(id_hall_41, 3, 8),
		(id_hall_41, 4, 1),(id_hall_41, 4, 2),(id_hall_41, 4, 3),(id_hall_41, 4, 4),(id_hall_41, 4, 5),(id_hall_41, 4, 6),(id_hall_41, 4, 7),(id_hall_41, 4, 8),
		(id_hall_41, 5, 1),(id_hall_41, 5, 2),(id_hall_41, 5, 3),(id_hall_41, 5, 4),(id_hall_41, 5, 5),(id_hall_41, 5, 6),(id_hall_41, 5, 7),(id_hall_41, 5, 8),
		(id_hall_41, 6, 1),(id_hall_41, 6, 2),(id_hall_41, 6, 3),(id_hall_41, 6, 4),(id_hall_41, 6, 5),(id_hall_41, 6, 6),(id_hall_41, 6, 7),(id_hall_41, 6, 8),
		(id_hall_41, 7, 1),(id_hall_41, 7, 2),(id_hall_41, 7, 3),(id_hall_41, 7, 4),(id_hall_41, 7, 5),(id_hall_41, 7, 6),(id_hall_41, 7, 7),(id_hall_41, 7, 8),
		(id_hall_42, 1, 1),(id_hall_42, 1, 2),(id_hall_42, 1, 3),(id_hall_42, 1, 4),(id_hall_42, 1, 5),(id_hall_42, 1, 6),(id_hall_42, 1, 7),(id_hall_42, 1, 8),
		(id_hall_42, 2, 1),(id_hall_42, 2, 2),(id_hall_42, 2, 3),(id_hall_42, 2, 4),(id_hall_42, 2, 5),(id_hall_42, 2, 6),(id_hall_42, 2, 7),(id_hall_42, 2, 8),
		(id_hall_42, 3, 1),(id_hall_42, 3, 2),(id_hall_42, 3, 3),(id_hall_42, 3, 4),(id_hall_42, 3, 5),(id_hall_42, 3, 6),(id_hall_42, 3, 7),(id_hall_42, 3, 8),
		(id_hall_42, 4, 1),(id_hall_42, 4, 2),(id_hall_42, 4, 3),(id_hall_42, 4, 4),(id_hall_42, 4, 5),(id_hall_42, 4, 6),(id_hall_42, 4, 7),(id_hall_42, 4, 8),
		(id_hall_42, 5, 1),(id_hall_42, 5, 2),(id_hall_42, 5, 3),(id_hall_42, 5, 4),(id_hall_42, 5, 5),(id_hall_42, 5, 6),(id_hall_42, 5, 7),(id_hall_42, 5, 8),
		(id_hall_42, 6, 1),(id_hall_42, 6, 2),(id_hall_42, 6, 3),(id_hall_42, 6, 4),(id_hall_42, 6, 5),(id_hall_42, 6, 6),(id_hall_42, 6, 7),(id_hall_42, 6, 8),
		(id_hall_42, 7, 1),(id_hall_42, 7, 2),(id_hall_42, 7, 3),(id_hall_42, 7, 4),(id_hall_42, 7, 5),(id_hall_42, 7, 6),(id_hall_42, 7, 7),(id_hall_42, 7, 8),
		(id_hall_43, 1, 1),(id_hall_43, 1, 2),(id_hall_43, 1, 3),(id_hall_43, 1, 4),(id_hall_43, 1, 5),(id_hall_43, 1, 6),(id_hall_43, 1, 7),(id_hall_43, 1, 8),
		(id_hall_43, 2, 1),(id_hall_43, 2, 2),(id_hall_43, 2, 3),(id_hall_43, 2, 4),(id_hall_43, 2, 5),(id_hall_43, 2, 6),(id_hall_43, 2, 7),(id_hall_43, 2, 8),
		(id_hall_43, 3, 1),(id_hall_43, 3, 2),(id_hall_43, 3, 3),(id_hall_43, 3, 4),(id_hall_43, 3, 5),(id_hall_43, 3, 6),(id_hall_43, 3, 7),(id_hall_43, 3, 8),
		(id_hall_43, 4, 1),(id_hall_43, 4, 2),(id_hall_43, 4, 3),(id_hall_43, 4, 4),(id_hall_43, 4, 5),(id_hall_43, 4, 6),(id_hall_43, 4, 7),(id_hall_43, 4, 8),
		(id_hall_43, 5, 1),(id_hall_43, 5, 2),(id_hall_43, 5, 3),(id_hall_43, 5, 4),(id_hall_43, 5, 5),(id_hall_43, 5, 6),(id_hall_43, 5, 7),(id_hall_43, 5, 8),
		(id_hall_43, 6, 1),(id_hall_43, 6, 2),(id_hall_43, 6, 3),(id_hall_43, 6, 4),(id_hall_43, 6, 5),(id_hall_43, 6, 6),(id_hall_43, 6, 7),(id_hall_43, 6, 8),
		(id_hall_43, 7, 1),(id_hall_43, 7, 2),(id_hall_43, 7, 3),(id_hall_43, 7, 4),(id_hall_43, 7, 5),(id_hall_43, 7, 6),(id_hall_43, 7, 7),(id_hall_43, 7, 8),
		(id_hall_44, 1, 1),(id_hall_44, 1, 2),(id_hall_44, 1, 3),(id_hall_44, 1, 4),(id_hall_44, 1, 5),(id_hall_44, 1, 6),(id_hall_44, 1, 7),(id_hall_44, 1, 8),
		(id_hall_44, 2, 1),(id_hall_44, 2, 2),(id_hall_44, 2, 3),(id_hall_44, 2, 4),(id_hall_44, 2, 5),(id_hall_44, 2, 6),(id_hall_44, 2, 7),(id_hall_44, 2, 8),
		(id_hall_44, 3, 1),(id_hall_44, 3, 2),(id_hall_44, 3, 3),(id_hall_44, 3, 4),(id_hall_44, 3, 5),(id_hall_44, 3, 6),(id_hall_44, 3, 7),(id_hall_44, 3, 8),
		(id_hall_44, 4, 1),(id_hall_44, 4, 2),(id_hall_44, 4, 3),(id_hall_44, 4, 4),(id_hall_44, 4, 5),(id_hall_44, 4, 6),(id_hall_44, 4, 7),(id_hall_44, 4, 8),
		(id_hall_44, 5, 1),(id_hall_44, 5, 2),(id_hall_44, 5, 3),(id_hall_44, 5, 4),(id_hall_44, 5, 5),(id_hall_44, 5, 6),(id_hall_44, 5, 7),(id_hall_44, 5, 8),
		(id_hall_44, 6, 1),(id_hall_44, 6, 2),(id_hall_44, 6, 3),(id_hall_44, 6, 4),(id_hall_44, 6, 5),(id_hall_44, 6, 6),(id_hall_44, 6, 7),(id_hall_44, 6, 8),
		(id_hall_44, 7, 1),(id_hall_44, 7, 2),(id_hall_44, 7, 3),(id_hall_44, 7, 4),(id_hall_44, 7, 5),(id_hall_44, 7, 6),(id_hall_44, 7, 7),(id_hall_44, 7, 8),
		(id_hall_45, 1, 1),(id_hall_45, 1, 2),(id_hall_45, 1, 3),(id_hall_45, 1, 4),(id_hall_45, 1, 5),(id_hall_45, 1, 6),(id_hall_45, 1, 7),(id_hall_45, 1, 8),
		(id_hall_45, 2, 1),(id_hall_45, 2, 2),(id_hall_45, 2, 3),(id_hall_45, 2, 4),(id_hall_45, 2, 5),(id_hall_45, 2, 6),(id_hall_45, 2, 7),(id_hall_45, 2, 8),
		(id_hall_45, 3, 1),(id_hall_45, 3, 2),(id_hall_45, 3, 3),(id_hall_45, 3, 4),(id_hall_45, 3, 5),(id_hall_45, 3, 6),(id_hall_45, 3, 7),(id_hall_45, 3, 8),
		(id_hall_45, 4, 1),(id_hall_45, 4, 2),(id_hall_45, 4, 3),(id_hall_45, 4, 4),(id_hall_45, 4, 5),(id_hall_45, 4, 6),(id_hall_45, 4, 7),(id_hall_45, 4, 8),
		(id_hall_45, 5, 1),(id_hall_45, 5, 2),(id_hall_45, 5, 3),(id_hall_45, 5, 4),(id_hall_45, 5, 5),(id_hall_45, 5, 6),(id_hall_45, 5, 7),(id_hall_45, 5, 8),
		(id_hall_45, 6, 1),(id_hall_45, 6, 2),(id_hall_45, 6, 3),(id_hall_45, 6, 4),(id_hall_45, 6, 5),(id_hall_45, 6, 6),(id_hall_45, 6, 7),(id_hall_45, 6, 8),
		(id_hall_45, 7, 1),(id_hall_45, 7, 2),(id_hall_45, 7, 3),(id_hall_45, 7, 4),(id_hall_45, 7, 5),(id_hall_45, 7, 6),(id_hall_45, 7, 7),(id_hall_45, 7, 8),
		(id_hall_46, 1, 1),(id_hall_46, 1, 2),(id_hall_46, 1, 3),(id_hall_46, 1, 4),(id_hall_46, 1, 5),(id_hall_46, 1, 6),(id_hall_46, 1, 7),(id_hall_46, 1, 8),
		(id_hall_46, 2, 1),(id_hall_46, 2, 2),(id_hall_46, 2, 3),(id_hall_46, 2, 4),(id_hall_46, 2, 5),(id_hall_46, 2, 6),(id_hall_46, 2, 7),(id_hall_46, 2, 8),
		(id_hall_46, 3, 1),(id_hall_46, 3, 2),(id_hall_46, 3, 3),(id_hall_46, 3, 4),(id_hall_46, 3, 5),(id_hall_46, 3, 6),(id_hall_46, 3, 7),(id_hall_46, 3, 8),
		(id_hall_46, 4, 1),(id_hall_46, 4, 2),(id_hall_46, 4, 3),(id_hall_46, 4, 4),(id_hall_46, 4, 5),(id_hall_46, 4, 6),(id_hall_46, 4, 7),(id_hall_46, 4, 8),
		(id_hall_46, 5, 1),(id_hall_46, 5, 2),(id_hall_46, 5, 3),(id_hall_46, 5, 4),(id_hall_46, 5, 5),(id_hall_46, 5, 6),(id_hall_46, 5, 7),(id_hall_46, 5, 8),
		(id_hall_46, 6, 1),(id_hall_46, 6, 2),(id_hall_46, 6, 3),(id_hall_46, 6, 4),(id_hall_46, 6, 5),(id_hall_46, 6, 6),(id_hall_46, 6, 7),(id_hall_46, 6, 8),
		(id_hall_46, 7, 1),(id_hall_46, 7, 2),(id_hall_46, 7, 3),(id_hall_46, 7, 4),(id_hall_46, 7, 5),(id_hall_46, 7, 6),(id_hall_46, 7, 7),(id_hall_46, 7, 8),
		(id_hall_47, 1, 1),(id_hall_47, 1, 2),(id_hall_47, 1, 3),(id_hall_47, 1, 4),(id_hall_47, 1, 5),(id_hall_47, 1, 6),(id_hall_47, 1, 7),(id_hall_47, 1, 8),
		(id_hall_47, 2, 1),(id_hall_47, 2, 2),(id_hall_47, 2, 3),(id_hall_47, 2, 4),(id_hall_47, 2, 5),(id_hall_47, 2, 6),(id_hall_47, 2, 7),(id_hall_47, 2, 8),
		(id_hall_47, 3, 1),(id_hall_47, 3, 2),(id_hall_47, 3, 3),(id_hall_47, 3, 4),(id_hall_47, 3, 5),(id_hall_47, 3, 6),(id_hall_47, 3, 7),(id_hall_47, 3, 8),
		(id_hall_47, 4, 1),(id_hall_47, 4, 2),(id_hall_47, 4, 3),(id_hall_47, 4, 4),(id_hall_47, 4, 5),(id_hall_47, 4, 6),(id_hall_47, 4, 7),(id_hall_47, 4, 8),
		(id_hall_47, 5, 1),(id_hall_47, 5, 2),(id_hall_47, 5, 3),(id_hall_47, 5, 4),(id_hall_47, 5, 5),(id_hall_47, 5, 6),(id_hall_47, 5, 7),(id_hall_47, 5, 8),
		(id_hall_47, 6, 1),(id_hall_47, 6, 2),(id_hall_47, 6, 3),(id_hall_47, 6, 4),(id_hall_47, 6, 5),(id_hall_47, 6, 6),(id_hall_47, 6, 7),(id_hall_47, 6, 8),
		(id_hall_47, 7, 1),(id_hall_47, 7, 2),(id_hall_47, 7, 3),(id_hall_47, 7, 4),(id_hall_47, 7, 5),(id_hall_47, 7, 6),(id_hall_47, 7, 7),(id_hall_47, 7, 8),
		(id_hall_48, 1, 1),(id_hall_48, 1, 2),(id_hall_48, 1, 3),(id_hall_48, 1, 4),(id_hall_48, 1, 5),(id_hall_48, 1, 6),(id_hall_48, 1, 7),(id_hall_48, 1, 8),
		(id_hall_48, 2, 1),(id_hall_48, 2, 2),(id_hall_48, 2, 3),(id_hall_48, 2, 4),(id_hall_48, 2, 5),(id_hall_48, 2, 6),(id_hall_48, 2, 7),(id_hall_48, 2, 8),
		(id_hall_48, 3, 1),(id_hall_48, 3, 2),(id_hall_48, 3, 3),(id_hall_48, 3, 4),(id_hall_48, 3, 5),(id_hall_48, 3, 6),(id_hall_48, 3, 7),(id_hall_48, 3, 8),
		(id_hall_48, 4, 1),(id_hall_48, 4, 2),(id_hall_48, 4, 3),(id_hall_48, 4, 4),(id_hall_48, 4, 5),(id_hall_48, 4, 6),(id_hall_48, 4, 7),(id_hall_48, 4, 8),
		(id_hall_48, 5, 1),(id_hall_48, 5, 2),(id_hall_48, 5, 3),(id_hall_48, 5, 4),(id_hall_48, 5, 5),(id_hall_48, 5, 6),(id_hall_48, 5, 7),(id_hall_48, 5, 8),
		(id_hall_48, 6, 1),(id_hall_48, 6, 2),(id_hall_48, 6, 3),(id_hall_48, 6, 4),(id_hall_48, 6, 5),(id_hall_48, 6, 6),(id_hall_48, 6, 7),(id_hall_48, 6, 8),
		(id_hall_48, 7, 1),(id_hall_48, 7, 2),(id_hall_48, 7, 3),(id_hall_48, 7, 4),(id_hall_48, 7, 5),(id_hall_48, 7, 6),(id_hall_48, 7, 7),(id_hall_48, 7, 8),
		(id_hall_49, 1, 1),(id_hall_49, 1, 2),(id_hall_49, 1, 3),(id_hall_49, 1, 4),(id_hall_49, 1, 5),(id_hall_49, 1, 6),(id_hall_49, 1, 7),(id_hall_49, 1, 8),
		(id_hall_49, 2, 1),(id_hall_49, 2, 2),(id_hall_49, 2, 3),(id_hall_49, 2, 4),(id_hall_49, 2, 5),(id_hall_49, 2, 6),(id_hall_49, 2, 7),(id_hall_49, 2, 8),
		(id_hall_49, 3, 1),(id_hall_49, 3, 2),(id_hall_49, 3, 3),(id_hall_49, 3, 4),(id_hall_49, 3, 5),(id_hall_49, 3, 6),(id_hall_49, 3, 7),(id_hall_49, 3, 8),
		(id_hall_49, 4, 1),(id_hall_49, 4, 2),(id_hall_49, 4, 3),(id_hall_49, 4, 4),(id_hall_49, 4, 5),(id_hall_49, 4, 6),(id_hall_49, 4, 7),(id_hall_49, 4, 8),
		(id_hall_49, 5, 1),(id_hall_49, 5, 2),(id_hall_49, 5, 3),(id_hall_49, 5, 4),(id_hall_49, 5, 5),(id_hall_49, 5, 6),(id_hall_49, 5, 7),(id_hall_49, 5, 8),
		(id_hall_49, 6, 1),(id_hall_49, 6, 2),(id_hall_49, 6, 3),(id_hall_49, 6, 4),(id_hall_49, 6, 5),(id_hall_49, 6, 6),(id_hall_49, 6, 7),(id_hall_49, 6, 8),
		(id_hall_49, 7, 1),(id_hall_49, 7, 2),(id_hall_49, 7, 3),(id_hall_49, 7, 4),(id_hall_49, 7, 5),(id_hall_49, 7, 6),(id_hall_49, 7, 7),(id_hall_49, 7, 8),
		(id_hall_50, 1, 1),(id_hall_50, 1, 2),(id_hall_50, 1, 3),(id_hall_50, 1, 4),(id_hall_50, 1, 5),(id_hall_50, 1, 6),(id_hall_50, 1, 7),(id_hall_50, 1, 8),
		(id_hall_50, 2, 1),(id_hall_50, 2, 2),(id_hall_50, 2, 3),(id_hall_50, 2, 4),(id_hall_50, 2, 5),(id_hall_50, 2, 6),(id_hall_50, 2, 7),(id_hall_50, 2, 8),
		(id_hall_50, 3, 1),(id_hall_50, 3, 2),(id_hall_50, 3, 3),(id_hall_50, 3, 4),(id_hall_50, 3, 5),(id_hall_50, 3, 6),(id_hall_50, 3, 7),(id_hall_50, 3, 8),
		(id_hall_50, 4, 1),(id_hall_50, 4, 2),(id_hall_50, 4, 3),(id_hall_50, 4, 4),(id_hall_50, 4, 5),(id_hall_50, 4, 6),(id_hall_50, 4, 7),(id_hall_50, 4, 8),
		(id_hall_50, 5, 1),(id_hall_50, 5, 2),(id_hall_50, 5, 3),(id_hall_50, 5, 4),(id_hall_50, 5, 5),(id_hall_50, 5, 6),(id_hall_50, 5, 7),(id_hall_50, 5, 8),
		(id_hall_50, 6, 1),(id_hall_50, 6, 2),(id_hall_50, 6, 3),(id_hall_50, 6, 4),(id_hall_50, 6, 5),(id_hall_50, 6, 6),(id_hall_50, 6, 7),(id_hall_50, 6, 8),
		(id_hall_50, 7, 1),(id_hall_50, 7, 2),(id_hall_50, 7, 3),(id_hall_50, 7, 4),(id_hall_50, 7, 5),(id_hall_50, 7, 6),(id_hall_50, 7, 7),(id_hall_50, 7, 8),
		(id_hall_51, 1, 1),(id_hall_51, 1, 2),(id_hall_51, 1, 3),(id_hall_51, 1, 4),(id_hall_51, 1, 5),(id_hall_51, 1, 6),(id_hall_51, 1, 7),(id_hall_51, 1, 8),
		(id_hall_51, 2, 1),(id_hall_51, 2, 2),(id_hall_51, 2, 3),(id_hall_51, 2, 4),(id_hall_51, 2, 5),(id_hall_51, 2, 6),(id_hall_51, 2, 7),(id_hall_51, 2, 8),
		(id_hall_51, 3, 1),(id_hall_51, 3, 2),(id_hall_51, 3, 3),(id_hall_51, 3, 4),(id_hall_51, 3, 5),(id_hall_51, 3, 6),(id_hall_51, 3, 7),(id_hall_51, 3, 8),
		(id_hall_51, 4, 1),(id_hall_51, 4, 2),(id_hall_51, 4, 3),(id_hall_51, 4, 4),(id_hall_51, 4, 5),(id_hall_51, 4, 6),(id_hall_51, 4, 7),(id_hall_51, 4, 8),
		(id_hall_51, 5, 1),(id_hall_51, 5, 2),(id_hall_51, 5, 3),(id_hall_51, 5, 4),(id_hall_51, 5, 5),(id_hall_51, 5, 6),(id_hall_51, 5, 7),(id_hall_51, 5, 8),
		(id_hall_51, 6, 1),(id_hall_51, 6, 2),(id_hall_51, 6, 3),(id_hall_51, 6, 4),(id_hall_51, 6, 5),(id_hall_51, 6, 6),(id_hall_51, 6, 7),(id_hall_51, 6, 8),
		(id_hall_51, 7, 1),(id_hall_51, 7, 2),(id_hall_51, 7, 3),(id_hall_51, 7, 4),(id_hall_51, 7, 5),(id_hall_51, 7, 6),(id_hall_51, 7, 7),(id_hall_51, 7, 8),
		(id_hall_52, 1, 1),(id_hall_52, 1, 2),(id_hall_52, 1, 3),(id_hall_52, 1, 4),(id_hall_52, 1, 5),(id_hall_52, 1, 6),(id_hall_52, 1, 7),(id_hall_52, 1, 8),
		(id_hall_52, 2, 1),(id_hall_52, 2, 2),(id_hall_52, 2, 3),(id_hall_52, 2, 4),(id_hall_52, 2, 5),(id_hall_52, 2, 6),(id_hall_52, 2, 7),(id_hall_52, 2, 8),
		(id_hall_52, 3, 1),(id_hall_52, 3, 2),(id_hall_52, 3, 3),(id_hall_52, 3, 4),(id_hall_52, 3, 5),(id_hall_52, 3, 6),(id_hall_52, 3, 7),(id_hall_52, 3, 8),
		(id_hall_52, 4, 1),(id_hall_52, 4, 2),(id_hall_52, 4, 3),(id_hall_52, 4, 4),(id_hall_52, 4, 5),(id_hall_52, 4, 6),(id_hall_52, 4, 7),(id_hall_52, 4, 8),
		(id_hall_52, 5, 1),(id_hall_52, 5, 2),(id_hall_52, 5, 3),(id_hall_52, 5, 4),(id_hall_52, 5, 5),(id_hall_52, 5, 6),(id_hall_52, 5, 7),(id_hall_52, 5, 8),
		(id_hall_52, 6, 1),(id_hall_52, 6, 2),(id_hall_52, 6, 3),(id_hall_52, 6, 4),(id_hall_52, 6, 5),(id_hall_52, 6, 6),(id_hall_52, 6, 7),(id_hall_52, 6, 8),
		(id_hall_52, 7, 1),(id_hall_52, 7, 2),(id_hall_52, 7, 3),(id_hall_52, 7, 4),(id_hall_52, 7, 5),(id_hall_52, 7, 6),(id_hall_52, 7, 7),(id_hall_52, 7, 8),
		(id_hall_53, 1, 1),(id_hall_53, 1, 2),(id_hall_53, 1, 3),(id_hall_53, 1, 4),(id_hall_53, 1, 5),(id_hall_53, 1, 6),(id_hall_53, 1, 7),(id_hall_53, 1, 8),
		(id_hall_53, 2, 1),(id_hall_53, 2, 2),(id_hall_53, 2, 3),(id_hall_53, 2, 4),(id_hall_53, 2, 5),(id_hall_53, 2, 6),(id_hall_53, 2, 7),(id_hall_53, 2, 8),
		(id_hall_53, 3, 1),(id_hall_53, 3, 2),(id_hall_53, 3, 3),(id_hall_53, 3, 4),(id_hall_53, 3, 5),(id_hall_53, 3, 6),(id_hall_53, 3, 7),(id_hall_53, 3, 8),
		(id_hall_53, 4, 1),(id_hall_53, 4, 2),(id_hall_53, 4, 3),(id_hall_53, 4, 4),(id_hall_53, 4, 5),(id_hall_53, 4, 6),(id_hall_53, 4, 7),(id_hall_53, 4, 8),
		(id_hall_53, 5, 1),(id_hall_53, 5, 2),(id_hall_53, 5, 3),(id_hall_53, 5, 4),(id_hall_53, 5, 5),(id_hall_53, 5, 6),(id_hall_53, 5, 7),(id_hall_53, 5, 8),
		(id_hall_53, 6, 1),(id_hall_53, 6, 2),(id_hall_53, 6, 3),(id_hall_53, 6, 4),(id_hall_53, 6, 5),(id_hall_53, 6, 6),(id_hall_53, 6, 7),(id_hall_53, 6, 8),
		(id_hall_53, 7, 1),(id_hall_53, 7, 2),(id_hall_53, 7, 3),(id_hall_53, 7, 4),(id_hall_53, 7, 5),(id_hall_53, 7, 6),(id_hall_53, 7, 7),(id_hall_53, 7, 8),
		(id_hall_54, 1, 1),(id_hall_54, 1, 2),(id_hall_54, 1, 3),(id_hall_54, 1, 4),(id_hall_54, 1, 5),(id_hall_54, 1, 6),(id_hall_54, 1, 7),(id_hall_54, 1, 8),
		(id_hall_54, 2, 1),(id_hall_54, 2, 2),(id_hall_54, 2, 3),(id_hall_54, 2, 4),(id_hall_54, 2, 5),(id_hall_54, 2, 6),(id_hall_54, 2, 7),(id_hall_54, 2, 8),
		(id_hall_54, 3, 1),(id_hall_54, 3, 2),(id_hall_54, 3, 3),(id_hall_54, 3, 4),(id_hall_54, 3, 5),(id_hall_54, 3, 6),(id_hall_54, 3, 7),(id_hall_54, 3, 8),
		(id_hall_54, 4, 1),(id_hall_54, 4, 2),(id_hall_54, 4, 3),(id_hall_54, 4, 4),(id_hall_54, 4, 5),(id_hall_54, 4, 6),(id_hall_54, 4, 7),(id_hall_54, 4, 8),
		(id_hall_54, 5, 1),(id_hall_54, 5, 2),(id_hall_54, 5, 3),(id_hall_54, 5, 4),(id_hall_54, 5, 5),(id_hall_54, 5, 6),(id_hall_54, 5, 7),(id_hall_54, 5, 8),
		(id_hall_54, 6, 1),(id_hall_54, 6, 2),(id_hall_54, 6, 3),(id_hall_54, 6, 4),(id_hall_54, 6, 5),(id_hall_54, 6, 6),(id_hall_54, 6, 7),(id_hall_54, 6, 8),
		(id_hall_54, 7, 1),(id_hall_54, 7, 2),(id_hall_54, 7, 3),(id_hall_54, 7, 4),(id_hall_54, 7, 5),(id_hall_54, 7, 6),(id_hall_54, 7, 7),(id_hall_54, 7, 8),
		(id_hall_55, 1, 1),(id_hall_55, 1, 2),(id_hall_55, 1, 3),(id_hall_55, 1, 4),(id_hall_55, 1, 5),(id_hall_55, 1, 6),(id_hall_55, 1, 7),(id_hall_55, 1, 8),
		(id_hall_55, 2, 1),(id_hall_55, 2, 2),(id_hall_55, 2, 3),(id_hall_55, 2, 4),(id_hall_55, 2, 5),(id_hall_55, 2, 6),(id_hall_55, 2, 7),(id_hall_55, 2, 8),
		(id_hall_55, 3, 1),(id_hall_55, 3, 2),(id_hall_55, 3, 3),(id_hall_55, 3, 4),(id_hall_55, 3, 5),(id_hall_55, 3, 6),(id_hall_55, 3, 7),(id_hall_55, 3, 8),
		(id_hall_55, 4, 1),(id_hall_55, 4, 2),(id_hall_55, 4, 3),(id_hall_55, 4, 4),(id_hall_55, 4, 5),(id_hall_55, 4, 6),(id_hall_55, 4, 7),(id_hall_55, 4, 8),
		(id_hall_55, 5, 1),(id_hall_55, 5, 2),(id_hall_55, 5, 3),(id_hall_55, 5, 4),(id_hall_55, 5, 5),(id_hall_55, 5, 6),(id_hall_55, 5, 7),(id_hall_55, 5, 8),
		(id_hall_55, 6, 1),(id_hall_55, 6, 2),(id_hall_55, 6, 3),(id_hall_55, 6, 4),(id_hall_55, 6, 5),(id_hall_55, 6, 6),(id_hall_55, 6, 7),(id_hall_55, 6, 8),
		(id_hall_55, 7, 1),(id_hall_55, 7, 2),(id_hall_55, 7, 3),(id_hall_55, 7, 4),(id_hall_55, 7, 5),(id_hall_55, 7, 6),(id_hall_55, 7, 7),(id_hall_55, 7, 8),
		(id_hall_56, 1, 1),(id_hall_56, 1, 2),(id_hall_56, 1, 3),(id_hall_56, 1, 4),(id_hall_56, 1, 5),(id_hall_56, 1, 6),(id_hall_56, 1, 7),(id_hall_56, 1, 8),
		(id_hall_56, 2, 1),(id_hall_56, 2, 2),(id_hall_56, 2, 3),(id_hall_56, 2, 4),(id_hall_56, 2, 5),(id_hall_56, 2, 6),(id_hall_56, 2, 7),(id_hall_56, 2, 8),
		(id_hall_56, 3, 1),(id_hall_56, 3, 2),(id_hall_56, 3, 3),(id_hall_56, 3, 4),(id_hall_56, 3, 5),(id_hall_56, 3, 6),(id_hall_56, 3, 7),(id_hall_56, 3, 8),
		(id_hall_56, 4, 1),(id_hall_56, 4, 2),(id_hall_56, 4, 3),(id_hall_56, 4, 4),(id_hall_56, 4, 5),(id_hall_56, 4, 6),(id_hall_56, 4, 7),(id_hall_56, 4, 8),
		(id_hall_56, 5, 1),(id_hall_56, 5, 2),(id_hall_56, 5, 3),(id_hall_56, 5, 4),(id_hall_56, 5, 5),(id_hall_56, 5, 6),(id_hall_56, 5, 7),(id_hall_56, 5, 8),
		(id_hall_56, 6, 1),(id_hall_56, 6, 2),(id_hall_56, 6, 3),(id_hall_56, 6, 4),(id_hall_56, 6, 5),(id_hall_56, 6, 6),(id_hall_56, 6, 7),(id_hall_56, 6, 8),
		(id_hall_56, 7, 1),(id_hall_56, 7, 2),(id_hall_56, 7, 3),(id_hall_56, 7, 4),(id_hall_56, 7, 5),(id_hall_56, 7, 6),(id_hall_56, 7, 7),(id_hall_56, 7, 8),
		(id_hall_57, 1, 1),(id_hall_57, 1, 2),(id_hall_57, 1, 3),(id_hall_57, 1, 4),(id_hall_57, 1, 5),(id_hall_57, 1, 6),(id_hall_57, 1, 7),(id_hall_57, 1, 8),
		(id_hall_57, 2, 1),(id_hall_57, 2, 2),(id_hall_57, 2, 3),(id_hall_57, 2, 4),(id_hall_57, 2, 5),(id_hall_57, 2, 6),(id_hall_57, 2, 7),(id_hall_57, 2, 8),
		(id_hall_57, 3, 1),(id_hall_57, 3, 2),(id_hall_57, 3, 3),(id_hall_57, 3, 4),(id_hall_57, 3, 5),(id_hall_57, 3, 6),(id_hall_57, 3, 7),(id_hall_57, 3, 8),
		(id_hall_57, 4, 1),(id_hall_57, 4, 2),(id_hall_57, 4, 3),(id_hall_57, 4, 4),(id_hall_57, 4, 5),(id_hall_57, 4, 6),(id_hall_57, 4, 7),(id_hall_57, 4, 8),
		(id_hall_57, 5, 1),(id_hall_57, 5, 2),(id_hall_57, 5, 3),(id_hall_57, 5, 4),(id_hall_57, 5, 5),(id_hall_57, 5, 6),(id_hall_57, 5, 7),(id_hall_57, 5, 8),
		(id_hall_57, 6, 1),(id_hall_57, 6, 2),(id_hall_57, 6, 3),(id_hall_57, 6, 4),(id_hall_57, 6, 5),(id_hall_57, 6, 6),(id_hall_57, 6, 7),(id_hall_57, 6, 8),
		(id_hall_57, 7, 1),(id_hall_57, 7, 2),(id_hall_57, 7, 3),(id_hall_57, 7, 4),(id_hall_57, 7, 5),(id_hall_57, 7, 6),(id_hall_57, 7, 7),(id_hall_57, 7, 8),
		(id_hall_58, 1, 1),(id_hall_58, 1, 2),(id_hall_58, 1, 3),(id_hall_58, 1, 4),(id_hall_58, 1, 5),(id_hall_58, 1, 6),(id_hall_58, 1, 7),(id_hall_58, 1, 8),
		(id_hall_58, 2, 1),(id_hall_58, 2, 2),(id_hall_58, 2, 3),(id_hall_58, 2, 4),(id_hall_58, 2, 5),(id_hall_58, 2, 6),(id_hall_58, 2, 7),(id_hall_58, 2, 8),
		(id_hall_58, 3, 1),(id_hall_58, 3, 2),(id_hall_58, 3, 3),(id_hall_58, 3, 4),(id_hall_58, 3, 5),(id_hall_58, 3, 6),(id_hall_58, 3, 7),(id_hall_58, 3, 8),
		(id_hall_58, 4, 1),(id_hall_58, 4, 2),(id_hall_58, 4, 3),(id_hall_58, 4, 4),(id_hall_58, 4, 5),(id_hall_58, 4, 6),(id_hall_58, 4, 7),(id_hall_58, 4, 8),
		(id_hall_58, 5, 1),(id_hall_58, 5, 2),(id_hall_58, 5, 3),(id_hall_58, 5, 4),(id_hall_58, 5, 5),(id_hall_58, 5, 6),(id_hall_58, 5, 7),(id_hall_58, 5, 8),
		(id_hall_58, 6, 1),(id_hall_58, 6, 2),(id_hall_58, 6, 3),(id_hall_58, 6, 4),(id_hall_58, 6, 5),(id_hall_58, 6, 6),(id_hall_58, 6, 7),(id_hall_58, 6, 8),
		(id_hall_58, 7, 1),(id_hall_58, 7, 2),(id_hall_58, 7, 3),(id_hall_58, 7, 4),(id_hall_58, 7, 5),(id_hall_58, 7, 6),(id_hall_58, 7, 7),(id_hall_58, 7, 8),
		(id_hall_59, 1, 1),(id_hall_59, 1, 2),(id_hall_59, 1, 3),(id_hall_59, 1, 4),(id_hall_59, 1, 5),(id_hall_59, 1, 6),(id_hall_59, 1, 7),(id_hall_59, 1, 8),
		(id_hall_59, 2, 1),(id_hall_59, 2, 2),(id_hall_59, 2, 3),(id_hall_59, 2, 4),(id_hall_59, 2, 5),(id_hall_59, 2, 6),(id_hall_59, 2, 7),(id_hall_59, 2, 8),
		(id_hall_59, 3, 1),(id_hall_59, 3, 2),(id_hall_59, 3, 3),(id_hall_59, 3, 4),(id_hall_59, 3, 5),(id_hall_59, 3, 6),(id_hall_59, 3, 7),(id_hall_59, 3, 8),
		(id_hall_59, 4, 1),(id_hall_59, 4, 2),(id_hall_59, 4, 3),(id_hall_59, 4, 4),(id_hall_59, 4, 5),(id_hall_59, 4, 6),(id_hall_59, 4, 7),(id_hall_59, 4, 8),
		(id_hall_59, 5, 1),(id_hall_59, 5, 2),(id_hall_59, 5, 3),(id_hall_59, 5, 4),(id_hall_59, 5, 5),(id_hall_59, 5, 6),(id_hall_59, 5, 7),(id_hall_59, 5, 8),
		(id_hall_59, 6, 1),(id_hall_59, 6, 2),(id_hall_59, 6, 3),(id_hall_59, 6, 4),(id_hall_59, 6, 5),(id_hall_59, 6, 6),(id_hall_59, 6, 7),(id_hall_59, 6, 8),
		(id_hall_59, 7, 1),(id_hall_59, 7, 2),(id_hall_59, 7, 3),(id_hall_59, 7, 4),(id_hall_59, 7, 5),(id_hall_59, 7, 6),(id_hall_59, 7, 7),(id_hall_59, 7, 8),
		(id_hall_60, 1, 1),(id_hall_60, 1, 2),(id_hall_60, 1, 3),(id_hall_60, 1, 4),(id_hall_60, 1, 5),(id_hall_60, 1, 6),(id_hall_60, 1, 7),(id_hall_60, 1, 8),
		(id_hall_60, 2, 1),(id_hall_60, 2, 2),(id_hall_60, 2, 3),(id_hall_60, 2, 4),(id_hall_60, 2, 5),(id_hall_60, 2, 6),(id_hall_60, 2, 7),(id_hall_60, 2, 8),
		(id_hall_60, 3, 1),(id_hall_60, 3, 2),(id_hall_60, 3, 3),(id_hall_60, 3, 4),(id_hall_60, 3, 5),(id_hall_60, 3, 6),(id_hall_60, 3, 7),(id_hall_60, 3, 8),
		(id_hall_60, 4, 1),(id_hall_60, 4, 2),(id_hall_60, 4, 3),(id_hall_60, 4, 4),(id_hall_60, 4, 5),(id_hall_60, 4, 6),(id_hall_60, 4, 7),(id_hall_60, 4, 8),
		(id_hall_60, 5, 1),(id_hall_60, 5, 2),(id_hall_60, 5, 3),(id_hall_60, 5, 4),(id_hall_60, 5, 5),(id_hall_60, 5, 6),(id_hall_60, 5, 7),(id_hall_60, 5, 8),
		(id_hall_60, 6, 1),(id_hall_60, 6, 2),(id_hall_60, 6, 3),(id_hall_60, 6, 4),(id_hall_60, 6, 5),(id_hall_60, 6, 6),(id_hall_60, 6, 7),(id_hall_60, 6, 8),
		(id_hall_60, 7, 1),(id_hall_60, 7, 2),(id_hall_60, 7, 3),(id_hall_60, 7, 4),(id_hall_60, 7, 5),(id_hall_60, 7, 6),(id_hall_60, 7, 7),(id_hall_60, 7, 8),
		(id_hall_61, 1, 1),(id_hall_61, 1, 2),(id_hall_61, 1, 3),(id_hall_61, 1, 4),(id_hall_61, 1, 5),(id_hall_61, 1, 6),(id_hall_61, 1, 7),(id_hall_61, 1, 8),
		(id_hall_61, 2, 1),(id_hall_61, 2, 2),(id_hall_61, 2, 3),(id_hall_61, 2, 4),(id_hall_61, 2, 5),(id_hall_61, 2, 6),(id_hall_61, 2, 7),(id_hall_61, 2, 8),
		(id_hall_61, 3, 1),(id_hall_61, 3, 2),(id_hall_61, 3, 3),(id_hall_61, 3, 4),(id_hall_61, 3, 5),(id_hall_61, 3, 6),(id_hall_61, 3, 7),(id_hall_61, 3, 8),
		(id_hall_61, 4, 1),(id_hall_61, 4, 2),(id_hall_61, 4, 3),(id_hall_61, 4, 4),(id_hall_61, 4, 5),(id_hall_61, 4, 6),(id_hall_61, 4, 7),(id_hall_61, 4, 8),
		(id_hall_61, 5, 1),(id_hall_61, 5, 2),(id_hall_61, 5, 3),(id_hall_61, 5, 4),(id_hall_61, 5, 5),(id_hall_61, 5, 6),(id_hall_61, 5, 7),(id_hall_61, 5, 8),
		(id_hall_61, 6, 1),(id_hall_61, 6, 2),(id_hall_61, 6, 3),(id_hall_61, 6, 4),(id_hall_61, 6, 5),(id_hall_61, 6, 6),(id_hall_61, 6, 7),(id_hall_61, 6, 8),
		(id_hall_61, 7, 1),(id_hall_61, 7, 2),(id_hall_61, 7, 3),(id_hall_61, 7, 4),(id_hall_61, 7, 5),(id_hall_61, 7, 6),(id_hall_61, 7, 7),(id_hall_61, 7, 8),
		(id_hall_62, 1, 1),(id_hall_62, 1, 2),(id_hall_62, 1, 3),(id_hall_62, 1, 4),(id_hall_62, 1, 5),(id_hall_62, 1, 6),(id_hall_62, 1, 7),(id_hall_62, 1, 8),
		(id_hall_62, 2, 1),(id_hall_62, 2, 2),(id_hall_62, 2, 3),(id_hall_62, 2, 4),(id_hall_62, 2, 5),(id_hall_62, 2, 6),(id_hall_62, 2, 7),(id_hall_62, 2, 8),
		(id_hall_62, 3, 1),(id_hall_62, 3, 2),(id_hall_62, 3, 3),(id_hall_62, 3, 4),(id_hall_62, 3, 5),(id_hall_62, 3, 6),(id_hall_62, 3, 7),(id_hall_62, 3, 8),
		(id_hall_62, 4, 1),(id_hall_62, 4, 2),(id_hall_62, 4, 3),(id_hall_62, 4, 4),(id_hall_62, 4, 5),(id_hall_62, 4, 6),(id_hall_62, 4, 7),(id_hall_62, 4, 8),
		(id_hall_62, 5, 1),(id_hall_62, 5, 2),(id_hall_62, 5, 3),(id_hall_62, 5, 4),(id_hall_62, 5, 5),(id_hall_62, 5, 6),(id_hall_62, 5, 7),(id_hall_62, 5, 8),
		(id_hall_62, 6, 1),(id_hall_62, 6, 2),(id_hall_62, 6, 3),(id_hall_62, 6, 4),(id_hall_62, 6, 5),(id_hall_62, 6, 6),(id_hall_62, 6, 7),(id_hall_62, 6, 8),
		(id_hall_62, 7, 1),(id_hall_62, 7, 2),(id_hall_62, 7, 3),(id_hall_62, 7, 4),(id_hall_62, 7, 5),(id_hall_62, 7, 6),(id_hall_62, 7, 7),(id_hall_62, 7, 8),
		(id_hall_63, 1, 1),(id_hall_63, 1, 2),(id_hall_63, 1, 3),(id_hall_63, 1, 4),(id_hall_63, 1, 5),(id_hall_63, 1, 6),(id_hall_63, 1, 7),(id_hall_63, 1, 8),
		(id_hall_63, 2, 1),(id_hall_63, 2, 2),(id_hall_63, 2, 3),(id_hall_63, 2, 4),(id_hall_63, 2, 5),(id_hall_63, 2, 6),(id_hall_63, 2, 7),(id_hall_63, 2, 8),
		(id_hall_63, 3, 1),(id_hall_63, 3, 2),(id_hall_63, 3, 3),(id_hall_63, 3, 4),(id_hall_63, 3, 5),(id_hall_63, 3, 6),(id_hall_63, 3, 7),(id_hall_63, 3, 8),
		(id_hall_63, 4, 1),(id_hall_63, 4, 2),(id_hall_63, 4, 3),(id_hall_63, 4, 4),(id_hall_63, 4, 5),(id_hall_63, 4, 6),(id_hall_63, 4, 7),(id_hall_63, 4, 8),
		(id_hall_63, 5, 1),(id_hall_63, 5, 2),(id_hall_63, 5, 3),(id_hall_63, 5, 4),(id_hall_63, 5, 5),(id_hall_63, 5, 6),(id_hall_63, 5, 7),(id_hall_63, 5, 8),
		(id_hall_63, 6, 1),(id_hall_63, 6, 2),(id_hall_63, 6, 3),(id_hall_63, 6, 4),(id_hall_63, 6, 5),(id_hall_63, 6, 6),(id_hall_63, 6, 7),(id_hall_63, 6, 8),
		(id_hall_63, 7, 1),(id_hall_63, 7, 2),(id_hall_63, 7, 3),(id_hall_63, 7, 4),(id_hall_63, 7, 5),(id_hall_63, 7, 6),(id_hall_63, 7, 7),(id_hall_63, 7, 8),
		(id_hall_64, 1, 1),(id_hall_64, 1, 2),(id_hall_64, 1, 3),(id_hall_64, 1, 4),(id_hall_64, 1, 5),(id_hall_64, 1, 6),(id_hall_64, 1, 7),(id_hall_64, 1, 8),
		(id_hall_64, 2, 1),(id_hall_64, 2, 2),(id_hall_64, 2, 3),(id_hall_64, 2, 4),(id_hall_64, 2, 5),(id_hall_64, 2, 6),(id_hall_64, 2, 7),(id_hall_64, 2, 8),
		(id_hall_64, 3, 1),(id_hall_64, 3, 2),(id_hall_64, 3, 3),(id_hall_64, 3, 4),(id_hall_64, 3, 5),(id_hall_64, 3, 6),(id_hall_64, 3, 7),(id_hall_64, 3, 8),
		(id_hall_64, 4, 1),(id_hall_64, 4, 2),(id_hall_64, 4, 3),(id_hall_64, 4, 4),(id_hall_64, 4, 5),(id_hall_64, 4, 6),(id_hall_64, 4, 7),(id_hall_64, 4, 8),
		(id_hall_64, 5, 1),(id_hall_64, 5, 2),(id_hall_64, 5, 3),(id_hall_64, 5, 4),(id_hall_64, 5, 5),(id_hall_64, 5, 6),(id_hall_64, 5, 7),(id_hall_64, 5, 8),
		(id_hall_64, 6, 1),(id_hall_64, 6, 2),(id_hall_64, 6, 3),(id_hall_64, 6, 4),(id_hall_64, 6, 5),(id_hall_64, 6, 6),(id_hall_64, 6, 7),(id_hall_64, 6, 8),
		(id_hall_64, 7, 1),(id_hall_64, 7, 2),(id_hall_64, 7, 3),(id_hall_64, 7, 4),(id_hall_64, 7, 5),(id_hall_64, 7, 6),(id_hall_64, 7, 7),(id_hall_64, 7, 8),
		(id_hall_65, 1, 1),(id_hall_65, 1, 2),(id_hall_65, 1, 3),(id_hall_65, 1, 4),(id_hall_65, 1, 5),(id_hall_65, 1, 6),(id_hall_65, 1, 7),(id_hall_65, 1, 8),
		(id_hall_65, 2, 1),(id_hall_65, 2, 2),(id_hall_65, 2, 3),(id_hall_65, 2, 4),(id_hall_65, 2, 5),(id_hall_65, 2, 6),(id_hall_65, 2, 7),(id_hall_65, 2, 8),
		(id_hall_65, 3, 1),(id_hall_65, 3, 2),(id_hall_65, 3, 3),(id_hall_65, 3, 4),(id_hall_65, 3, 5),(id_hall_65, 3, 6),(id_hall_65, 3, 7),(id_hall_65, 3, 8),
		(id_hall_65, 4, 1),(id_hall_65, 4, 2),(id_hall_65, 4, 3),(id_hall_65, 4, 4),(id_hall_65, 4, 5),(id_hall_65, 4, 6),(id_hall_65, 4, 7),(id_hall_65, 4, 8),
		(id_hall_65, 5, 1),(id_hall_65, 5, 2),(id_hall_65, 5, 3),(id_hall_65, 5, 4),(id_hall_65, 5, 5),(id_hall_65, 5, 6),(id_hall_65, 5, 7),(id_hall_65, 5, 8),
		(id_hall_65, 6, 1),(id_hall_65, 6, 2),(id_hall_65, 6, 3),(id_hall_65, 6, 4),(id_hall_65, 6, 5),(id_hall_65, 6, 6),(id_hall_65, 6, 7),(id_hall_65, 6, 8),
		(id_hall_65, 7, 1),(id_hall_65, 7, 2),(id_hall_65, 7, 3),(id_hall_65, 7, 4),(id_hall_65, 7, 5),(id_hall_65, 7, 6),(id_hall_65, 7, 7),(id_hall_65, 7, 8),
		(id_hall_66, 1, 1),(id_hall_66, 1, 2),(id_hall_66, 1, 3),(id_hall_66, 1, 4),(id_hall_66, 1, 5),(id_hall_66, 1, 6),(id_hall_66, 1, 7),(id_hall_66, 1, 8),
		(id_hall_66, 2, 1),(id_hall_66, 2, 2),(id_hall_66, 2, 3),(id_hall_66, 2, 4),(id_hall_66, 2, 5),(id_hall_66, 2, 6),(id_hall_66, 2, 7),(id_hall_66, 2, 8),
		(id_hall_66, 3, 1),(id_hall_66, 3, 2),(id_hall_66, 3, 3),(id_hall_66, 3, 4),(id_hall_66, 3, 5),(id_hall_66, 3, 6),(id_hall_66, 3, 7),(id_hall_66, 3, 8),
		(id_hall_66, 4, 1),(id_hall_66, 4, 2),(id_hall_66, 4, 3),(id_hall_66, 4, 4),(id_hall_66, 4, 5),(id_hall_66, 4, 6),(id_hall_66, 4, 7),(id_hall_66, 4, 8),
		(id_hall_66, 5, 1),(id_hall_66, 5, 2),(id_hall_66, 5, 3),(id_hall_66, 5, 4),(id_hall_66, 5, 5),(id_hall_66, 5, 6),(id_hall_66, 5, 7),(id_hall_66, 5, 8),
		(id_hall_66, 6, 1),(id_hall_66, 6, 2),(id_hall_66, 6, 3),(id_hall_66, 6, 4),(id_hall_66, 6, 5),(id_hall_66, 6, 6),(id_hall_66, 6, 7),(id_hall_66, 6, 8),
		(id_hall_66, 7, 1),(id_hall_66, 7, 2),(id_hall_66, 7, 3),(id_hall_66, 7, 4),(id_hall_66, 7, 5),(id_hall_66, 7, 6),(id_hall_66, 7, 7),(id_hall_66, 7, 8),
		(id_hall_67, 1, 1),(id_hall_67, 1, 2),(id_hall_67, 1, 3),(id_hall_67, 1, 4),(id_hall_67, 1, 5),(id_hall_67, 1, 6),(id_hall_67, 1, 7),(id_hall_67, 1, 8),
		(id_hall_67, 2, 1),(id_hall_67, 2, 2),(id_hall_67, 2, 3),(id_hall_67, 2, 4),(id_hall_67, 2, 5),(id_hall_67, 2, 6),(id_hall_67, 2, 7),(id_hall_67, 2, 8),
		(id_hall_67, 3, 1),(id_hall_67, 3, 2),(id_hall_67, 3, 3),(id_hall_67, 3, 4),(id_hall_67, 3, 5),(id_hall_67, 3, 6),(id_hall_67, 3, 7),(id_hall_67, 3, 8),
		(id_hall_67, 4, 1),(id_hall_67, 4, 2),(id_hall_67, 4, 3),(id_hall_67, 4, 4),(id_hall_67, 4, 5),(id_hall_67, 4, 6),(id_hall_67, 4, 7),(id_hall_67, 4, 8),
		(id_hall_67, 5, 1),(id_hall_67, 5, 2),(id_hall_67, 5, 3),(id_hall_67, 5, 4),(id_hall_67, 5, 5),(id_hall_67, 5, 6),(id_hall_67, 5, 7),(id_hall_67, 5, 8),
		(id_hall_67, 6, 1),(id_hall_67, 6, 2),(id_hall_67, 6, 3),(id_hall_67, 6, 4),(id_hall_67, 6, 5),(id_hall_67, 6, 6),(id_hall_67, 6, 7),(id_hall_67, 6, 8),
		(id_hall_67, 7, 1),(id_hall_67, 7, 2),(id_hall_67, 7, 3),(id_hall_67, 7, 4),(id_hall_67, 7, 5),(id_hall_67, 7, 6),(id_hall_67, 7, 7),(id_hall_67, 7, 8),
		(id_hall_68, 1, 1),(id_hall_68, 1, 2),(id_hall_68, 1, 3),(id_hall_68, 1, 4),(id_hall_68, 1, 5),(id_hall_68, 1, 6),(id_hall_68, 1, 7),(id_hall_68, 1, 8),
		(id_hall_68, 2, 1),(id_hall_68, 2, 2),(id_hall_68, 2, 3),(id_hall_68, 2, 4),(id_hall_68, 2, 5),(id_hall_68, 2, 6),(id_hall_68, 2, 7),(id_hall_68, 2, 8),
		(id_hall_68, 3, 1),(id_hall_68, 3, 2),(id_hall_68, 3, 3),(id_hall_68, 3, 4),(id_hall_68, 3, 5),(id_hall_68, 3, 6),(id_hall_68, 3, 7),(id_hall_68, 3, 8),
		(id_hall_68, 4, 1),(id_hall_68, 4, 2),(id_hall_68, 4, 3),(id_hall_68, 4, 4),(id_hall_68, 4, 5),(id_hall_68, 4, 6),(id_hall_68, 4, 7),(id_hall_68, 4, 8),
		(id_hall_68, 5, 1),(id_hall_68, 5, 2),(id_hall_68, 5, 3),(id_hall_68, 5, 4),(id_hall_68, 5, 5),(id_hall_68, 5, 6),(id_hall_68, 5, 7),(id_hall_68, 5, 8),
		(id_hall_68, 6, 1),(id_hall_68, 6, 2),(id_hall_68, 6, 3),(id_hall_68, 6, 4),(id_hall_68, 6, 5),(id_hall_68, 6, 6),(id_hall_68, 6, 7),(id_hall_68, 6, 8),
		(id_hall_68, 7, 1),(id_hall_68, 7, 2),(id_hall_68, 7, 3),(id_hall_68, 7, 4),(id_hall_68, 7, 5),(id_hall_68, 7, 6),(id_hall_68, 7, 7),(id_hall_68, 7, 8),
		(id_hall_69, 1, 1),(id_hall_69, 1, 2),(id_hall_69, 1, 3),(id_hall_69, 1, 4),(id_hall_69, 1, 5),(id_hall_69, 1, 6),(id_hall_69, 1, 7),(id_hall_69, 1, 8),
		(id_hall_69, 2, 1),(id_hall_69, 2, 2),(id_hall_69, 2, 3),(id_hall_69, 2, 4),(id_hall_69, 2, 5),(id_hall_69, 2, 6),(id_hall_69, 2, 7),(id_hall_69, 2, 8),
		(id_hall_69, 3, 1),(id_hall_69, 3, 2),(id_hall_69, 3, 3),(id_hall_69, 3, 4),(id_hall_69, 3, 5),(id_hall_69, 3, 6),(id_hall_69, 3, 7),(id_hall_69, 3, 8),
		(id_hall_69, 4, 1),(id_hall_69, 4, 2),(id_hall_69, 4, 3),(id_hall_69, 4, 4),(id_hall_69, 4, 5),(id_hall_69, 4, 6),(id_hall_69, 4, 7),(id_hall_69, 4, 8),
		(id_hall_69, 5, 1),(id_hall_69, 5, 2),(id_hall_69, 5, 3),(id_hall_69, 5, 4),(id_hall_69, 5, 5),(id_hall_69, 5, 6),(id_hall_69, 5, 7),(id_hall_69, 5, 8),
		(id_hall_69, 6, 1),(id_hall_69, 6, 2),(id_hall_69, 6, 3),(id_hall_69, 6, 4),(id_hall_69, 6, 5),(id_hall_69, 6, 6),(id_hall_69, 6, 7),(id_hall_69, 6, 8),
		(id_hall_69, 7, 1),(id_hall_69, 7, 2),(id_hall_69, 7, 3),(id_hall_69, 7, 4),(id_hall_69, 7, 5),(id_hall_69, 7, 6),(id_hall_69, 7, 7),(id_hall_69, 7, 8),
		(id_hall_70, 1, 1),(id_hall_70, 1, 2),(id_hall_70, 1, 3),(id_hall_70, 1, 4),(id_hall_70, 1, 5),(id_hall_70, 1, 6),(id_hall_70, 1, 7),(id_hall_70, 1, 8),
		(id_hall_70, 2, 1),(id_hall_70, 2, 2),(id_hall_70, 2, 3),(id_hall_70, 2, 4),(id_hall_70, 2, 5),(id_hall_70, 2, 6),(id_hall_70, 2, 7),(id_hall_70, 2, 8),
		(id_hall_70, 3, 1),(id_hall_70, 3, 2),(id_hall_70, 3, 3),(id_hall_70, 3, 4),(id_hall_70, 3, 5),(id_hall_70, 3, 6),(id_hall_70, 3, 7),(id_hall_70, 3, 8),
		(id_hall_70, 4, 1),(id_hall_70, 4, 2),(id_hall_70, 4, 3),(id_hall_70, 4, 4),(id_hall_70, 4, 5),(id_hall_70, 4, 6),(id_hall_70, 4, 7),(id_hall_70, 4, 8),
		(id_hall_70, 5, 1),(id_hall_70, 5, 2),(id_hall_70, 5, 3),(id_hall_70, 5, 4),(id_hall_70, 5, 5),(id_hall_70, 5, 6),(id_hall_70, 5, 7),(id_hall_70, 5, 8),
		(id_hall_70, 6, 1),(id_hall_70, 6, 2),(id_hall_70, 6, 3),(id_hall_70, 6, 4),(id_hall_70, 6, 5),(id_hall_70, 6, 6),(id_hall_70, 6, 7),(id_hall_70, 6, 8),
		(id_hall_70, 7, 1),(id_hall_70, 7, 2),(id_hall_70, 7, 3),(id_hall_70, 7, 4),(id_hall_70, 7, 5),(id_hall_70, 7, 6),(id_hall_70, 7, 7),(id_hall_70, 7, 8),
		(id_hall_71, 1, 1),(id_hall_71, 1, 2),(id_hall_71, 1, 3),(id_hall_71, 1, 4),(id_hall_71, 1, 5),(id_hall_71, 1, 6),(id_hall_71, 1, 7),(id_hall_71, 1, 8),
		(id_hall_71, 2, 1),(id_hall_71, 2, 2),(id_hall_71, 2, 3),(id_hall_71, 2, 4),(id_hall_71, 2, 5),(id_hall_71, 2, 6),(id_hall_71, 2, 7),(id_hall_71, 2, 8),
		(id_hall_71, 3, 1),(id_hall_71, 3, 2),(id_hall_71, 3, 3),(id_hall_71, 3, 4),(id_hall_71, 3, 5),(id_hall_71, 3, 6),(id_hall_71, 3, 7),(id_hall_71, 3, 8),
		(id_hall_71, 4, 1),(id_hall_71, 4, 2),(id_hall_71, 4, 3),(id_hall_71, 4, 4),(id_hall_71, 4, 5),(id_hall_71, 4, 6),(id_hall_71, 4, 7),(id_hall_71, 4, 8),
		(id_hall_71, 5, 1),(id_hall_71, 5, 2),(id_hall_71, 5, 3),(id_hall_71, 5, 4),(id_hall_71, 5, 5),(id_hall_71, 5, 6),(id_hall_71, 5, 7),(id_hall_71, 5, 8),
		(id_hall_71, 6, 1),(id_hall_71, 6, 2),(id_hall_71, 6, 3),(id_hall_71, 6, 4),(id_hall_71, 6, 5),(id_hall_71, 6, 6),(id_hall_71, 6, 7),(id_hall_71, 6, 8),
		(id_hall_71, 7, 1),(id_hall_71, 7, 2),(id_hall_71, 7, 3),(id_hall_71, 7, 4),(id_hall_71, 7, 5),(id_hall_71, 7, 6),(id_hall_71, 7, 7),(id_hall_71, 7, 8),
		(id_hall_72, 1, 1),(id_hall_72, 1, 2),(id_hall_72, 1, 3),(id_hall_72, 1, 4),(id_hall_72, 1, 5),(id_hall_72, 1, 6),(id_hall_72, 1, 7),(id_hall_72, 1, 8),
		(id_hall_72, 2, 1),(id_hall_72, 2, 2),(id_hall_72, 2, 3),(id_hall_72, 2, 4),(id_hall_72, 2, 5),(id_hall_72, 2, 6),(id_hall_72, 2, 7),(id_hall_72, 2, 8),
		(id_hall_72, 3, 1),(id_hall_72, 3, 2),(id_hall_72, 3, 3),(id_hall_72, 3, 4),(id_hall_72, 3, 5),(id_hall_72, 3, 6),(id_hall_72, 3, 7),(id_hall_72, 3, 8),
		(id_hall_72, 4, 1),(id_hall_72, 4, 2),(id_hall_72, 4, 3),(id_hall_72, 4, 4),(id_hall_72, 4, 5),(id_hall_72, 4, 6),(id_hall_72, 4, 7),(id_hall_72, 4, 8),
		(id_hall_72, 5, 1),(id_hall_72, 5, 2),(id_hall_72, 5, 3),(id_hall_72, 5, 4),(id_hall_72, 5, 5),(id_hall_72, 5, 6),(id_hall_72, 5, 7),(id_hall_72, 5, 8),
		(id_hall_72, 6, 1),(id_hall_72, 6, 2),(id_hall_72, 6, 3),(id_hall_72, 6, 4),(id_hall_72, 6, 5),(id_hall_72, 6, 6),(id_hall_72, 6, 7),(id_hall_72, 6, 8),
		(id_hall_72, 7, 1),(id_hall_72, 7, 2),(id_hall_72, 7, 3),(id_hall_72, 7, 4),(id_hall_72, 7, 5),(id_hall_72, 7, 6),(id_hall_72, 7, 7),(id_hall_72, 7, 8),
		(id_hall_73, 1, 1),(id_hall_73, 1, 2),(id_hall_73, 1, 3),(id_hall_73, 1, 4),(id_hall_73, 1, 5),(id_hall_73, 1, 6),(id_hall_73, 1, 7),(id_hall_73, 1, 8),
		(id_hall_73, 2, 1),(id_hall_73, 2, 2),(id_hall_73, 2, 3),(id_hall_73, 2, 4),(id_hall_73, 2, 5),(id_hall_73, 2, 6),(id_hall_73, 2, 7),(id_hall_73, 2, 8),
		(id_hall_73, 3, 1),(id_hall_73, 3, 2),(id_hall_73, 3, 3),(id_hall_73, 3, 4),(id_hall_73, 3, 5),(id_hall_73, 3, 6),(id_hall_73, 3, 7),(id_hall_73, 3, 8),
		(id_hall_73, 4, 1),(id_hall_73, 4, 2),(id_hall_73, 4, 3),(id_hall_73, 4, 4),(id_hall_73, 4, 5),(id_hall_73, 4, 6),(id_hall_73, 4, 7),(id_hall_73, 4, 8),
		(id_hall_73, 5, 1),(id_hall_73, 5, 2),(id_hall_73, 5, 3),(id_hall_73, 5, 4),(id_hall_73, 5, 5),(id_hall_73, 5, 6),(id_hall_73, 5, 7),(id_hall_73, 5, 8),
		(id_hall_73, 6, 1),(id_hall_73, 6, 2),(id_hall_73, 6, 3),(id_hall_73, 6, 4),(id_hall_73, 6, 5),(id_hall_73, 6, 6),(id_hall_73, 6, 7),(id_hall_73, 6, 8),
		(id_hall_73, 7, 1),(id_hall_73, 7, 2),(id_hall_73, 7, 3),(id_hall_73, 7, 4),(id_hall_73, 7, 5),(id_hall_73, 7, 6),(id_hall_73, 7, 7),(id_hall_73, 7, 8),
		(id_hall_74, 1, 1),(id_hall_74, 1, 2),(id_hall_74, 1, 3),(id_hall_74, 1, 4),(id_hall_74, 1, 5),(id_hall_74, 1, 6),(id_hall_74, 1, 7),(id_hall_74, 1, 8),
		(id_hall_74, 2, 1),(id_hall_74, 2, 2),(id_hall_74, 2, 3),(id_hall_74, 2, 4),(id_hall_74, 2, 5),(id_hall_74, 2, 6),(id_hall_74, 2, 7),(id_hall_74, 2, 8),
		(id_hall_74, 3, 1),(id_hall_74, 3, 2),(id_hall_74, 3, 3),(id_hall_74, 3, 4),(id_hall_74, 3, 5),(id_hall_74, 3, 6),(id_hall_74, 3, 7),(id_hall_74, 3, 8),
		(id_hall_74, 4, 1),(id_hall_74, 4, 2),(id_hall_74, 4, 3),(id_hall_74, 4, 4),(id_hall_74, 4, 5),(id_hall_74, 4, 6),(id_hall_74, 4, 7),(id_hall_74, 4, 8),
		(id_hall_74, 5, 1),(id_hall_74, 5, 2),(id_hall_74, 5, 3),(id_hall_74, 5, 4),(id_hall_74, 5, 5),(id_hall_74, 5, 6),(id_hall_74, 5, 7),(id_hall_74, 5, 8),
		(id_hall_74, 6, 1),(id_hall_74, 6, 2),(id_hall_74, 6, 3),(id_hall_74, 6, 4),(id_hall_74, 6, 5),(id_hall_74, 6, 6),(id_hall_74, 6, 7),(id_hall_74, 6, 8),
		(id_hall_74, 7, 1),(id_hall_74, 7, 2),(id_hall_74, 7, 3),(id_hall_74, 7, 4),(id_hall_74, 7, 5),(id_hall_74, 7, 6),(id_hall_74, 7, 7),(id_hall_74, 7, 8),
		(id_hall_75, 1, 1),(id_hall_75, 1, 2),(id_hall_75, 1, 3),(id_hall_75, 1, 4),(id_hall_75, 1, 5),(id_hall_75, 1, 6),(id_hall_75, 1, 7),(id_hall_75, 1, 8),
		(id_hall_75, 2, 1),(id_hall_75, 2, 2),(id_hall_75, 2, 3),(id_hall_75, 2, 4),(id_hall_75, 2, 5),(id_hall_75, 2, 6),(id_hall_75, 2, 7),(id_hall_75, 2, 8),
		(id_hall_75, 3, 1),(id_hall_75, 3, 2),(id_hall_75, 3, 3),(id_hall_75, 3, 4),(id_hall_75, 3, 5),(id_hall_75, 3, 6),(id_hall_75, 3, 7),(id_hall_75, 3, 8),
		(id_hall_75, 4, 1),(id_hall_75, 4, 2),(id_hall_75, 4, 3),(id_hall_75, 4, 4),(id_hall_75, 4, 5),(id_hall_75, 4, 6),(id_hall_75, 4, 7),(id_hall_75, 4, 8),
		(id_hall_75, 5, 1),(id_hall_75, 5, 2),(id_hall_75, 5, 3),(id_hall_75, 5, 4),(id_hall_75, 5, 5),(id_hall_75, 5, 6),(id_hall_75, 5, 7),(id_hall_75, 5, 8),
		(id_hall_75, 6, 1),(id_hall_75, 6, 2),(id_hall_75, 6, 3),(id_hall_75, 6, 4),(id_hall_75, 6, 5),(id_hall_75, 6, 6),(id_hall_75, 6, 7),(id_hall_75, 6, 8),
		(id_hall_75, 7, 1),(id_hall_75, 7, 2),(id_hall_75, 7, 3),(id_hall_75, 7, 4),(id_hall_75, 7, 5),(id_hall_75, 7, 6),(id_hall_75, 7, 7),(id_hall_75, 7, 8),
		(id_hall_76, 1, 1),(id_hall_76, 1, 2),(id_hall_76, 1, 3),(id_hall_76, 1, 4),(id_hall_76, 1, 5),(id_hall_76, 1, 6),(id_hall_76, 1, 7),(id_hall_76, 1, 8),
		(id_hall_76, 2, 1),(id_hall_76, 2, 2),(id_hall_76, 2, 3),(id_hall_76, 2, 4),(id_hall_76, 2, 5),(id_hall_76, 2, 6),(id_hall_76, 2, 7),(id_hall_76, 2, 8),
		(id_hall_76, 3, 1),(id_hall_76, 3, 2),(id_hall_76, 3, 3),(id_hall_76, 3, 4),(id_hall_76, 3, 5),(id_hall_76, 3, 6),(id_hall_76, 3, 7),(id_hall_76, 3, 8),
		(id_hall_76, 4, 1),(id_hall_76, 4, 2),(id_hall_76, 4, 3),(id_hall_76, 4, 4),(id_hall_76, 4, 5),(id_hall_76, 4, 6),(id_hall_76, 4, 7),(id_hall_76, 4, 8),
		(id_hall_76, 5, 1),(id_hall_76, 5, 2),(id_hall_76, 5, 3),(id_hall_76, 5, 4),(id_hall_76, 5, 5),(id_hall_76, 5, 6),(id_hall_76, 5, 7),(id_hall_76, 5, 8),
		(id_hall_76, 6, 1),(id_hall_76, 6, 2),(id_hall_76, 6, 3),(id_hall_76, 6, 4),(id_hall_76, 6, 5),(id_hall_76, 6, 6),(id_hall_76, 6, 7),(id_hall_76, 6, 8),
		(id_hall_76, 7, 1),(id_hall_76, 7, 2),(id_hall_76, 7, 3),(id_hall_76, 7, 4),(id_hall_76, 7, 5),(id_hall_76, 7, 6),(id_hall_76, 7, 7),(id_hall_76, 7, 8),
		(id_hall_77, 1, 1),(id_hall_77, 1, 2),(id_hall_77, 1, 3),(id_hall_77, 1, 4),(id_hall_77, 1, 5),(id_hall_77, 1, 6),(id_hall_77, 1, 7),(id_hall_77, 1, 8),
		(id_hall_77, 2, 1),(id_hall_77, 2, 2),(id_hall_77, 2, 3),(id_hall_77, 2, 4),(id_hall_77, 2, 5),(id_hall_77, 2, 6),(id_hall_77, 2, 7),(id_hall_77, 2, 8),
		(id_hall_77, 3, 1),(id_hall_77, 3, 2),(id_hall_77, 3, 3),(id_hall_77, 3, 4),(id_hall_77, 3, 5),(id_hall_77, 3, 6),(id_hall_77, 3, 7),(id_hall_77, 3, 8),
		(id_hall_77, 4, 1),(id_hall_77, 4, 2),(id_hall_77, 4, 3),(id_hall_77, 4, 4),(id_hall_77, 4, 5),(id_hall_77, 4, 6),(id_hall_77, 4, 7),(id_hall_77, 4, 8),
		(id_hall_77, 5, 1),(id_hall_77, 5, 2),(id_hall_77, 5, 3),(id_hall_77, 5, 4),(id_hall_77, 5, 5),(id_hall_77, 5, 6),(id_hall_77, 5, 7),(id_hall_77, 5, 8),
		(id_hall_77, 6, 1),(id_hall_77, 6, 2),(id_hall_77, 6, 3),(id_hall_77, 6, 4),(id_hall_77, 6, 5),(id_hall_77, 6, 6),(id_hall_77, 6, 7),(id_hall_77, 6, 8),
		(id_hall_77, 7, 1),(id_hall_77, 7, 2),(id_hall_77, 7, 3),(id_hall_77, 7, 4),(id_hall_77, 7, 5),(id_hall_77, 7, 6),(id_hall_77, 7, 7),(id_hall_77, 7, 8),
		(id_hall_78, 1, 1),(id_hall_78, 1, 2),(id_hall_78, 1, 3),(id_hall_78, 1, 4),(id_hall_78, 1, 5),(id_hall_78, 1, 6),(id_hall_78, 1, 7),(id_hall_78, 1, 8),
		(id_hall_78, 2, 1),(id_hall_78, 2, 2),(id_hall_78, 2, 3),(id_hall_78, 2, 4),(id_hall_78, 2, 5),(id_hall_78, 2, 6),(id_hall_78, 2, 7),(id_hall_78, 2, 8),
		(id_hall_78, 3, 1),(id_hall_78, 3, 2),(id_hall_78, 3, 3),(id_hall_78, 3, 4),(id_hall_78, 3, 5),(id_hall_78, 3, 6),(id_hall_78, 3, 7),(id_hall_78, 3, 8),
		(id_hall_78, 4, 1),(id_hall_78, 4, 2),(id_hall_78, 4, 3),(id_hall_78, 4, 4),(id_hall_78, 4, 5),(id_hall_78, 4, 6),(id_hall_78, 4, 7),(id_hall_78, 4, 8),
		(id_hall_78, 5, 1),(id_hall_78, 5, 2),(id_hall_78, 5, 3),(id_hall_78, 5, 4),(id_hall_78, 5, 5),(id_hall_78, 5, 6),(id_hall_78, 5, 7),(id_hall_78, 5, 8),
		(id_hall_78, 6, 1),(id_hall_78, 6, 2),(id_hall_78, 6, 3),(id_hall_78, 6, 4),(id_hall_78, 6, 5),(id_hall_78, 6, 6),(id_hall_78, 6, 7),(id_hall_78, 6, 8),
		(id_hall_78, 7, 1),(id_hall_78, 7, 2),(id_hall_78, 7, 3),(id_hall_78, 7, 4),(id_hall_78, 7, 5),(id_hall_78, 7, 6),(id_hall_78, 7, 7),(id_hall_78, 7, 8),
		(id_hall_79, 1, 1),(id_hall_79, 1, 2),(id_hall_79, 1, 3),(id_hall_79, 1, 4),(id_hall_79, 1, 5),(id_hall_79, 1, 6),(id_hall_79, 1, 7),(id_hall_79, 1, 8),
		(id_hall_79, 2, 1),(id_hall_79, 2, 2),(id_hall_79, 2, 3),(id_hall_79, 2, 4),(id_hall_79, 2, 5),(id_hall_79, 2, 6),(id_hall_79, 2, 7),(id_hall_79, 2, 8),
		(id_hall_79, 3, 1),(id_hall_79, 3, 2),(id_hall_79, 3, 3),(id_hall_79, 3, 4),(id_hall_79, 3, 5),(id_hall_79, 3, 6),(id_hall_79, 3, 7),(id_hall_79, 3, 8),
		(id_hall_79, 4, 1),(id_hall_79, 4, 2),(id_hall_79, 4, 3),(id_hall_79, 4, 4),(id_hall_79, 4, 5),(id_hall_79, 4, 6),(id_hall_79, 4, 7),(id_hall_79, 4, 8),
		(id_hall_79, 5, 1),(id_hall_79, 5, 2),(id_hall_79, 5, 3),(id_hall_79, 5, 4),(id_hall_79, 5, 5),(id_hall_79, 5, 6),(id_hall_79, 5, 7),(id_hall_79, 5, 8),
		(id_hall_79, 6, 1),(id_hall_79, 6, 2),(id_hall_79, 6, 3),(id_hall_79, 6, 4),(id_hall_79, 6, 5),(id_hall_79, 6, 6),(id_hall_79, 6, 7),(id_hall_79, 6, 8),
		(id_hall_79, 7, 1),(id_hall_79, 7, 2),(id_hall_79, 7, 3),(id_hall_79, 7, 4),(id_hall_79, 7, 5),(id_hall_79, 7, 6),(id_hall_79, 7, 7),(id_hall_79, 7, 8),
		(id_hall_80, 1, 1),(id_hall_80, 1, 2),(id_hall_80, 1, 3),(id_hall_80, 1, 4),(id_hall_80, 1, 5),(id_hall_80, 1, 6),(id_hall_80, 1, 7),(id_hall_80, 1, 8),
		(id_hall_80, 2, 1),(id_hall_80, 2, 2),(id_hall_80, 2, 3),(id_hall_80, 2, 4),(id_hall_80, 2, 5),(id_hall_80, 2, 6),(id_hall_80, 2, 7),(id_hall_80, 2, 8),
		(id_hall_80, 3, 1),(id_hall_80, 3, 2),(id_hall_80, 3, 3),(id_hall_80, 3, 4),(id_hall_80, 3, 5),(id_hall_80, 3, 6),(id_hall_80, 3, 7),(id_hall_80, 3, 8),
		(id_hall_80, 4, 1),(id_hall_80, 4, 2),(id_hall_80, 4, 3),(id_hall_80, 4, 4),(id_hall_80, 4, 5),(id_hall_80, 4, 6),(id_hall_80, 4, 7),(id_hall_80, 4, 8),
		(id_hall_80, 5, 1),(id_hall_80, 5, 2),(id_hall_80, 5, 3),(id_hall_80, 5, 4),(id_hall_80, 5, 5),(id_hall_80, 5, 6),(id_hall_80, 5, 7),(id_hall_80, 5, 8),
		(id_hall_80, 6, 1),(id_hall_80, 6, 2),(id_hall_80, 6, 3),(id_hall_80, 6, 4),(id_hall_80, 6, 5),(id_hall_80, 6, 6),(id_hall_80, 6, 7),(id_hall_80, 6, 8),
		(id_hall_80, 7, 1),(id_hall_80, 7, 2),(id_hall_80, 7, 3),(id_hall_80, 7, 4),(id_hall_80, 7, 5),(id_hall_80, 7, 6),(id_hall_80, 7, 7),(id_hall_80, 7, 8),
		(id_hall_81, 1, 1),(id_hall_81, 1, 2),(id_hall_81, 1, 3),(id_hall_81, 1, 4),(id_hall_81, 1, 5),(id_hall_81, 1, 6),(id_hall_81, 1, 7),(id_hall_81, 1, 8),
		(id_hall_81, 2, 1),(id_hall_81, 2, 2),(id_hall_81, 2, 3),(id_hall_81, 2, 4),(id_hall_81, 2, 5),(id_hall_81, 2, 6),(id_hall_81, 2, 7),(id_hall_81, 2, 8),
		(id_hall_81, 3, 1),(id_hall_81, 3, 2),(id_hall_81, 3, 3),(id_hall_81, 3, 4),(id_hall_81, 3, 5),(id_hall_81, 3, 6),(id_hall_81, 3, 7),(id_hall_81, 3, 8),
		(id_hall_81, 4, 1),(id_hall_81, 4, 2),(id_hall_81, 4, 3),(id_hall_81, 4, 4),(id_hall_81, 4, 5),(id_hall_81, 4, 6),(id_hall_81, 4, 7),(id_hall_81, 4, 8),
		(id_hall_81, 5, 1),(id_hall_81, 5, 2),(id_hall_81, 5, 3),(id_hall_81, 5, 4),(id_hall_81, 5, 5),(id_hall_81, 5, 6),(id_hall_81, 5, 7),(id_hall_81, 5, 8),
		(id_hall_81, 6, 1),(id_hall_81, 6, 2),(id_hall_81, 6, 3),(id_hall_81, 6, 4),(id_hall_81, 6, 5),(id_hall_81, 6, 6),(id_hall_81, 6, 7),(id_hall_81, 6, 8),
		(id_hall_81, 7, 1),(id_hall_81, 7, 2),(id_hall_81, 7, 3),(id_hall_81, 7, 4),(id_hall_81, 7, 5),(id_hall_81, 7, 6),(id_hall_81, 7, 7),(id_hall_81, 7, 8),
		(id_hall_82, 1, 1),(id_hall_82, 1, 2),(id_hall_82, 1, 3),(id_hall_82, 1, 4),(id_hall_82, 1, 5),(id_hall_82, 1, 6),(id_hall_82, 1, 7),(id_hall_82, 1, 8),
		(id_hall_82, 2, 1),(id_hall_82, 2, 2),(id_hall_82, 2, 3),(id_hall_82, 2, 4),(id_hall_82, 2, 5),(id_hall_82, 2, 6),(id_hall_82, 2, 7),(id_hall_82, 2, 8),
		(id_hall_82, 3, 1),(id_hall_82, 3, 2),(id_hall_82, 3, 3),(id_hall_82, 3, 4),(id_hall_82, 3, 5),(id_hall_82, 3, 6),(id_hall_82, 3, 7),(id_hall_82, 3, 8),
		(id_hall_82, 4, 1),(id_hall_82, 4, 2),(id_hall_82, 4, 3),(id_hall_82, 4, 4),(id_hall_82, 4, 5),(id_hall_82, 4, 6),(id_hall_82, 4, 7),(id_hall_82, 4, 8),
		(id_hall_82, 5, 1),(id_hall_82, 5, 2),(id_hall_82, 5, 3),(id_hall_82, 5, 4),(id_hall_82, 5, 5),(id_hall_82, 5, 6),(id_hall_82, 5, 7),(id_hall_82, 5, 8),
		(id_hall_82, 6, 1),(id_hall_82, 6, 2),(id_hall_82, 6, 3),(id_hall_82, 6, 4),(id_hall_82, 6, 5),(id_hall_82, 6, 6),(id_hall_82, 6, 7),(id_hall_82, 6, 8),
		(id_hall_82, 7, 1),(id_hall_82, 7, 2),(id_hall_82, 7, 3),(id_hall_82, 7, 4),(id_hall_82, 7, 5),(id_hall_82, 7, 6),(id_hall_82, 7, 7),(id_hall_82, 7, 8),
		(id_hall_83, 1, 1),(id_hall_83, 1, 2),(id_hall_83, 1, 3),(id_hall_83, 1, 4),(id_hall_83, 1, 5),(id_hall_83, 1, 6),(id_hall_83, 1, 7),(id_hall_83, 1, 8),
		(id_hall_83, 2, 1),(id_hall_83, 2, 2),(id_hall_83, 2, 3),(id_hall_83, 2, 4),(id_hall_83, 2, 5),(id_hall_83, 2, 6),(id_hall_83, 2, 7),(id_hall_83, 2, 8),
		(id_hall_83, 3, 1),(id_hall_83, 3, 2),(id_hall_83, 3, 3),(id_hall_83, 3, 4),(id_hall_83, 3, 5),(id_hall_83, 3, 6),(id_hall_83, 3, 7),(id_hall_83, 3, 8),
		(id_hall_83, 4, 1),(id_hall_83, 4, 2),(id_hall_83, 4, 3),(id_hall_83, 4, 4),(id_hall_83, 4, 5),(id_hall_83, 4, 6),(id_hall_83, 4, 7),(id_hall_83, 4, 8),
		(id_hall_83, 5, 1),(id_hall_83, 5, 2),(id_hall_83, 5, 3),(id_hall_83, 5, 4),(id_hall_83, 5, 5),(id_hall_83, 5, 6),(id_hall_83, 5, 7),(id_hall_83, 5, 8),
		(id_hall_83, 6, 1),(id_hall_83, 6, 2),(id_hall_83, 6, 3),(id_hall_83, 6, 4),(id_hall_83, 6, 5),(id_hall_83, 6, 6),(id_hall_83, 6, 7),(id_hall_83, 6, 8),
		(id_hall_83, 7, 1),(id_hall_83, 7, 2),(id_hall_83, 7, 3),(id_hall_83, 7, 4),(id_hall_83, 7, 5),(id_hall_83, 7, 6),(id_hall_83, 7, 7),(id_hall_83, 7, 8),
		(id_hall_84, 1, 1),(id_hall_84, 1, 2),(id_hall_84, 1, 3),(id_hall_84, 1, 4),(id_hall_84, 1, 5),(id_hall_84, 1, 6),(id_hall_84, 1, 7),(id_hall_84, 1, 8),
		(id_hall_84, 2, 1),(id_hall_84, 2, 2),(id_hall_84, 2, 3),(id_hall_84, 2, 4),(id_hall_84, 2, 5),(id_hall_84, 2, 6),(id_hall_84, 2, 7),(id_hall_84, 2, 8),
		(id_hall_84, 3, 1),(id_hall_84, 3, 2),(id_hall_84, 3, 3),(id_hall_84, 3, 4),(id_hall_84, 3, 5),(id_hall_84, 3, 6),(id_hall_84, 3, 7),(id_hall_84, 3, 8),
		(id_hall_84, 4, 1),(id_hall_84, 4, 2),(id_hall_84, 4, 3),(id_hall_84, 4, 4),(id_hall_84, 4, 5),(id_hall_84, 4, 6),(id_hall_84, 4, 7),(id_hall_84, 4, 8),
		(id_hall_84, 5, 1),(id_hall_84, 5, 2),(id_hall_84, 5, 3),(id_hall_84, 5, 4),(id_hall_84, 5, 5),(id_hall_84, 5, 6),(id_hall_84, 5, 7),(id_hall_84, 5, 8),
		(id_hall_84, 6, 1),(id_hall_84, 6, 2),(id_hall_84, 6, 3),(id_hall_84, 6, 4),(id_hall_84, 6, 5),(id_hall_84, 6, 6),(id_hall_84, 6, 7),(id_hall_84, 6, 8),
		(id_hall_84, 7, 1),(id_hall_84, 7, 2),(id_hall_84, 7, 3),(id_hall_84, 7, 4),(id_hall_84, 7, 5),(id_hall_84, 7, 6),(id_hall_84, 7, 7),(id_hall_84, 7, 8),
		(id_hall_85, 1, 1),(id_hall_85, 1, 2),(id_hall_85, 1, 3),(id_hall_85, 1, 4),(id_hall_85, 1, 5),(id_hall_85, 1, 6),(id_hall_85, 1, 7),(id_hall_85, 1, 8),
		(id_hall_85, 2, 1),(id_hall_85, 2, 2),(id_hall_85, 2, 3),(id_hall_85, 2, 4),(id_hall_85, 2, 5),(id_hall_85, 2, 6),(id_hall_85, 2, 7),(id_hall_85, 2, 8),
		(id_hall_85, 3, 1),(id_hall_85, 3, 2),(id_hall_85, 3, 3),(id_hall_85, 3, 4),(id_hall_85, 3, 5),(id_hall_85, 3, 6),(id_hall_85, 3, 7),(id_hall_85, 3, 8),
		(id_hall_85, 4, 1),(id_hall_85, 4, 2),(id_hall_85, 4, 3),(id_hall_85, 4, 4),(id_hall_85, 4, 5),(id_hall_85, 4, 6),(id_hall_85, 4, 7),(id_hall_85, 4, 8),
		(id_hall_85, 5, 1),(id_hall_85, 5, 2),(id_hall_85, 5, 3),(id_hall_85, 5, 4),(id_hall_85, 5, 5),(id_hall_85, 5, 6),(id_hall_85, 5, 7),(id_hall_85, 5, 8),
		(id_hall_85, 6, 1),(id_hall_85, 6, 2),(id_hall_85, 6, 3),(id_hall_85, 6, 4),(id_hall_85, 6, 5),(id_hall_85, 6, 6),(id_hall_85, 6, 7),(id_hall_85, 6, 8),
		(id_hall_85, 7, 1),(id_hall_85, 7, 2),(id_hall_85, 7, 3),(id_hall_85, 7, 4),(id_hall_85, 7, 5),(id_hall_85, 7, 6),(id_hall_85, 7, 7),(id_hall_85, 7, 8),
		(id_hall_86, 1, 1),(id_hall_86, 1, 2),(id_hall_86, 1, 3),(id_hall_86, 1, 4),(id_hall_86, 1, 5),(id_hall_86, 1, 6),(id_hall_86, 1, 7),(id_hall_86, 1, 8),
		(id_hall_86, 2, 1),(id_hall_86, 2, 2),(id_hall_86, 2, 3),(id_hall_86, 2, 4),(id_hall_86, 2, 5),(id_hall_86, 2, 6),(id_hall_86, 2, 7),(id_hall_86, 2, 8),
		(id_hall_86, 3, 1),(id_hall_86, 3, 2),(id_hall_86, 3, 3),(id_hall_86, 3, 4),(id_hall_86, 3, 5),(id_hall_86, 3, 6),(id_hall_86, 3, 7),(id_hall_86, 3, 8),
		(id_hall_86, 4, 1),(id_hall_86, 4, 2),(id_hall_86, 4, 3),(id_hall_86, 4, 4),(id_hall_86, 4, 5),(id_hall_86, 4, 6),(id_hall_86, 4, 7),(id_hall_86, 4, 8),
		(id_hall_86, 5, 1),(id_hall_86, 5, 2),(id_hall_86, 5, 3),(id_hall_86, 5, 4),(id_hall_86, 5, 5),(id_hall_86, 5, 6),(id_hall_86, 5, 7),(id_hall_86, 5, 8),
		(id_hall_86, 6, 1),(id_hall_86, 6, 2),(id_hall_86, 6, 3),(id_hall_86, 6, 4),(id_hall_86, 6, 5),(id_hall_86, 6, 6),(id_hall_86, 6, 7),(id_hall_86, 6, 8),
		(id_hall_86, 7, 1),(id_hall_86, 7, 2),(id_hall_86, 7, 3),(id_hall_86, 7, 4),(id_hall_86, 7, 5),(id_hall_86, 7, 6),(id_hall_86, 7, 7),(id_hall_86, 7, 8),
		(id_hall_87, 1, 1),(id_hall_87, 1, 2),(id_hall_87, 1, 3),(id_hall_87, 1, 4),(id_hall_87, 1, 5),(id_hall_87, 1, 6),(id_hall_87, 1, 7),(id_hall_87, 1, 8),
		(id_hall_87, 2, 1),(id_hall_87, 2, 2),(id_hall_87, 2, 3),(id_hall_87, 2, 4),(id_hall_87, 2, 5),(id_hall_87, 2, 6),(id_hall_87, 2, 7),(id_hall_87, 2, 8),
		(id_hall_87, 3, 1),(id_hall_87, 3, 2),(id_hall_87, 3, 3),(id_hall_87, 3, 4),(id_hall_87, 3, 5),(id_hall_87, 3, 6),(id_hall_87, 3, 7),(id_hall_87, 3, 8),
		(id_hall_87, 4, 1),(id_hall_87, 4, 2),(id_hall_87, 4, 3),(id_hall_87, 4, 4),(id_hall_87, 4, 5),(id_hall_87, 4, 6),(id_hall_87, 4, 7),(id_hall_87, 4, 8),
		(id_hall_87, 5, 1),(id_hall_87, 5, 2),(id_hall_87, 5, 3),(id_hall_87, 5, 4),(id_hall_87, 5, 5),(id_hall_87, 5, 6),(id_hall_87, 5, 7),(id_hall_87, 5, 8),
		(id_hall_87, 6, 1),(id_hall_87, 6, 2),(id_hall_87, 6, 3),(id_hall_87, 6, 4),(id_hall_87, 6, 5),(id_hall_87, 6, 6),(id_hall_87, 6, 7),(id_hall_87, 6, 8),
		(id_hall_87, 7, 1),(id_hall_87, 7, 2),(id_hall_87, 7, 3),(id_hall_87, 7, 4),(id_hall_87, 7, 5),(id_hall_87, 7, 6),(id_hall_87, 7, 7),(id_hall_87, 7, 8),
		(id_hall_88, 1, 1),(id_hall_88, 1, 2),(id_hall_88, 1, 3),(id_hall_88, 1, 4),(id_hall_88, 1, 5),(id_hall_88, 1, 6),(id_hall_88, 1, 7),(id_hall_88, 1, 8),
		(id_hall_88, 2, 1),(id_hall_88, 2, 2),(id_hall_88, 2, 3),(id_hall_88, 2, 4),(id_hall_88, 2, 5),(id_hall_88, 2, 6),(id_hall_88, 2, 7),(id_hall_88, 2, 8),
		(id_hall_88, 3, 1),(id_hall_88, 3, 2),(id_hall_88, 3, 3),(id_hall_88, 3, 4),(id_hall_88, 3, 5),(id_hall_88, 3, 6),(id_hall_88, 3, 7),(id_hall_88, 3, 8),
		(id_hall_88, 4, 1),(id_hall_88, 4, 2),(id_hall_88, 4, 3),(id_hall_88, 4, 4),(id_hall_88, 4, 5),(id_hall_88, 4, 6),(id_hall_88, 4, 7),(id_hall_88, 4, 8),
		(id_hall_88, 5, 1),(id_hall_88, 5, 2),(id_hall_88, 5, 3),(id_hall_88, 5, 4),(id_hall_88, 5, 5),(id_hall_88, 5, 6),(id_hall_88, 5, 7),(id_hall_88, 5, 8),
		(id_hall_88, 6, 1),(id_hall_88, 6, 2),(id_hall_88, 6, 3),(id_hall_88, 6, 4),(id_hall_88, 6, 5),(id_hall_88, 6, 6),(id_hall_88, 6, 7),(id_hall_88, 6, 8),
		(id_hall_88, 7, 1),(id_hall_88, 7, 2),(id_hall_88, 7, 3),(id_hall_88, 7, 4),(id_hall_88, 7, 5),(id_hall_88, 7, 6),(id_hall_88, 7, 7),(id_hall_88, 7, 8),
		(id_hall_89, 1, 1),(id_hall_89, 1, 2),(id_hall_89, 1, 3),(id_hall_89, 1, 4),(id_hall_89, 1, 5),(id_hall_89, 1, 6),(id_hall_89, 1, 7),(id_hall_89, 1, 8),
		(id_hall_89, 2, 1),(id_hall_89, 2, 2),(id_hall_89, 2, 3),(id_hall_89, 2, 4),(id_hall_89, 2, 5),(id_hall_89, 2, 6),(id_hall_89, 2, 7),(id_hall_89, 2, 8),
		(id_hall_89, 3, 1),(id_hall_89, 3, 2),(id_hall_89, 3, 3),(id_hall_89, 3, 4),(id_hall_89, 3, 5),(id_hall_89, 3, 6),(id_hall_89, 3, 7),(id_hall_89, 3, 8),
		(id_hall_89, 4, 1),(id_hall_89, 4, 2),(id_hall_89, 4, 3),(id_hall_89, 4, 4),(id_hall_89, 4, 5),(id_hall_89, 4, 6),(id_hall_89, 4, 7),(id_hall_89, 4, 8),
		(id_hall_89, 5, 1),(id_hall_89, 5, 2),(id_hall_89, 5, 3),(id_hall_89, 5, 4),(id_hall_89, 5, 5),(id_hall_89, 5, 6),(id_hall_89, 5, 7),(id_hall_89, 5, 8),
		(id_hall_89, 6, 1),(id_hall_89, 6, 2),(id_hall_89, 6, 3),(id_hall_89, 6, 4),(id_hall_89, 6, 5),(id_hall_89, 6, 6),(id_hall_89, 6, 7),(id_hall_89, 6, 8),
		(id_hall_89, 7, 1),(id_hall_89, 7, 2),(id_hall_89, 7, 3),(id_hall_89, 7, 4),(id_hall_89, 7, 5),(id_hall_89, 7, 6),(id_hall_89, 7, 7),(id_hall_89, 7, 8),
		(id_hall_90, 1, 1),(id_hall_90, 1, 2),(id_hall_90, 1, 3),(id_hall_90, 1, 4),(id_hall_90, 1, 5),(id_hall_90, 1, 6),(id_hall_90, 1, 7),(id_hall_90, 1, 8),
		(id_hall_90, 2, 1),(id_hall_90, 2, 2),(id_hall_90, 2, 3),(id_hall_90, 2, 4),(id_hall_90, 2, 5),(id_hall_90, 2, 6),(id_hall_90, 2, 7),(id_hall_90, 2, 8),
		(id_hall_90, 3, 1),(id_hall_90, 3, 2),(id_hall_90, 3, 3),(id_hall_90, 3, 4),(id_hall_90, 3, 5),(id_hall_90, 3, 6),(id_hall_90, 3, 7),(id_hall_90, 3, 8),
		(id_hall_90, 4, 1),(id_hall_90, 4, 2),(id_hall_90, 4, 3),(id_hall_90, 4, 4),(id_hall_90, 4, 5),(id_hall_90, 4, 6),(id_hall_90, 4, 7),(id_hall_90, 4, 8),
		(id_hall_90, 5, 1),(id_hall_90, 5, 2),(id_hall_90, 5, 3),(id_hall_90, 5, 4),(id_hall_90, 5, 5),(id_hall_90, 5, 6),(id_hall_90, 5, 7),(id_hall_90, 5, 8),
		(id_hall_90, 6, 1),(id_hall_90, 6, 2),(id_hall_90, 6, 3),(id_hall_90, 6, 4),(id_hall_90, 6, 5),(id_hall_90, 6, 6),(id_hall_90, 6, 7),(id_hall_90, 6, 8),
		(id_hall_90, 7, 1),(id_hall_90, 7, 2),(id_hall_90, 7, 3),(id_hall_90, 7, 4),(id_hall_90, 7, 5),(id_hall_90, 7, 6),(id_hall_90, 7, 7),(id_hall_90, 7, 8),
		(id_hall_91, 1, 1),(id_hall_91, 1, 2),(id_hall_91, 1, 3),(id_hall_91, 1, 4),(id_hall_91, 1, 5),(id_hall_91, 1, 6),(id_hall_91, 1, 7),(id_hall_91, 1, 8),
		(id_hall_91, 2, 1),(id_hall_91, 2, 2),(id_hall_91, 2, 3),(id_hall_91, 2, 4),(id_hall_91, 2, 5),(id_hall_91, 2, 6),(id_hall_91, 2, 7),(id_hall_91, 2, 8),
		(id_hall_91, 3, 1),(id_hall_91, 3, 2),(id_hall_91, 3, 3),(id_hall_91, 3, 4),(id_hall_91, 3, 5),(id_hall_91, 3, 6),(id_hall_91, 3, 7),(id_hall_91, 3, 8),
		(id_hall_91, 4, 1),(id_hall_91, 4, 2),(id_hall_91, 4, 3),(id_hall_91, 4, 4),(id_hall_91, 4, 5),(id_hall_91, 4, 6),(id_hall_91, 4, 7),(id_hall_91, 4, 8),
		(id_hall_91, 5, 1),(id_hall_91, 5, 2),(id_hall_91, 5, 3),(id_hall_91, 5, 4),(id_hall_91, 5, 5),(id_hall_91, 5, 6),(id_hall_91, 5, 7),(id_hall_91, 5, 8),
		(id_hall_91, 6, 1),(id_hall_91, 6, 2),(id_hall_91, 6, 3),(id_hall_91, 6, 4),(id_hall_91, 6, 5),(id_hall_91, 6, 6),(id_hall_91, 6, 7),(id_hall_91, 6, 8),
		(id_hall_91, 7, 1),(id_hall_91, 7, 2),(id_hall_91, 7, 3),(id_hall_91, 7, 4),(id_hall_91, 7, 5),(id_hall_91, 7, 6),(id_hall_91, 7, 7),(id_hall_91, 7, 8),
		(id_hall_92, 1, 1),(id_hall_92, 1, 2),(id_hall_92, 1, 3),(id_hall_92, 1, 4),(id_hall_92, 1, 5),(id_hall_92, 1, 6),(id_hall_92, 1, 7),(id_hall_92, 1, 8),
		(id_hall_92, 2, 1),(id_hall_92, 2, 2),(id_hall_92, 2, 3),(id_hall_92, 2, 4),(id_hall_92, 2, 5),(id_hall_92, 2, 6),(id_hall_92, 2, 7),(id_hall_92, 2, 8),
		(id_hall_92, 3, 1),(id_hall_92, 3, 2),(id_hall_92, 3, 3),(id_hall_92, 3, 4),(id_hall_92, 3, 5),(id_hall_92, 3, 6),(id_hall_92, 3, 7),(id_hall_92, 3, 8),
		(id_hall_92, 4, 1),(id_hall_92, 4, 2),(id_hall_92, 4, 3),(id_hall_92, 4, 4),(id_hall_92, 4, 5),(id_hall_92, 4, 6),(id_hall_92, 4, 7),(id_hall_92, 4, 8),
		(id_hall_92, 5, 1),(id_hall_92, 5, 2),(id_hall_92, 5, 3),(id_hall_92, 5, 4),(id_hall_92, 5, 5),(id_hall_92, 5, 6),(id_hall_92, 5, 7),(id_hall_92, 5, 8),
		(id_hall_92, 6, 1),(id_hall_92, 6, 2),(id_hall_92, 6, 3),(id_hall_92, 6, 4),(id_hall_92, 6, 5),(id_hall_92, 6, 6),(id_hall_92, 6, 7),(id_hall_92, 6, 8),
		(id_hall_92, 7, 1),(id_hall_92, 7, 2),(id_hall_92, 7, 3),(id_hall_92, 7, 4),(id_hall_92, 7, 5),(id_hall_92, 7, 6),(id_hall_92, 7, 7),(id_hall_92, 7, 8),
		(id_hall_93, 1, 1),(id_hall_93, 1, 2),(id_hall_93, 1, 3),(id_hall_93, 1, 4),(id_hall_93, 1, 5),(id_hall_93, 1, 6),(id_hall_93, 1, 7),(id_hall_93, 1, 8),
		(id_hall_93, 2, 1),(id_hall_93, 2, 2),(id_hall_93, 2, 3),(id_hall_93, 2, 4),(id_hall_93, 2, 5),(id_hall_93, 2, 6),(id_hall_93, 2, 7),(id_hall_93, 2, 8),
		(id_hall_93, 3, 1),(id_hall_93, 3, 2),(id_hall_93, 3, 3),(id_hall_93, 3, 4),(id_hall_93, 3, 5),(id_hall_93, 3, 6),(id_hall_93, 3, 7),(id_hall_93, 3, 8),
		(id_hall_93, 4, 1),(id_hall_93, 4, 2),(id_hall_93, 4, 3),(id_hall_93, 4, 4),(id_hall_93, 4, 5),(id_hall_93, 4, 6),(id_hall_93, 4, 7),(id_hall_93, 4, 8),
		(id_hall_93, 5, 1),(id_hall_93, 5, 2),(id_hall_93, 5, 3),(id_hall_93, 5, 4),(id_hall_93, 5, 5),(id_hall_93, 5, 6),(id_hall_93, 5, 7),(id_hall_93, 5, 8),
		(id_hall_93, 6, 1),(id_hall_93, 6, 2),(id_hall_93, 6, 3),(id_hall_93, 6, 4),(id_hall_93, 6, 5),(id_hall_93, 6, 6),(id_hall_93, 6, 7),(id_hall_93, 6, 8),
		(id_hall_93, 7, 1),(id_hall_93, 7, 2),(id_hall_93, 7, 3),(id_hall_93, 7, 4),(id_hall_93, 7, 5),(id_hall_93, 7, 6),(id_hall_93, 7, 7),(id_hall_93, 7, 8),
		(id_hall_94, 1, 1),(id_hall_94, 1, 2),(id_hall_94, 1, 3),(id_hall_94, 1, 4),(id_hall_94, 1, 5),(id_hall_94, 1, 6),(id_hall_94, 1, 7),(id_hall_94, 1, 8),
		(id_hall_94, 2, 1),(id_hall_94, 2, 2),(id_hall_94, 2, 3),(id_hall_94, 2, 4),(id_hall_94, 2, 5),(id_hall_94, 2, 6),(id_hall_94, 2, 7),(id_hall_94, 2, 8),
		(id_hall_94, 3, 1),(id_hall_94, 3, 2),(id_hall_94, 3, 3),(id_hall_94, 3, 4),(id_hall_94, 3, 5),(id_hall_94, 3, 6),(id_hall_94, 3, 7),(id_hall_94, 3, 8),
		(id_hall_94, 4, 1),(id_hall_94, 4, 2),(id_hall_94, 4, 3),(id_hall_94, 4, 4),(id_hall_94, 4, 5),(id_hall_94, 4, 6),(id_hall_94, 4, 7),(id_hall_94, 4, 8),
		(id_hall_94, 5, 1),(id_hall_94, 5, 2),(id_hall_94, 5, 3),(id_hall_94, 5, 4),(id_hall_94, 5, 5),(id_hall_94, 5, 6),(id_hall_94, 5, 7),(id_hall_94, 5, 8),
		(id_hall_94, 6, 1),(id_hall_94, 6, 2),(id_hall_94, 6, 3),(id_hall_94, 6, 4),(id_hall_94, 6, 5),(id_hall_94, 6, 6),(id_hall_94, 6, 7),(id_hall_94, 6, 8),
		(id_hall_94, 7, 1),(id_hall_94, 7, 2),(id_hall_94, 7, 3),(id_hall_94, 7, 4),(id_hall_94, 7, 5),(id_hall_94, 7, 6),(id_hall_94, 7, 7),(id_hall_94, 7, 8),
		(id_hall_95, 1, 1),(id_hall_95, 1, 2),(id_hall_95, 1, 3),(id_hall_95, 1, 4),(id_hall_95, 1, 5),(id_hall_95, 1, 6),(id_hall_95, 1, 7),(id_hall_95, 1, 8),
		(id_hall_95, 2, 1),(id_hall_95, 2, 2),(id_hall_95, 2, 3),(id_hall_95, 2, 4),(id_hall_95, 2, 5),(id_hall_95, 2, 6),(id_hall_95, 2, 7),(id_hall_95, 2, 8),
		(id_hall_95, 3, 1),(id_hall_95, 3, 2),(id_hall_95, 3, 3),(id_hall_95, 3, 4),(id_hall_95, 3, 5),(id_hall_95, 3, 6),(id_hall_95, 3, 7),(id_hall_95, 3, 8),
		(id_hall_95, 4, 1),(id_hall_95, 4, 2),(id_hall_95, 4, 3),(id_hall_95, 4, 4),(id_hall_95, 4, 5),(id_hall_95, 4, 6),(id_hall_95, 4, 7),(id_hall_95, 4, 8),
		(id_hall_95, 5, 1),(id_hall_95, 5, 2),(id_hall_95, 5, 3),(id_hall_95, 5, 4),(id_hall_95, 5, 5),(id_hall_95, 5, 6),(id_hall_95, 5, 7),(id_hall_95, 5, 8),
		(id_hall_95, 6, 1),(id_hall_95, 6, 2),(id_hall_95, 6, 3),(id_hall_95, 6, 4),(id_hall_95, 6, 5),(id_hall_95, 6, 6),(id_hall_95, 6, 7),(id_hall_95, 6, 8),
		(id_hall_95, 7, 1),(id_hall_95, 7, 2),(id_hall_95, 7, 3),(id_hall_95, 7, 4),(id_hall_95, 7, 5),(id_hall_95, 7, 6),(id_hall_95, 7, 7),(id_hall_95, 7, 8),
		(id_hall_96, 1, 1),(id_hall_96, 1, 2),(id_hall_96, 1, 3),(id_hall_96, 1, 4),(id_hall_96, 1, 5),(id_hall_96, 1, 6),(id_hall_96, 1, 7),(id_hall_96, 1, 8),
		(id_hall_96, 2, 1),(id_hall_96, 2, 2),(id_hall_96, 2, 3),(id_hall_96, 2, 4),(id_hall_96, 2, 5),(id_hall_96, 2, 6),(id_hall_96, 2, 7),(id_hall_96, 2, 8),
		(id_hall_96, 3, 1),(id_hall_96, 3, 2),(id_hall_96, 3, 3),(id_hall_96, 3, 4),(id_hall_96, 3, 5),(id_hall_96, 3, 6),(id_hall_96, 3, 7),(id_hall_96, 3, 8),
		(id_hall_96, 4, 1),(id_hall_96, 4, 2),(id_hall_96, 4, 3),(id_hall_96, 4, 4),(id_hall_96, 4, 5),(id_hall_96, 4, 6),(id_hall_96, 4, 7),(id_hall_96, 4, 8),
		(id_hall_96, 5, 1),(id_hall_96, 5, 2),(id_hall_96, 5, 3),(id_hall_96, 5, 4),(id_hall_96, 5, 5),(id_hall_96, 5, 6),(id_hall_96, 5, 7),(id_hall_96, 5, 8),
		(id_hall_96, 6, 1),(id_hall_96, 6, 2),(id_hall_96, 6, 3),(id_hall_96, 6, 4),(id_hall_96, 6, 5),(id_hall_96, 6, 6),(id_hall_96, 6, 7),(id_hall_96, 6, 8),
		(id_hall_96, 7, 1),(id_hall_96, 7, 2),(id_hall_96, 7, 3),(id_hall_96, 7, 4),(id_hall_96, 7, 5),(id_hall_96, 7, 6),(id_hall_96, 7, 7),(id_hall_96, 7, 8),
		(id_hall_97, 1, 1),(id_hall_97, 1, 2),(id_hall_97, 1, 3),(id_hall_97, 1, 4),(id_hall_97, 1, 5),(id_hall_97, 1, 6),(id_hall_97, 1, 7),(id_hall_97, 1, 8),
		(id_hall_97, 2, 1),(id_hall_97, 2, 2),(id_hall_97, 2, 3),(id_hall_97, 2, 4),(id_hall_97, 2, 5),(id_hall_97, 2, 6),(id_hall_97, 2, 7),(id_hall_97, 2, 8),
		(id_hall_97, 3, 1),(id_hall_97, 3, 2),(id_hall_97, 3, 3),(id_hall_97, 3, 4),(id_hall_97, 3, 5),(id_hall_97, 3, 6),(id_hall_97, 3, 7),(id_hall_97, 3, 8),
		(id_hall_97, 4, 1),(id_hall_97, 4, 2),(id_hall_97, 4, 3),(id_hall_97, 4, 4),(id_hall_97, 4, 5),(id_hall_97, 4, 6),(id_hall_97, 4, 7),(id_hall_97, 4, 8),
		(id_hall_97, 5, 1),(id_hall_97, 5, 2),(id_hall_97, 5, 3),(id_hall_97, 5, 4),(id_hall_97, 5, 5),(id_hall_97, 5, 6),(id_hall_97, 5, 7),(id_hall_97, 5, 8),
		(id_hall_97, 6, 1),(id_hall_97, 6, 2),(id_hall_97, 6, 3),(id_hall_97, 6, 4),(id_hall_97, 6, 5),(id_hall_97, 6, 6),(id_hall_97, 6, 7),(id_hall_97, 6, 8),
		(id_hall_97, 7, 1),(id_hall_97, 7, 2),(id_hall_97, 7, 3),(id_hall_97, 7, 4),(id_hall_97, 7, 5),(id_hall_97, 7, 6),(id_hall_97, 7, 7),(id_hall_97, 7, 8),
		(id_hall_98, 1, 1),(id_hall_98, 1, 2),(id_hall_98, 1, 3),(id_hall_98, 1, 4),(id_hall_98, 1, 5),(id_hall_98, 1, 6),(id_hall_98, 1, 7),(id_hall_98, 1, 8),
		(id_hall_98, 2, 1),(id_hall_98, 2, 2),(id_hall_98, 2, 3),(id_hall_98, 2, 4),(id_hall_98, 2, 5),(id_hall_98, 2, 6),(id_hall_98, 2, 7),(id_hall_98, 2, 8),
		(id_hall_98, 3, 1),(id_hall_98, 3, 2),(id_hall_98, 3, 3),(id_hall_98, 3, 4),(id_hall_98, 3, 5),(id_hall_98, 3, 6),(id_hall_98, 3, 7),(id_hall_98, 3, 8),
		(id_hall_98, 4, 1),(id_hall_98, 4, 2),(id_hall_98, 4, 3),(id_hall_98, 4, 4),(id_hall_98, 4, 5),(id_hall_98, 4, 6),(id_hall_98, 4, 7),(id_hall_98, 4, 8),
		(id_hall_98, 5, 1),(id_hall_98, 5, 2),(id_hall_98, 5, 3),(id_hall_98, 5, 4),(id_hall_98, 5, 5),(id_hall_98, 5, 6),(id_hall_98, 5, 7),(id_hall_98, 5, 8),
		(id_hall_98, 6, 1),(id_hall_98, 6, 2),(id_hall_98, 6, 3),(id_hall_98, 6, 4),(id_hall_98, 6, 5),(id_hall_98, 6, 6),(id_hall_98, 6, 7),(id_hall_98, 6, 8),
		(id_hall_98, 7, 1),(id_hall_98, 7, 2),(id_hall_98, 7, 3),(id_hall_98, 7, 4),(id_hall_98, 7, 5),(id_hall_98, 7, 6),(id_hall_98, 7, 7),(id_hall_98, 7, 8),
		(id_hall_99, 1, 1),(id_hall_99, 1, 2),(id_hall_99, 1, 3),(id_hall_99, 1, 4),(id_hall_99, 1, 5),(id_hall_99, 1, 6),(id_hall_99, 1, 7),(id_hall_99, 1, 8),
		(id_hall_99, 2, 1),(id_hall_99, 2, 2),(id_hall_99, 2, 3),(id_hall_99, 2, 4),(id_hall_99, 2, 5),(id_hall_99, 2, 6),(id_hall_99, 2, 7),(id_hall_99, 2, 8),
		(id_hall_99, 3, 1),(id_hall_99, 3, 2),(id_hall_99, 3, 3),(id_hall_99, 3, 4),(id_hall_99, 3, 5),(id_hall_99, 3, 6),(id_hall_99, 3, 7),(id_hall_99, 3, 8),
		(id_hall_99, 4, 1),(id_hall_99, 4, 2),(id_hall_99, 4, 3),(id_hall_99, 4, 4),(id_hall_99, 4, 5),(id_hall_99, 4, 6),(id_hall_99, 4, 7),(id_hall_99, 4, 8),
		(id_hall_99, 5, 1),(id_hall_99, 5, 2),(id_hall_99, 5, 3),(id_hall_99, 5, 4),(id_hall_99, 5, 5),(id_hall_99, 5, 6),(id_hall_99, 5, 7),(id_hall_99, 5, 8),
		(id_hall_99, 6, 1),(id_hall_99, 6, 2),(id_hall_99, 6, 3),(id_hall_99, 6, 4),(id_hall_99, 6, 5),(id_hall_99, 6, 6),(id_hall_99, 6, 7),(id_hall_99, 6, 8),
		(id_hall_99, 7, 1),(id_hall_99, 7, 2),(id_hall_99, 7, 3),(id_hall_99, 7, 4),(id_hall_99, 7, 5),(id_hall_99, 7, 6),(id_hall_99, 7, 7),(id_hall_99, 7, 8),
		(id_hall_100, 1, 1),(id_hall_100, 1, 2),(id_hall_100, 1, 3),(id_hall_100, 1, 4),(id_hall_100, 1, 5),(id_hall_100, 1, 6),(id_hall_100, 1, 7),(id_hall_100, 1, 8),
		(id_hall_100, 2, 1),(id_hall_100, 2, 2),(id_hall_100, 2, 3),(id_hall_100, 2, 4),(id_hall_100, 2, 5),(id_hall_100, 2, 6),(id_hall_100, 2, 7),(id_hall_100, 2, 8),
		(id_hall_100, 3, 1),(id_hall_100, 3, 2),(id_hall_100, 3, 3),(id_hall_100, 3, 4),(id_hall_100, 3, 5),(id_hall_100, 3, 6),(id_hall_100, 3, 7),(id_hall_100, 3, 8),
		(id_hall_100, 4, 1),(id_hall_100, 4, 2),(id_hall_100, 4, 3),(id_hall_100, 4, 4),(id_hall_100, 4, 5),(id_hall_100, 4, 6),(id_hall_100, 4, 7),(id_hall_100, 4, 8),
		(id_hall_100, 5, 1),(id_hall_100, 5, 2),(id_hall_100, 5, 3),(id_hall_100, 5, 4),(id_hall_100, 5, 5),(id_hall_100, 5, 6),(id_hall_100, 5, 7),(id_hall_100, 5, 8),
		(id_hall_100, 6, 1),(id_hall_100, 6, 2),(id_hall_100, 6, 3),(id_hall_100, 6, 4),(id_hall_100, 6, 5),(id_hall_100, 6, 6),(id_hall_100, 6, 7),(id_hall_100, 6, 8),
		(id_hall_100, 7, 1),(id_hall_100, 7, 2),(id_hall_100, 7, 3),(id_hall_100, 7, 4),(id_hall_100, 7, 5),(id_hall_100, 7, 6),(id_hall_100, 7, 7),(id_hall_100, 7, 8),
		(id_hall_101, 1, 1),(id_hall_101, 1, 2),(id_hall_101, 1, 3),(id_hall_101, 1, 4),(id_hall_101, 1, 5),(id_hall_101, 1, 6),(id_hall_101, 1, 7),(id_hall_101, 1, 8),
		(id_hall_101, 2, 1),(id_hall_101, 2, 2),(id_hall_101, 2, 3),(id_hall_101, 2, 4),(id_hall_101, 2, 5),(id_hall_101, 2, 6),(id_hall_101, 2, 7),(id_hall_101, 2, 8),
		(id_hall_101, 3, 1),(id_hall_101, 3, 2),(id_hall_101, 3, 3),(id_hall_101, 3, 4),(id_hall_101, 3, 5),(id_hall_101, 3, 6),(id_hall_101, 3, 7),(id_hall_101, 3, 8),
		(id_hall_101, 4, 1),(id_hall_101, 4, 2),(id_hall_101, 4, 3),(id_hall_101, 4, 4),(id_hall_101, 4, 5),(id_hall_101, 4, 6),(id_hall_101, 4, 7),(id_hall_101, 4, 8),
		(id_hall_101, 5, 1),(id_hall_101, 5, 2),(id_hall_101, 5, 3),(id_hall_101, 5, 4),(id_hall_101, 5, 5),(id_hall_101, 5, 6),(id_hall_101, 5, 7),(id_hall_101, 5, 8),
		(id_hall_101, 6, 1),(id_hall_101, 6, 2),(id_hall_101, 6, 3),(id_hall_101, 6, 4),(id_hall_101, 6, 5),(id_hall_101, 6, 6),(id_hall_101, 6, 7),(id_hall_101, 6, 8),
		(id_hall_101, 7, 1),(id_hall_101, 7, 2),(id_hall_101, 7, 3),(id_hall_101, 7, 4),(id_hall_101, 7, 5),(id_hall_101, 7, 6),(id_hall_101, 7, 7),(id_hall_101, 7, 8),
		(id_hall_102, 1, 1),(id_hall_102, 1, 2),(id_hall_102, 1, 3),(id_hall_102, 1, 4),(id_hall_102, 1, 5),(id_hall_102, 1, 6),(id_hall_102, 1, 7),(id_hall_102, 1, 8),
		(id_hall_102, 2, 1),(id_hall_102, 2, 2),(id_hall_102, 2, 3),(id_hall_102, 2, 4),(id_hall_102, 2, 5),(id_hall_102, 2, 6),(id_hall_102, 2, 7),(id_hall_102, 2, 8),
		(id_hall_102, 3, 1),(id_hall_102, 3, 2),(id_hall_102, 3, 3),(id_hall_102, 3, 4),(id_hall_102, 3, 5),(id_hall_102, 3, 6),(id_hall_102, 3, 7),(id_hall_102, 3, 8),
		(id_hall_102, 4, 1),(id_hall_102, 4, 2),(id_hall_102, 4, 3),(id_hall_102, 4, 4),(id_hall_102, 4, 5),(id_hall_102, 4, 6),(id_hall_102, 4, 7),(id_hall_102, 4, 8),
		(id_hall_102, 5, 1),(id_hall_102, 5, 2),(id_hall_102, 5, 3),(id_hall_102, 5, 4),(id_hall_102, 5, 5),(id_hall_102, 5, 6),(id_hall_102, 5, 7),(id_hall_102, 5, 8),
		(id_hall_102, 6, 1),(id_hall_102, 6, 2),(id_hall_102, 6, 3),(id_hall_102, 6, 4),(id_hall_102, 6, 5),(id_hall_102, 6, 6),(id_hall_102, 6, 7),(id_hall_102, 6, 8),
		(id_hall_102, 7, 1),(id_hall_102, 7, 2),(id_hall_102, 7, 3),(id_hall_102, 7, 4),(id_hall_102, 7, 5),(id_hall_102, 7, 6),(id_hall_102, 7, 7),(id_hall_102, 7, 8),
		(id_hall_103, 1, 1),(id_hall_103, 1, 2),(id_hall_103, 1, 3),(id_hall_103, 1, 4),(id_hall_103, 1, 5),(id_hall_103, 1, 6),(id_hall_103, 1, 7),(id_hall_103, 1, 8),
		(id_hall_103, 2, 1),(id_hall_103, 2, 2),(id_hall_103, 2, 3),(id_hall_103, 2, 4),(id_hall_103, 2, 5),(id_hall_103, 2, 6),(id_hall_103, 2, 7),(id_hall_103, 2, 8),
		(id_hall_103, 3, 1),(id_hall_103, 3, 2),(id_hall_103, 3, 3),(id_hall_103, 3, 4),(id_hall_103, 3, 5),(id_hall_103, 3, 6),(id_hall_103, 3, 7),(id_hall_103, 3, 8),
		(id_hall_103, 4, 1),(id_hall_103, 4, 2),(id_hall_103, 4, 3),(id_hall_103, 4, 4),(id_hall_103, 4, 5),(id_hall_103, 4, 6),(id_hall_103, 4, 7),(id_hall_103, 4, 8),
		(id_hall_103, 5, 1),(id_hall_103, 5, 2),(id_hall_103, 5, 3),(id_hall_103, 5, 4),(id_hall_103, 5, 5),(id_hall_103, 5, 6),(id_hall_103, 5, 7),(id_hall_103, 5, 8),
		(id_hall_103, 6, 1),(id_hall_103, 6, 2),(id_hall_103, 6, 3),(id_hall_103, 6, 4),(id_hall_103, 6, 5),(id_hall_103, 6, 6),(id_hall_103, 6, 7),(id_hall_103, 6, 8),
		(id_hall_103, 7, 1),(id_hall_103, 7, 2),(id_hall_103, 7, 3),(id_hall_103, 7, 4),(id_hall_103, 7, 5),(id_hall_103, 7, 6),(id_hall_103, 7, 7),(id_hall_103, 7, 8),
		(id_hall_104, 1, 1),(id_hall_104, 1, 2),(id_hall_104, 1, 3),(id_hall_104, 1, 4),(id_hall_104, 1, 5),(id_hall_104, 1, 6),(id_hall_104, 1, 7),(id_hall_104, 1, 8),
		(id_hall_104, 2, 1),(id_hall_104, 2, 2),(id_hall_104, 2, 3),(id_hall_104, 2, 4),(id_hall_104, 2, 5),(id_hall_104, 2, 6),(id_hall_104, 2, 7),(id_hall_104, 2, 8),
		(id_hall_104, 3, 1),(id_hall_104, 3, 2),(id_hall_104, 3, 3),(id_hall_104, 3, 4),(id_hall_104, 3, 5),(id_hall_104, 3, 6),(id_hall_104, 3, 7),(id_hall_104, 3, 8),
		(id_hall_104, 4, 1),(id_hall_104, 4, 2),(id_hall_104, 4, 3),(id_hall_104, 4, 4),(id_hall_104, 4, 5),(id_hall_104, 4, 6),(id_hall_104, 4, 7),(id_hall_104, 4, 8),
		(id_hall_104, 5, 1),(id_hall_104, 5, 2),(id_hall_104, 5, 3),(id_hall_104, 5, 4),(id_hall_104, 5, 5),(id_hall_104, 5, 6),(id_hall_104, 5, 7),(id_hall_104, 5, 8),
		(id_hall_104, 6, 1),(id_hall_104, 6, 2),(id_hall_104, 6, 3),(id_hall_104, 6, 4),(id_hall_104, 6, 5),(id_hall_104, 6, 6),(id_hall_104, 6, 7),(id_hall_104, 6, 8),
		(id_hall_104, 7, 1),(id_hall_104, 7, 2),(id_hall_104, 7, 3),(id_hall_104, 7, 4),(id_hall_104, 7, 5),(id_hall_104, 7, 6),(id_hall_104, 7, 7),(id_hall_104, 7, 8),
		(id_hall_105, 1, 1),(id_hall_105, 1, 2),(id_hall_105, 1, 3),(id_hall_105, 1, 4),(id_hall_105, 1, 5),(id_hall_105, 1, 6),(id_hall_105, 1, 7),(id_hall_105, 1, 8),
		(id_hall_105, 2, 1),(id_hall_105, 2, 2),(id_hall_105, 2, 3),(id_hall_105, 2, 4),(id_hall_105, 2, 5),(id_hall_105, 2, 6),(id_hall_105, 2, 7),(id_hall_105, 2, 8),
		(id_hall_105, 3, 1),(id_hall_105, 3, 2),(id_hall_105, 3, 3),(id_hall_105, 3, 4),(id_hall_105, 3, 5),(id_hall_105, 3, 6),(id_hall_105, 3, 7),(id_hall_105, 3, 8),
		(id_hall_105, 4, 1),(id_hall_105, 4, 2),(id_hall_105, 4, 3),(id_hall_105, 4, 4),(id_hall_105, 4, 5),(id_hall_105, 4, 6),(id_hall_105, 4, 7),(id_hall_105, 4, 8),
		(id_hall_105, 5, 1),(id_hall_105, 5, 2),(id_hall_105, 5, 3),(id_hall_105, 5, 4),(id_hall_105, 5, 5),(id_hall_105, 5, 6),(id_hall_105, 5, 7),(id_hall_105, 5, 8),
		(id_hall_105, 6, 1),(id_hall_105, 6, 2),(id_hall_105, 6, 3),(id_hall_105, 6, 4),(id_hall_105, 6, 5),(id_hall_105, 6, 6),(id_hall_105, 6, 7),(id_hall_105, 6, 8),
		(id_hall_105, 7, 1),(id_hall_105, 7, 2),(id_hall_105, 7, 3),(id_hall_105, 7, 4),(id_hall_105, 7, 5),(id_hall_105, 7, 6),(id_hall_105, 7, 7),(id_hall_105, 7, 8),
		(id_hall_106, 1, 1),(id_hall_106, 1, 2),(id_hall_106, 1, 3),(id_hall_106, 1, 4),(id_hall_106, 1, 5),(id_hall_106, 1, 6),(id_hall_106, 1, 7),(id_hall_106, 1, 8),
		(id_hall_106, 2, 1),(id_hall_106, 2, 2),(id_hall_106, 2, 3),(id_hall_106, 2, 4),(id_hall_106, 2, 5),(id_hall_106, 2, 6),(id_hall_106, 2, 7),(id_hall_106, 2, 8),
		(id_hall_106, 3, 1),(id_hall_106, 3, 2),(id_hall_106, 3, 3),(id_hall_106, 3, 4),(id_hall_106, 3, 5),(id_hall_106, 3, 6),(id_hall_106, 3, 7),(id_hall_106, 3, 8),
		(id_hall_106, 4, 1),(id_hall_106, 4, 2),(id_hall_106, 4, 3),(id_hall_106, 4, 4),(id_hall_106, 4, 5),(id_hall_106, 4, 6),(id_hall_106, 4, 7),(id_hall_106, 4, 8),
		(id_hall_106, 5, 1),(id_hall_106, 5, 2),(id_hall_106, 5, 3),(id_hall_106, 5, 4),(id_hall_106, 5, 5),(id_hall_106, 5, 6),(id_hall_106, 5, 7),(id_hall_106, 5, 8),
		(id_hall_106, 6, 1),(id_hall_106, 6, 2),(id_hall_106, 6, 3),(id_hall_106, 6, 4),(id_hall_106, 6, 5),(id_hall_106, 6, 6),(id_hall_106, 6, 7),(id_hall_106, 6, 8),
		(id_hall_106, 7, 1),(id_hall_106, 7, 2),(id_hall_106, 7, 3),(id_hall_106, 7, 4),(id_hall_106, 7, 5),(id_hall_106, 7, 6),(id_hall_106, 7, 7),(id_hall_106, 7, 8),
		(id_hall_107, 1, 1),(id_hall_107, 1, 2),(id_hall_107, 1, 3),(id_hall_107, 1, 4),(id_hall_107, 1, 5),(id_hall_107, 1, 6),(id_hall_107, 1, 7),(id_hall_107, 1, 8),
		(id_hall_107, 2, 1),(id_hall_107, 2, 2),(id_hall_107, 2, 3),(id_hall_107, 2, 4),(id_hall_107, 2, 5),(id_hall_107, 2, 6),(id_hall_107, 2, 7),(id_hall_107, 2, 8),
		(id_hall_107, 3, 1),(id_hall_107, 3, 2),(id_hall_107, 3, 3),(id_hall_107, 3, 4),(id_hall_107, 3, 5),(id_hall_107, 3, 6),(id_hall_107, 3, 7),(id_hall_107, 3, 8),
		(id_hall_107, 4, 1),(id_hall_107, 4, 2),(id_hall_107, 4, 3),(id_hall_107, 4, 4),(id_hall_107, 4, 5),(id_hall_107, 4, 6),(id_hall_107, 4, 7),(id_hall_107, 4, 8),
		(id_hall_107, 5, 1),(id_hall_107, 5, 2),(id_hall_107, 5, 3),(id_hall_107, 5, 4),(id_hall_107, 5, 5),(id_hall_107, 5, 6),(id_hall_107, 5, 7),(id_hall_107, 5, 8),
		(id_hall_107, 6, 1),(id_hall_107, 6, 2),(id_hall_107, 6, 3),(id_hall_107, 6, 4),(id_hall_107, 6, 5),(id_hall_107, 6, 6),(id_hall_107, 6, 7),(id_hall_107, 6, 8),
		(id_hall_107, 7, 1),(id_hall_107, 7, 2),(id_hall_107, 7, 3),(id_hall_107, 7, 4),(id_hall_107, 7, 5),(id_hall_107, 7, 6),(id_hall_107, 7, 7),(id_hall_107, 7, 8),
		(id_hall_108, 1, 1),(id_hall_108, 1, 2),(id_hall_108, 1, 3),(id_hall_108, 1, 4),(id_hall_108, 1, 5),(id_hall_108, 1, 6),(id_hall_108, 1, 7),(id_hall_108, 1, 8),
		(id_hall_108, 2, 1),(id_hall_108, 2, 2),(id_hall_108, 2, 3),(id_hall_108, 2, 4),(id_hall_108, 2, 5),(id_hall_108, 2, 6),(id_hall_108, 2, 7),(id_hall_108, 2, 8),
		(id_hall_108, 3, 1),(id_hall_108, 3, 2),(id_hall_108, 3, 3),(id_hall_108, 3, 4),(id_hall_108, 3, 5),(id_hall_108, 3, 6),(id_hall_108, 3, 7),(id_hall_108, 3, 8),
		(id_hall_108, 4, 1),(id_hall_108, 4, 2),(id_hall_108, 4, 3),(id_hall_108, 4, 4),(id_hall_108, 4, 5),(id_hall_108, 4, 6),(id_hall_108, 4, 7),(id_hall_108, 4, 8),
		(id_hall_108, 5, 1),(id_hall_108, 5, 2),(id_hall_108, 5, 3),(id_hall_108, 5, 4),(id_hall_108, 5, 5),(id_hall_108, 5, 6),(id_hall_108, 5, 7),(id_hall_108, 5, 8),
		(id_hall_108, 6, 1),(id_hall_108, 6, 2),(id_hall_108, 6, 3),(id_hall_108, 6, 4),(id_hall_108, 6, 5),(id_hall_108, 6, 6),(id_hall_108, 6, 7),(id_hall_108, 6, 8),
		(id_hall_108, 7, 1),(id_hall_108, 7, 2),(id_hall_108, 7, 3),(id_hall_108, 7, 4),(id_hall_108, 7, 5),(id_hall_108, 7, 6),(id_hall_108, 7, 7),(id_hall_108, 7, 8),
		(id_hall_109, 1, 1),(id_hall_109, 1, 2),(id_hall_109, 1, 3),(id_hall_109, 1, 4),(id_hall_109, 1, 5),(id_hall_109, 1, 6),(id_hall_109, 1, 7),(id_hall_109, 1, 8),
		(id_hall_109, 2, 1),(id_hall_109, 2, 2),(id_hall_109, 2, 3),(id_hall_109, 2, 4),(id_hall_109, 2, 5),(id_hall_109, 2, 6),(id_hall_109, 2, 7),(id_hall_109, 2, 8),
		(id_hall_109, 3, 1),(id_hall_109, 3, 2),(id_hall_109, 3, 3),(id_hall_109, 3, 4),(id_hall_109, 3, 5),(id_hall_109, 3, 6),(id_hall_109, 3, 7),(id_hall_109, 3, 8),
		(id_hall_109, 4, 1),(id_hall_109, 4, 2),(id_hall_109, 4, 3),(id_hall_109, 4, 4),(id_hall_109, 4, 5),(id_hall_109, 4, 6),(id_hall_109, 4, 7),(id_hall_109, 4, 8),
		(id_hall_109, 5, 1),(id_hall_109, 5, 2),(id_hall_109, 5, 3),(id_hall_109, 5, 4),(id_hall_109, 5, 5),(id_hall_109, 5, 6),(id_hall_109, 5, 7),(id_hall_109, 5, 8),
		(id_hall_109, 6, 1),(id_hall_109, 6, 2),(id_hall_109, 6, 3),(id_hall_109, 6, 4),(id_hall_109, 6, 5),(id_hall_109, 6, 6),(id_hall_109, 6, 7),(id_hall_109, 6, 8),
		(id_hall_109, 7, 1),(id_hall_109, 7, 2),(id_hall_109, 7, 3),(id_hall_109, 7, 4),(id_hall_109, 7, 5),(id_hall_109, 7, 6),(id_hall_109, 7, 7),(id_hall_109, 7, 8),
		(id_hall_110, 1, 1),(id_hall_110, 1, 2),(id_hall_110, 1, 3),(id_hall_110, 1, 4),(id_hall_110, 1, 5),(id_hall_110, 1, 6),(id_hall_110, 1, 7),(id_hall_110, 1, 8),
		(id_hall_110, 2, 1),(id_hall_110, 2, 2),(id_hall_110, 2, 3),(id_hall_110, 2, 4),(id_hall_110, 2, 5),(id_hall_110, 2, 6),(id_hall_110, 2, 7),(id_hall_110, 2, 8),
		(id_hall_110, 3, 1),(id_hall_110, 3, 2),(id_hall_110, 3, 3),(id_hall_110, 3, 4),(id_hall_110, 3, 5),(id_hall_110, 3, 6),(id_hall_110, 3, 7),(id_hall_110, 3, 8),
		(id_hall_110, 4, 1),(id_hall_110, 4, 2),(id_hall_110, 4, 3),(id_hall_110, 4, 4),(id_hall_110, 4, 5),(id_hall_110, 4, 6),(id_hall_110, 4, 7),(id_hall_110, 4, 8),
		(id_hall_110, 5, 1),(id_hall_110, 5, 2),(id_hall_110, 5, 3),(id_hall_110, 5, 4),(id_hall_110, 5, 5),(id_hall_110, 5, 6),(id_hall_110, 5, 7),(id_hall_110, 5, 8),
		(id_hall_110, 6, 1),(id_hall_110, 6, 2),(id_hall_110, 6, 3),(id_hall_110, 6, 4),(id_hall_110, 6, 5),(id_hall_110, 6, 6),(id_hall_110, 6, 7),(id_hall_110, 6, 8),
		(id_hall_110, 7, 1),(id_hall_110, 7, 2),(id_hall_110, 7, 3),(id_hall_110, 7, 4),(id_hall_110, 7, 5),(id_hall_110, 7, 6),(id_hall_110, 7, 7),(id_hall_110, 7, 8),
		(id_hall_111, 1, 1),(id_hall_111, 1, 2),(id_hall_111, 1, 3),(id_hall_111, 1, 4),(id_hall_111, 1, 5),(id_hall_111, 1, 6),(id_hall_111, 1, 7),(id_hall_111, 1, 8),
		(id_hall_111, 2, 1),(id_hall_111, 2, 2),(id_hall_111, 2, 3),(id_hall_111, 2, 4),(id_hall_111, 2, 5),(id_hall_111, 2, 6),(id_hall_111, 2, 7),(id_hall_111, 2, 8),
		(id_hall_111, 3, 1),(id_hall_111, 3, 2),(id_hall_111, 3, 3),(id_hall_111, 3, 4),(id_hall_111, 3, 5),(id_hall_111, 3, 6),(id_hall_111, 3, 7),(id_hall_111, 3, 8),
		(id_hall_111, 4, 1),(id_hall_111, 4, 2),(id_hall_111, 4, 3),(id_hall_111, 4, 4),(id_hall_111, 4, 5),(id_hall_111, 4, 6),(id_hall_111, 4, 7),(id_hall_111, 4, 8),
		(id_hall_111, 5, 1),(id_hall_111, 5, 2),(id_hall_111, 5, 3),(id_hall_111, 5, 4),(id_hall_111, 5, 5),(id_hall_111, 5, 6),(id_hall_111, 5, 7),(id_hall_111, 5, 8),
		(id_hall_111, 6, 1),(id_hall_111, 6, 2),(id_hall_111, 6, 3),(id_hall_111, 6, 4),(id_hall_111, 6, 5),(id_hall_111, 6, 6),(id_hall_111, 6, 7),(id_hall_111, 6, 8),
		(id_hall_111, 7, 1),(id_hall_111, 7, 2),(id_hall_111, 7, 3),(id_hall_111, 7, 4),(id_hall_111, 7, 5),(id_hall_111, 7, 6),(id_hall_111, 7, 7),(id_hall_111, 7, 8),
		(id_hall_112, 1, 1),(id_hall_112, 1, 2),(id_hall_112, 1, 3),(id_hall_112, 1, 4),(id_hall_112, 1, 5),(id_hall_112, 1, 6),(id_hall_112, 1, 7),(id_hall_112, 1, 8),
		(id_hall_112, 2, 1),(id_hall_112, 2, 2),(id_hall_112, 2, 3),(id_hall_112, 2, 4),(id_hall_112, 2, 5),(id_hall_112, 2, 6),(id_hall_112, 2, 7),(id_hall_112, 2, 8),
		(id_hall_112, 3, 1),(id_hall_112, 3, 2),(id_hall_112, 3, 3),(id_hall_112, 3, 4),(id_hall_112, 3, 5),(id_hall_112, 3, 6),(id_hall_112, 3, 7),(id_hall_112, 3, 8),
		(id_hall_112, 4, 1),(id_hall_112, 4, 2),(id_hall_112, 4, 3),(id_hall_112, 4, 4),(id_hall_112, 4, 5),(id_hall_112, 4, 6),(id_hall_112, 4, 7),(id_hall_112, 4, 8),
		(id_hall_112, 5, 1),(id_hall_112, 5, 2),(id_hall_112, 5, 3),(id_hall_112, 5, 4),(id_hall_112, 5, 5),(id_hall_112, 5, 6),(id_hall_112, 5, 7),(id_hall_112, 5, 8),
		(id_hall_112, 6, 1),(id_hall_112, 6, 2),(id_hall_112, 6, 3),(id_hall_112, 6, 4),(id_hall_112, 6, 5),(id_hall_112, 6, 6),(id_hall_112, 6, 7),(id_hall_112, 6, 8),
		(id_hall_112, 7, 1),(id_hall_112, 7, 2),(id_hall_112, 7, 3),(id_hall_112, 7, 4),(id_hall_112, 7, 5),(id_hall_112, 7, 6),(id_hall_112, 7, 7),(id_hall_112, 7, 8),
		(id_hall_113, 1, 1),(id_hall_113, 1, 2),(id_hall_113, 1, 3),(id_hall_113, 1, 4),(id_hall_113, 1, 5),(id_hall_113, 1, 6),(id_hall_113, 1, 7),(id_hall_113, 1, 8),
		(id_hall_113, 2, 1),(id_hall_113, 2, 2),(id_hall_113, 2, 3),(id_hall_113, 2, 4),(id_hall_113, 2, 5),(id_hall_113, 2, 6),(id_hall_113, 2, 7),(id_hall_113, 2, 8),
		(id_hall_113, 3, 1),(id_hall_113, 3, 2),(id_hall_113, 3, 3),(id_hall_113, 3, 4),(id_hall_113, 3, 5),(id_hall_113, 3, 6),(id_hall_113, 3, 7),(id_hall_113, 3, 8),
		(id_hall_113, 4, 1),(id_hall_113, 4, 2),(id_hall_113, 4, 3),(id_hall_113, 4, 4),(id_hall_113, 4, 5),(id_hall_113, 4, 6),(id_hall_113, 4, 7),(id_hall_113, 4, 8),
		(id_hall_113, 5, 1),(id_hall_113, 5, 2),(id_hall_113, 5, 3),(id_hall_113, 5, 4),(id_hall_113, 5, 5),(id_hall_113, 5, 6),(id_hall_113, 5, 7),(id_hall_113, 5, 8),
		(id_hall_113, 6, 1),(id_hall_113, 6, 2),(id_hall_113, 6, 3),(id_hall_113, 6, 4),(id_hall_113, 6, 5),(id_hall_113, 6, 6),(id_hall_113, 6, 7),(id_hall_113, 6, 8),
		(id_hall_113, 7, 1),(id_hall_113, 7, 2),(id_hall_113, 7, 3),(id_hall_113, 7, 4),(id_hall_113, 7, 5),(id_hall_113, 7, 6),(id_hall_113, 7, 7),(id_hall_113, 7, 8),
		(id_hall_114, 1, 1),(id_hall_114, 1, 2),(id_hall_114, 1, 3),(id_hall_114, 1, 4),(id_hall_114, 1, 5),(id_hall_114, 1, 6),(id_hall_114, 1, 7),(id_hall_114, 1, 8),
		(id_hall_114, 2, 1),(id_hall_114, 2, 2),(id_hall_114, 2, 3),(id_hall_114, 2, 4),(id_hall_114, 2, 5),(id_hall_114, 2, 6),(id_hall_114, 2, 7),(id_hall_114, 2, 8),
		(id_hall_114, 3, 1),(id_hall_114, 3, 2),(id_hall_114, 3, 3),(id_hall_114, 3, 4),(id_hall_114, 3, 5),(id_hall_114, 3, 6),(id_hall_114, 3, 7),(id_hall_114, 3, 8),
		(id_hall_114, 4, 1),(id_hall_114, 4, 2),(id_hall_114, 4, 3),(id_hall_114, 4, 4),(id_hall_114, 4, 5),(id_hall_114, 4, 6),(id_hall_114, 4, 7),(id_hall_114, 4, 8),
		(id_hall_114, 5, 1),(id_hall_114, 5, 2),(id_hall_114, 5, 3),(id_hall_114, 5, 4),(id_hall_114, 5, 5),(id_hall_114, 5, 6),(id_hall_114, 5, 7),(id_hall_114, 5, 8),
		(id_hall_114, 6, 1),(id_hall_114, 6, 2),(id_hall_114, 6, 3),(id_hall_114, 6, 4),(id_hall_114, 6, 5),(id_hall_114, 6, 6),(id_hall_114, 6, 7),(id_hall_114, 6, 8),
		(id_hall_114, 7, 1),(id_hall_114, 7, 2),(id_hall_114, 7, 3),(id_hall_114, 7, 4),(id_hall_114, 7, 5),(id_hall_114, 7, 6),(id_hall_114, 7, 7),(id_hall_114, 7, 8),
		(id_hall_115, 1, 1),(id_hall_115, 1, 2),(id_hall_115, 1, 3),(id_hall_115, 1, 4),(id_hall_115, 1, 5),(id_hall_115, 1, 6),(id_hall_115, 1, 7),(id_hall_115, 1, 8),
		(id_hall_115, 2, 1),(id_hall_115, 2, 2),(id_hall_115, 2, 3),(id_hall_115, 2, 4),(id_hall_115, 2, 5),(id_hall_115, 2, 6),(id_hall_115, 2, 7),(id_hall_115, 2, 8),
		(id_hall_115, 3, 1),(id_hall_115, 3, 2),(id_hall_115, 3, 3),(id_hall_115, 3, 4),(id_hall_115, 3, 5),(id_hall_115, 3, 6),(id_hall_115, 3, 7),(id_hall_115, 3, 8),
		(id_hall_115, 4, 1),(id_hall_115, 4, 2),(id_hall_115, 4, 3),(id_hall_115, 4, 4),(id_hall_115, 4, 5),(id_hall_115, 4, 6),(id_hall_115, 4, 7),(id_hall_115, 4, 8),
		(id_hall_115, 5, 1),(id_hall_115, 5, 2),(id_hall_115, 5, 3),(id_hall_115, 5, 4),(id_hall_115, 5, 5),(id_hall_115, 5, 6),(id_hall_115, 5, 7),(id_hall_115, 5, 8),
		(id_hall_115, 6, 1),(id_hall_115, 6, 2),(id_hall_115, 6, 3),(id_hall_115, 6, 4),(id_hall_115, 6, 5),(id_hall_115, 6, 6),(id_hall_115, 6, 7),(id_hall_115, 6, 8),
		(id_hall_115, 7, 1),(id_hall_115, 7, 2),(id_hall_115, 7, 3),(id_hall_115, 7, 4),(id_hall_115, 7, 5),(id_hall_115, 7, 6),(id_hall_115, 7, 7),(id_hall_115, 7, 8),
		(id_hall_116, 1, 1),(id_hall_116, 1, 2),(id_hall_116, 1, 3),(id_hall_116, 1, 4),(id_hall_116, 1, 5),(id_hall_116, 1, 6),(id_hall_116, 1, 7),(id_hall_116, 1, 8),
		(id_hall_116, 2, 1),(id_hall_116, 2, 2),(id_hall_116, 2, 3),(id_hall_116, 2, 4),(id_hall_116, 2, 5),(id_hall_116, 2, 6),(id_hall_116, 2, 7),(id_hall_116, 2, 8),
		(id_hall_116, 3, 1),(id_hall_116, 3, 2),(id_hall_116, 3, 3),(id_hall_116, 3, 4),(id_hall_116, 3, 5),(id_hall_116, 3, 6),(id_hall_116, 3, 7),(id_hall_116, 3, 8),
		(id_hall_116, 4, 1),(id_hall_116, 4, 2),(id_hall_116, 4, 3),(id_hall_116, 4, 4),(id_hall_116, 4, 5),(id_hall_116, 4, 6),(id_hall_116, 4, 7),(id_hall_116, 4, 8),
		(id_hall_116, 5, 1),(id_hall_116, 5, 2),(id_hall_116, 5, 3),(id_hall_116, 5, 4),(id_hall_116, 5, 5),(id_hall_116, 5, 6),(id_hall_116, 5, 7),(id_hall_116, 5, 8),
		(id_hall_116, 6, 1),(id_hall_116, 6, 2),(id_hall_116, 6, 3),(id_hall_116, 6, 4),(id_hall_116, 6, 5),(id_hall_116, 6, 6),(id_hall_116, 6, 7),(id_hall_116, 6, 8),
		(id_hall_116, 7, 1),(id_hall_116, 7, 2),(id_hall_116, 7, 3),(id_hall_116, 7, 4),(id_hall_116, 7, 5),(id_hall_116, 7, 6),(id_hall_116, 7, 7),(id_hall_116, 7, 8),
		(id_hall_117, 1, 1),(id_hall_117, 1, 2),(id_hall_117, 1, 3),(id_hall_117, 1, 4),(id_hall_117, 1, 5),(id_hall_117, 1, 6),(id_hall_117, 1, 7),(id_hall_117, 1, 8),
		(id_hall_117, 2, 1),(id_hall_117, 2, 2),(id_hall_117, 2, 3),(id_hall_117, 2, 4),(id_hall_117, 2, 5),(id_hall_117, 2, 6),(id_hall_117, 2, 7),(id_hall_117, 2, 8),
		(id_hall_117, 3, 1),(id_hall_117, 3, 2),(id_hall_117, 3, 3),(id_hall_117, 3, 4),(id_hall_117, 3, 5),(id_hall_117, 3, 6),(id_hall_117, 3, 7),(id_hall_117, 3, 8),
		(id_hall_117, 4, 1),(id_hall_117, 4, 2),(id_hall_117, 4, 3),(id_hall_117, 4, 4),(id_hall_117, 4, 5),(id_hall_117, 4, 6),(id_hall_117, 4, 7),(id_hall_117, 4, 8),
		(id_hall_117, 5, 1),(id_hall_117, 5, 2),(id_hall_117, 5, 3),(id_hall_117, 5, 4),(id_hall_117, 5, 5),(id_hall_117, 5, 6),(id_hall_117, 5, 7),(id_hall_117, 5, 8),
		(id_hall_117, 6, 1),(id_hall_117, 6, 2),(id_hall_117, 6, 3),(id_hall_117, 6, 4),(id_hall_117, 6, 5),(id_hall_117, 6, 6),(id_hall_117, 6, 7),(id_hall_117, 6, 8),
		(id_hall_117, 7, 1),(id_hall_117, 7, 2),(id_hall_117, 7, 3),(id_hall_117, 7, 4),(id_hall_117, 7, 5),(id_hall_117, 7, 6),(id_hall_117, 7, 7),(id_hall_117, 7, 8),
		(id_hall_118, 1, 1),(id_hall_118, 1, 2),(id_hall_118, 1, 3),(id_hall_118, 1, 4),(id_hall_118, 1, 5),(id_hall_118, 1, 6),(id_hall_118, 1, 7),(id_hall_118, 1, 8),
		(id_hall_118, 2, 1),(id_hall_118, 2, 2),(id_hall_118, 2, 3),(id_hall_118, 2, 4),(id_hall_118, 2, 5),(id_hall_118, 2, 6),(id_hall_118, 2, 7),(id_hall_118, 2, 8),
		(id_hall_118, 3, 1),(id_hall_118, 3, 2),(id_hall_118, 3, 3),(id_hall_118, 3, 4),(id_hall_118, 3, 5),(id_hall_118, 3, 6),(id_hall_118, 3, 7),(id_hall_118, 3, 8),
		(id_hall_118, 4, 1),(id_hall_118, 4, 2),(id_hall_118, 4, 3),(id_hall_118, 4, 4),(id_hall_118, 4, 5),(id_hall_118, 4, 6),(id_hall_118, 4, 7),(id_hall_118, 4, 8),
		(id_hall_118, 5, 1),(id_hall_118, 5, 2),(id_hall_118, 5, 3),(id_hall_118, 5, 4),(id_hall_118, 5, 5),(id_hall_118, 5, 6),(id_hall_118, 5, 7),(id_hall_118, 5, 8),
		(id_hall_118, 6, 1),(id_hall_118, 6, 2),(id_hall_118, 6, 3),(id_hall_118, 6, 4),(id_hall_118, 6, 5),(id_hall_118, 6, 6),(id_hall_118, 6, 7),(id_hall_118, 6, 8),
		(id_hall_118, 7, 1),(id_hall_118, 7, 2),(id_hall_118, 7, 3),(id_hall_118, 7, 4),(id_hall_118, 7, 5),(id_hall_118, 7, 6),(id_hall_118, 7, 7),(id_hall_118, 7, 8),
		(id_hall_119, 1, 1),(id_hall_119, 1, 2),(id_hall_119, 1, 3),(id_hall_119, 1, 4),(id_hall_119, 1, 5),(id_hall_119, 1, 6),(id_hall_119, 1, 7),(id_hall_119, 1, 8),
		(id_hall_119, 2, 1),(id_hall_119, 2, 2),(id_hall_119, 2, 3),(id_hall_119, 2, 4),(id_hall_119, 2, 5),(id_hall_119, 2, 6),(id_hall_119, 2, 7),(id_hall_119, 2, 8),
		(id_hall_119, 3, 1),(id_hall_119, 3, 2),(id_hall_119, 3, 3),(id_hall_119, 3, 4),(id_hall_119, 3, 5),(id_hall_119, 3, 6),(id_hall_119, 3, 7),(id_hall_119, 3, 8),
		(id_hall_119, 4, 1),(id_hall_119, 4, 2),(id_hall_119, 4, 3),(id_hall_119, 4, 4),(id_hall_119, 4, 5),(id_hall_119, 4, 6),(id_hall_119, 4, 7),(id_hall_119, 4, 8),
		(id_hall_119, 5, 1),(id_hall_119, 5, 2),(id_hall_119, 5, 3),(id_hall_119, 5, 4),(id_hall_119, 5, 5),(id_hall_119, 5, 6),(id_hall_119, 5, 7),(id_hall_119, 5, 8),
		(id_hall_119, 6, 1),(id_hall_119, 6, 2),(id_hall_119, 6, 3),(id_hall_119, 6, 4),(id_hall_119, 6, 5),(id_hall_119, 6, 6),(id_hall_119, 6, 7),(id_hall_119, 6, 8),
		(id_hall_119, 7, 1),(id_hall_119, 7, 2),(id_hall_119, 7, 3),(id_hall_119, 7, 4),(id_hall_119, 7, 5),(id_hall_119, 7, 6),(id_hall_119, 7, 7),(id_hall_119, 7, 8),
		(id_hall_120, 1, 1),(id_hall_120, 1, 2),(id_hall_120, 1, 3),(id_hall_120, 1, 4),(id_hall_120, 1, 5),(id_hall_120, 1, 6),(id_hall_120, 1, 7),(id_hall_120, 1, 8),
		(id_hall_120, 2, 1),(id_hall_120, 2, 2),(id_hall_120, 2, 3),(id_hall_120, 2, 4),(id_hall_120, 2, 5),(id_hall_120, 2, 6),(id_hall_120, 2, 7),(id_hall_120, 2, 8),
		(id_hall_120, 3, 1),(id_hall_120, 3, 2),(id_hall_120, 3, 3),(id_hall_120, 3, 4),(id_hall_120, 3, 5),(id_hall_120, 3, 6),(id_hall_120, 3, 7),(id_hall_120, 3, 8),
		(id_hall_120, 4, 1),(id_hall_120, 4, 2),(id_hall_120, 4, 3),(id_hall_120, 4, 4),(id_hall_120, 4, 5),(id_hall_120, 4, 6),(id_hall_120, 4, 7),(id_hall_120, 4, 8),
		(id_hall_120, 5, 1),(id_hall_120, 5, 2),(id_hall_120, 5, 3),(id_hall_120, 5, 4),(id_hall_120, 5, 5),(id_hall_120, 5, 6),(id_hall_120, 5, 7),(id_hall_120, 5, 8),
		(id_hall_120, 6, 1),(id_hall_120, 6, 2),(id_hall_120, 6, 3),(id_hall_120, 6, 4),(id_hall_120, 6, 5),(id_hall_120, 6, 6),(id_hall_120, 6, 7),(id_hall_120, 6, 8),
		(id_hall_120, 7, 1),(id_hall_120, 7, 2),(id_hall_120, 7, 3),(id_hall_120, 7, 4),(id_hall_120, 7, 5),(id_hall_120, 7, 6),(id_hall_120, 7, 7),(id_hall_120, 7, 8),
		(id_hall_121, 1, 1),(id_hall_121, 1, 2),(id_hall_121, 1, 3),(id_hall_121, 1, 4),(id_hall_121, 1, 5),(id_hall_121, 1, 6),(id_hall_121, 1, 7),(id_hall_121, 1, 8),
		(id_hall_121, 2, 1),(id_hall_121, 2, 2),(id_hall_121, 2, 3),(id_hall_121, 2, 4),(id_hall_121, 2, 5),(id_hall_121, 2, 6),(id_hall_121, 2, 7),(id_hall_121, 2, 8),
		(id_hall_121, 3, 1),(id_hall_121, 3, 2),(id_hall_121, 3, 3),(id_hall_121, 3, 4),(id_hall_121, 3, 5),(id_hall_121, 3, 6),(id_hall_121, 3, 7),(id_hall_121, 3, 8),
		(id_hall_121, 4, 1),(id_hall_121, 4, 2),(id_hall_121, 4, 3),(id_hall_121, 4, 4),(id_hall_121, 4, 5),(id_hall_121, 4, 6),(id_hall_121, 4, 7),(id_hall_121, 4, 8),
		(id_hall_121, 5, 1),(id_hall_121, 5, 2),(id_hall_121, 5, 3),(id_hall_121, 5, 4),(id_hall_121, 5, 5),(id_hall_121, 5, 6),(id_hall_121, 5, 7),(id_hall_121, 5, 8),
		(id_hall_121, 6, 1),(id_hall_121, 6, 2),(id_hall_121, 6, 3),(id_hall_121, 6, 4),(id_hall_121, 6, 5),(id_hall_121, 6, 6),(id_hall_121, 6, 7),(id_hall_121, 6, 8),
		(id_hall_121, 7, 1),(id_hall_121, 7, 2),(id_hall_121, 7, 3),(id_hall_121, 7, 4),(id_hall_121, 7, 5),(id_hall_121, 7, 6),(id_hall_121, 7, 7),(id_hall_121, 7, 8),
		(id_hall_122, 1, 1),(id_hall_122, 1, 2),(id_hall_122, 1, 3),(id_hall_122, 1, 4),(id_hall_122, 1, 5),(id_hall_122, 1, 6),(id_hall_122, 1, 7),(id_hall_122, 1, 8),
		(id_hall_122, 2, 1),(id_hall_122, 2, 2),(id_hall_122, 2, 3),(id_hall_122, 2, 4),(id_hall_122, 2, 5),(id_hall_122, 2, 6),(id_hall_122, 2, 7),(id_hall_122, 2, 8),
		(id_hall_122, 3, 1),(id_hall_122, 3, 2),(id_hall_122, 3, 3),(id_hall_122, 3, 4),(id_hall_122, 3, 5),(id_hall_122, 3, 6),(id_hall_122, 3, 7),(id_hall_122, 3, 8),
		(id_hall_122, 4, 1),(id_hall_122, 4, 2),(id_hall_122, 4, 3),(id_hall_122, 4, 4),(id_hall_122, 4, 5),(id_hall_122, 4, 6),(id_hall_122, 4, 7),(id_hall_122, 4, 8),
		(id_hall_122, 5, 1),(id_hall_122, 5, 2),(id_hall_122, 5, 3),(id_hall_122, 5, 4),(id_hall_122, 5, 5),(id_hall_122, 5, 6),(id_hall_122, 5, 7),(id_hall_122, 5, 8),
		(id_hall_122, 6, 1),(id_hall_122, 6, 2),(id_hall_122, 6, 3),(id_hall_122, 6, 4),(id_hall_122, 6, 5),(id_hall_122, 6, 6),(id_hall_122, 6, 7),(id_hall_122, 6, 8),
		(id_hall_122, 7, 1),(id_hall_122, 7, 2),(id_hall_122, 7, 3),(id_hall_122, 7, 4),(id_hall_122, 7, 5),(id_hall_122, 7, 6),(id_hall_122, 7, 7),(id_hall_122, 7, 8),
		(id_hall_123, 1, 1),(id_hall_123, 1, 2),(id_hall_123, 1, 3),(id_hall_123, 1, 4),(id_hall_123, 1, 5),(id_hall_123, 1, 6),(id_hall_123, 1, 7),(id_hall_123, 1, 8),
		(id_hall_123, 2, 1),(id_hall_123, 2, 2),(id_hall_123, 2, 3),(id_hall_123, 2, 4),(id_hall_123, 2, 5),(id_hall_123, 2, 6),(id_hall_123, 2, 7),(id_hall_123, 2, 8),
		(id_hall_123, 3, 1),(id_hall_123, 3, 2),(id_hall_123, 3, 3),(id_hall_123, 3, 4),(id_hall_123, 3, 5),(id_hall_123, 3, 6),(id_hall_123, 3, 7),(id_hall_123, 3, 8),
		(id_hall_123, 4, 1),(id_hall_123, 4, 2),(id_hall_123, 4, 3),(id_hall_123, 4, 4),(id_hall_123, 4, 5),(id_hall_123, 4, 6),(id_hall_123, 4, 7),(id_hall_123, 4, 8),
		(id_hall_123, 5, 1),(id_hall_123, 5, 2),(id_hall_123, 5, 3),(id_hall_123, 5, 4),(id_hall_123, 5, 5),(id_hall_123, 5, 6),(id_hall_123, 5, 7),(id_hall_123, 5, 8),
		(id_hall_123, 6, 1),(id_hall_123, 6, 2),(id_hall_123, 6, 3),(id_hall_123, 6, 4),(id_hall_123, 6, 5),(id_hall_123, 6, 6),(id_hall_123, 6, 7),(id_hall_123, 6, 8),
		(id_hall_123, 7, 1),(id_hall_123, 7, 2),(id_hall_123, 7, 3),(id_hall_123, 7, 4),(id_hall_123, 7, 5),(id_hall_123, 7, 6),(id_hall_123, 7, 7),(id_hall_123, 7, 8),
		(id_hall_124, 1, 1),(id_hall_124, 1, 2),(id_hall_124, 1, 3),(id_hall_124, 1, 4),(id_hall_124, 1, 5),(id_hall_124, 1, 6),(id_hall_124, 1, 7),(id_hall_124, 1, 8),
		(id_hall_124, 2, 1),(id_hall_124, 2, 2),(id_hall_124, 2, 3),(id_hall_124, 2, 4),(id_hall_124, 2, 5),(id_hall_124, 2, 6),(id_hall_124, 2, 7),(id_hall_124, 2, 8),
		(id_hall_124, 3, 1),(id_hall_124, 3, 2),(id_hall_124, 3, 3),(id_hall_124, 3, 4),(id_hall_124, 3, 5),(id_hall_124, 3, 6),(id_hall_124, 3, 7),(id_hall_124, 3, 8),
		(id_hall_124, 4, 1),(id_hall_124, 4, 2),(id_hall_124, 4, 3),(id_hall_124, 4, 4),(id_hall_124, 4, 5),(id_hall_124, 4, 6),(id_hall_124, 4, 7),(id_hall_124, 4, 8),
		(id_hall_124, 5, 1),(id_hall_124, 5, 2),(id_hall_124, 5, 3),(id_hall_124, 5, 4),(id_hall_124, 5, 5),(id_hall_124, 5, 6),(id_hall_124, 5, 7),(id_hall_124, 5, 8),
		(id_hall_124, 6, 1),(id_hall_124, 6, 2),(id_hall_124, 6, 3),(id_hall_124, 6, 4),(id_hall_124, 6, 5),(id_hall_124, 6, 6),(id_hall_124, 6, 7),(id_hall_124, 6, 8),
		(id_hall_124, 7, 1),(id_hall_124, 7, 2),(id_hall_124, 7, 3),(id_hall_124, 7, 4),(id_hall_124, 7, 5),(id_hall_124, 7, 6),(id_hall_124, 7, 7),(id_hall_124, 7, 8),
		(id_hall_125, 1, 1),(id_hall_125, 1, 2),(id_hall_125, 1, 3),(id_hall_125, 1, 4),(id_hall_125, 1, 5),(id_hall_125, 1, 6),(id_hall_125, 1, 7),(id_hall_125, 1, 8),
		(id_hall_125, 2, 1),(id_hall_125, 2, 2),(id_hall_125, 2, 3),(id_hall_125, 2, 4),(id_hall_125, 2, 5),(id_hall_125, 2, 6),(id_hall_125, 2, 7),(id_hall_125, 2, 8),
		(id_hall_125, 3, 1),(id_hall_125, 3, 2),(id_hall_125, 3, 3),(id_hall_125, 3, 4),(id_hall_125, 3, 5),(id_hall_125, 3, 6),(id_hall_125, 3, 7),(id_hall_125, 3, 8),
		(id_hall_125, 4, 1),(id_hall_125, 4, 2),(id_hall_125, 4, 3),(id_hall_125, 4, 4),(id_hall_125, 4, 5),(id_hall_125, 4, 6),(id_hall_125, 4, 7),(id_hall_125, 4, 8),
		(id_hall_125, 5, 1),(id_hall_125, 5, 2),(id_hall_125, 5, 3),(id_hall_125, 5, 4),(id_hall_125, 5, 5),(id_hall_125, 5, 6),(id_hall_125, 5, 7),(id_hall_125, 5, 8),
		(id_hall_125, 6, 1),(id_hall_125, 6, 2),(id_hall_125, 6, 3),(id_hall_125, 6, 4),(id_hall_125, 6, 5),(id_hall_125, 6, 6),(id_hall_125, 6, 7),(id_hall_125, 6, 8),
		(id_hall_125, 7, 1),(id_hall_125, 7, 2),(id_hall_125, 7, 3),(id_hall_125, 7, 4),(id_hall_125, 7, 5),(id_hall_125, 7, 6),(id_hall_125, 7, 7),(id_hall_125, 7, 8),
		(id_hall_126, 1, 1),(id_hall_126, 1, 2),(id_hall_126, 1, 3),(id_hall_126, 1, 4),(id_hall_126, 1, 5),(id_hall_126, 1, 6),(id_hall_126, 1, 7),(id_hall_126, 1, 8),
		(id_hall_126, 2, 1),(id_hall_126, 2, 2),(id_hall_126, 2, 3),(id_hall_126, 2, 4),(id_hall_126, 2, 5),(id_hall_126, 2, 6),(id_hall_126, 2, 7),(id_hall_126, 2, 8),
		(id_hall_126, 3, 1),(id_hall_126, 3, 2),(id_hall_126, 3, 3),(id_hall_126, 3, 4),(id_hall_126, 3, 5),(id_hall_126, 3, 6),(id_hall_126, 3, 7),(id_hall_126, 3, 8),
		(id_hall_126, 4, 1),(id_hall_126, 4, 2),(id_hall_126, 4, 3),(id_hall_126, 4, 4),(id_hall_126, 4, 5),(id_hall_126, 4, 6),(id_hall_126, 4, 7),(id_hall_126, 4, 8),
		(id_hall_126, 5, 1),(id_hall_126, 5, 2),(id_hall_126, 5, 3),(id_hall_126, 5, 4),(id_hall_126, 5, 5),(id_hall_126, 5, 6),(id_hall_126, 5, 7),(id_hall_126, 5, 8),
		(id_hall_126, 6, 1),(id_hall_126, 6, 2),(id_hall_126, 6, 3),(id_hall_126, 6, 4),(id_hall_126, 6, 5),(id_hall_126, 6, 6),(id_hall_126, 6, 7),(id_hall_126, 6, 8),
		(id_hall_126, 7, 1),(id_hall_126, 7, 2),(id_hall_126, 7, 3),(id_hall_126, 7, 4),(id_hall_126, 7, 5),(id_hall_126, 7, 6),(id_hall_126, 7, 7),(id_hall_126, 7, 8),
		(id_hall_127, 1, 1),(id_hall_127, 1, 2),(id_hall_127, 1, 3),(id_hall_127, 1, 4),(id_hall_127, 1, 5),(id_hall_127, 1, 6),(id_hall_127, 1, 7),(id_hall_127, 1, 8),
		(id_hall_127, 2, 1),(id_hall_127, 2, 2),(id_hall_127, 2, 3),(id_hall_127, 2, 4),(id_hall_127, 2, 5),(id_hall_127, 2, 6),(id_hall_127, 2, 7),(id_hall_127, 2, 8),
		(id_hall_127, 3, 1),(id_hall_127, 3, 2),(id_hall_127, 3, 3),(id_hall_127, 3, 4),(id_hall_127, 3, 5),(id_hall_127, 3, 6),(id_hall_127, 3, 7),(id_hall_127, 3, 8),
		(id_hall_127, 4, 1),(id_hall_127, 4, 2),(id_hall_127, 4, 3),(id_hall_127, 4, 4),(id_hall_127, 4, 5),(id_hall_127, 4, 6),(id_hall_127, 4, 7),(id_hall_127, 4, 8),
		(id_hall_127, 5, 1),(id_hall_127, 5, 2),(id_hall_127, 5, 3),(id_hall_127, 5, 4),(id_hall_127, 5, 5),(id_hall_127, 5, 6),(id_hall_127, 5, 7),(id_hall_127, 5, 8),
		(id_hall_127, 6, 1),(id_hall_127, 6, 2),(id_hall_127, 6, 3),(id_hall_127, 6, 4),(id_hall_127, 6, 5),(id_hall_127, 6, 6),(id_hall_127, 6, 7),(id_hall_127, 6, 8),
		(id_hall_127, 7, 1),(id_hall_127, 7, 2),(id_hall_127, 7, 3),(id_hall_127, 7, 4),(id_hall_127, 7, 5),(id_hall_127, 7, 6),(id_hall_127, 7, 7),(id_hall_127, 7, 8),
		(id_hall_128, 1, 1),(id_hall_128, 1, 2),(id_hall_128, 1, 3),(id_hall_128, 1, 4),(id_hall_128, 1, 5),(id_hall_128, 1, 6),(id_hall_128, 1, 7),(id_hall_128, 1, 8),
		(id_hall_128, 2, 1),(id_hall_128, 2, 2),(id_hall_128, 2, 3),(id_hall_128, 2, 4),(id_hall_128, 2, 5),(id_hall_128, 2, 6),(id_hall_128, 2, 7),(id_hall_128, 2, 8),
		(id_hall_128, 3, 1),(id_hall_128, 3, 2),(id_hall_128, 3, 3),(id_hall_128, 3, 4),(id_hall_128, 3, 5),(id_hall_128, 3, 6),(id_hall_128, 3, 7),(id_hall_128, 3, 8),
		(id_hall_128, 4, 1),(id_hall_128, 4, 2),(id_hall_128, 4, 3),(id_hall_128, 4, 4),(id_hall_128, 4, 5),(id_hall_128, 4, 6),(id_hall_128, 4, 7),(id_hall_128, 4, 8),
		(id_hall_128, 5, 1),(id_hall_128, 5, 2),(id_hall_128, 5, 3),(id_hall_128, 5, 4),(id_hall_128, 5, 5),(id_hall_128, 5, 6),(id_hall_128, 5, 7),(id_hall_128, 5, 8),
		(id_hall_128, 6, 1),(id_hall_128, 6, 2),(id_hall_128, 6, 3),(id_hall_128, 6, 4),(id_hall_128, 6, 5),(id_hall_128, 6, 6),(id_hall_128, 6, 7),(id_hall_128, 6, 8),
		(id_hall_128, 7, 1),(id_hall_128, 7, 2),(id_hall_128, 7, 3),(id_hall_128, 7, 4),(id_hall_128, 7, 5),(id_hall_128, 7, 6),(id_hall_128, 7, 7),(id_hall_128, 7, 8),
		(id_hall_129, 1, 1),(id_hall_129, 1, 2),(id_hall_129, 1, 3),(id_hall_129, 1, 4),(id_hall_129, 1, 5),(id_hall_129, 1, 6),(id_hall_129, 1, 7),(id_hall_129, 1, 8),
		(id_hall_129, 2, 1),(id_hall_129, 2, 2),(id_hall_129, 2, 3),(id_hall_129, 2, 4),(id_hall_129, 2, 5),(id_hall_129, 2, 6),(id_hall_129, 2, 7),(id_hall_129, 2, 8),
		(id_hall_129, 3, 1),(id_hall_129, 3, 2),(id_hall_129, 3, 3),(id_hall_129, 3, 4),(id_hall_129, 3, 5),(id_hall_129, 3, 6),(id_hall_129, 3, 7),(id_hall_129, 3, 8),
		(id_hall_129, 4, 1),(id_hall_129, 4, 2),(id_hall_129, 4, 3),(id_hall_129, 4, 4),(id_hall_129, 4, 5),(id_hall_129, 4, 6),(id_hall_129, 4, 7),(id_hall_129, 4, 8),
		(id_hall_129, 5, 1),(id_hall_129, 5, 2),(id_hall_129, 5, 3),(id_hall_129, 5, 4),(id_hall_129, 5, 5),(id_hall_129, 5, 6),(id_hall_129, 5, 7),(id_hall_129, 5, 8),
		(id_hall_129, 6, 1),(id_hall_129, 6, 2),(id_hall_129, 6, 3),(id_hall_129, 6, 4),(id_hall_129, 6, 5),(id_hall_129, 6, 6),(id_hall_129, 6, 7),(id_hall_129, 6, 8),
		(id_hall_129, 7, 1),(id_hall_129, 7, 2),(id_hall_129, 7, 3),(id_hall_129, 7, 4),(id_hall_129, 7, 5),(id_hall_129, 7, 6),(id_hall_129, 7, 7),(id_hall_129, 7, 8),
		(id_hall_130, 1, 1),(id_hall_130, 1, 2),(id_hall_130, 1, 3),(id_hall_130, 1, 4),(id_hall_130, 1, 5),(id_hall_130, 1, 6),(id_hall_130, 1, 7),(id_hall_130, 1, 8),
		(id_hall_130, 2, 1),(id_hall_130, 2, 2),(id_hall_130, 2, 3),(id_hall_130, 2, 4),(id_hall_130, 2, 5),(id_hall_130, 2, 6),(id_hall_130, 2, 7),(id_hall_130, 2, 8),
		(id_hall_130, 3, 1),(id_hall_130, 3, 2),(id_hall_130, 3, 3),(id_hall_130, 3, 4),(id_hall_130, 3, 5),(id_hall_130, 3, 6),(id_hall_130, 3, 7),(id_hall_130, 3, 8),
		(id_hall_130, 4, 1),(id_hall_130, 4, 2),(id_hall_130, 4, 3),(id_hall_130, 4, 4),(id_hall_130, 4, 5),(id_hall_130, 4, 6),(id_hall_130, 4, 7),(id_hall_130, 4, 8),
		(id_hall_130, 5, 1),(id_hall_130, 5, 2),(id_hall_130, 5, 3),(id_hall_130, 5, 4),(id_hall_130, 5, 5),(id_hall_130, 5, 6),(id_hall_130, 5, 7),(id_hall_130, 5, 8),
		(id_hall_130, 6, 1),(id_hall_130, 6, 2),(id_hall_130, 6, 3),(id_hall_130, 6, 4),(id_hall_130, 6, 5),(id_hall_130, 6, 6),(id_hall_130, 6, 7),(id_hall_130, 6, 8),
		(id_hall_130, 7, 1),(id_hall_130, 7, 2),(id_hall_130, 7, 3),(id_hall_130, 7, 4),(id_hall_130, 7, 5),(id_hall_130, 7, 6),(id_hall_130, 7, 7),(id_hall_130, 7, 8),
		(id_hall_131, 1, 1),(id_hall_131, 1, 2),(id_hall_131, 1, 3),(id_hall_131, 1, 4),(id_hall_131, 1, 5),(id_hall_131, 1, 6),(id_hall_131, 1, 7),(id_hall_131, 1, 8),
		(id_hall_131, 2, 1),(id_hall_131, 2, 2),(id_hall_131, 2, 3),(id_hall_131, 2, 4),(id_hall_131, 2, 5),(id_hall_131, 2, 6),(id_hall_131, 2, 7),(id_hall_131, 2, 8),
		(id_hall_131, 3, 1),(id_hall_131, 3, 2),(id_hall_131, 3, 3),(id_hall_131, 3, 4),(id_hall_131, 3, 5),(id_hall_131, 3, 6),(id_hall_131, 3, 7),(id_hall_131, 3, 8),
		(id_hall_131, 4, 1),(id_hall_131, 4, 2),(id_hall_131, 4, 3),(id_hall_131, 4, 4),(id_hall_131, 4, 5),(id_hall_131, 4, 6),(id_hall_131, 4, 7),(id_hall_131, 4, 8),
		(id_hall_131, 5, 1),(id_hall_131, 5, 2),(id_hall_131, 5, 3),(id_hall_131, 5, 4),(id_hall_131, 5, 5),(id_hall_131, 5, 6),(id_hall_131, 5, 7),(id_hall_131, 5, 8),
		(id_hall_131, 6, 1),(id_hall_131, 6, 2),(id_hall_131, 6, 3),(id_hall_131, 6, 4),(id_hall_131, 6, 5),(id_hall_131, 6, 6),(id_hall_131, 6, 7),(id_hall_131, 6, 8),
		(id_hall_131, 7, 1),(id_hall_131, 7, 2),(id_hall_131, 7, 3),(id_hall_131, 7, 4),(id_hall_131, 7, 5),(id_hall_131, 7, 6),(id_hall_131, 7, 7),(id_hall_131, 7, 8),
		(id_hall_132, 1, 1),(id_hall_132, 1, 2),(id_hall_132, 1, 3),(id_hall_132, 1, 4),(id_hall_132, 1, 5),(id_hall_132, 1, 6),(id_hall_132, 1, 7),(id_hall_132, 1, 8),
		(id_hall_132, 2, 1),(id_hall_132, 2, 2),(id_hall_132, 2, 3),(id_hall_132, 2, 4),(id_hall_132, 2, 5),(id_hall_132, 2, 6),(id_hall_132, 2, 7),(id_hall_132, 2, 8),
		(id_hall_132, 3, 1),(id_hall_132, 3, 2),(id_hall_132, 3, 3),(id_hall_132, 3, 4),(id_hall_132, 3, 5),(id_hall_132, 3, 6),(id_hall_132, 3, 7),(id_hall_132, 3, 8),
		(id_hall_132, 4, 1),(id_hall_132, 4, 2),(id_hall_132, 4, 3),(id_hall_132, 4, 4),(id_hall_132, 4, 5),(id_hall_132, 4, 6),(id_hall_132, 4, 7),(id_hall_132, 4, 8),
		(id_hall_132, 5, 1),(id_hall_132, 5, 2),(id_hall_132, 5, 3),(id_hall_132, 5, 4),(id_hall_132, 5, 5),(id_hall_132, 5, 6),(id_hall_132, 5, 7),(id_hall_132, 5, 8),
		(id_hall_132, 6, 1),(id_hall_132, 6, 2),(id_hall_132, 6, 3),(id_hall_132, 6, 4),(id_hall_132, 6, 5),(id_hall_132, 6, 6),(id_hall_132, 6, 7),(id_hall_132, 6, 8),
		(id_hall_132, 7, 1),(id_hall_132, 7, 2),(id_hall_132, 7, 3),(id_hall_132, 7, 4),(id_hall_132, 7, 5),(id_hall_132, 7, 6),(id_hall_132, 7, 7),(id_hall_132, 7, 8),
		(id_hall_133, 1, 1),(id_hall_133, 1, 2),(id_hall_133, 1, 3),(id_hall_133, 1, 4),(id_hall_133, 1, 5),(id_hall_133, 1, 6),(id_hall_133, 1, 7),(id_hall_133, 1, 8),
		(id_hall_133, 2, 1),(id_hall_133, 2, 2),(id_hall_133, 2, 3),(id_hall_133, 2, 4),(id_hall_133, 2, 5),(id_hall_133, 2, 6),(id_hall_133, 2, 7),(id_hall_133, 2, 8),
		(id_hall_133, 3, 1),(id_hall_133, 3, 2),(id_hall_133, 3, 3),(id_hall_133, 3, 4),(id_hall_133, 3, 5),(id_hall_133, 3, 6),(id_hall_133, 3, 7),(id_hall_133, 3, 8),
		(id_hall_133, 4, 1),(id_hall_133, 4, 2),(id_hall_133, 4, 3),(id_hall_133, 4, 4),(id_hall_133, 4, 5),(id_hall_133, 4, 6),(id_hall_133, 4, 7),(id_hall_133, 4, 8),
		(id_hall_133, 5, 1),(id_hall_133, 5, 2),(id_hall_133, 5, 3),(id_hall_133, 5, 4),(id_hall_133, 5, 5),(id_hall_133, 5, 6),(id_hall_133, 5, 7),(id_hall_133, 5, 8),
		(id_hall_133, 6, 1),(id_hall_133, 6, 2),(id_hall_133, 6, 3),(id_hall_133, 6, 4),(id_hall_133, 6, 5),(id_hall_133, 6, 6),(id_hall_133, 6, 7),(id_hall_133, 6, 8),
		(id_hall_133, 7, 1),(id_hall_133, 7, 2),(id_hall_133, 7, 3),(id_hall_133, 7, 4),(id_hall_133, 7, 5),(id_hall_133, 7, 6),(id_hall_133, 7, 7),(id_hall_133, 7, 8),
		(id_hall_134, 1, 1),(id_hall_134, 1, 2),(id_hall_134, 1, 3),(id_hall_134, 1, 4),(id_hall_134, 1, 5),(id_hall_134, 1, 6),(id_hall_134, 1, 7),(id_hall_134, 1, 8),
		(id_hall_134, 2, 1),(id_hall_134, 2, 2),(id_hall_134, 2, 3),(id_hall_134, 2, 4),(id_hall_134, 2, 5),(id_hall_134, 2, 6),(id_hall_134, 2, 7),(id_hall_134, 2, 8),
		(id_hall_134, 3, 1),(id_hall_134, 3, 2),(id_hall_134, 3, 3),(id_hall_134, 3, 4),(id_hall_134, 3, 5),(id_hall_134, 3, 6),(id_hall_134, 3, 7),(id_hall_134, 3, 8),
		(id_hall_134, 4, 1),(id_hall_134, 4, 2),(id_hall_134, 4, 3),(id_hall_134, 4, 4),(id_hall_134, 4, 5),(id_hall_134, 4, 6),(id_hall_134, 4, 7),(id_hall_134, 4, 8),
		(id_hall_134, 5, 1),(id_hall_134, 5, 2),(id_hall_134, 5, 3),(id_hall_134, 5, 4),(id_hall_134, 5, 5),(id_hall_134, 5, 6),(id_hall_134, 5, 7),(id_hall_134, 5, 8),
		(id_hall_134, 6, 1),(id_hall_134, 6, 2),(id_hall_134, 6, 3),(id_hall_134, 6, 4),(id_hall_134, 6, 5),(id_hall_134, 6, 6),(id_hall_134, 6, 7),(id_hall_134, 6, 8),
		(id_hall_134, 7, 1),(id_hall_134, 7, 2),(id_hall_134, 7, 3),(id_hall_134, 7, 4),(id_hall_134, 7, 5),(id_hall_134, 7, 6),(id_hall_134, 7, 7),(id_hall_134, 7, 8),
		(id_hall_135, 1, 1),(id_hall_135, 1, 2),(id_hall_135, 1, 3),(id_hall_135, 1, 4),(id_hall_135, 1, 5),(id_hall_135, 1, 6),(id_hall_135, 1, 7),(id_hall_135, 1, 8),
		(id_hall_135, 2, 1),(id_hall_135, 2, 2),(id_hall_135, 2, 3),(id_hall_135, 2, 4),(id_hall_135, 2, 5),(id_hall_135, 2, 6),(id_hall_135, 2, 7),(id_hall_135, 2, 8),
		(id_hall_135, 3, 1),(id_hall_135, 3, 2),(id_hall_135, 3, 3),(id_hall_135, 3, 4),(id_hall_135, 3, 5),(id_hall_135, 3, 6),(id_hall_135, 3, 7),(id_hall_135, 3, 8),
		(id_hall_135, 4, 1),(id_hall_135, 4, 2),(id_hall_135, 4, 3),(id_hall_135, 4, 4),(id_hall_135, 4, 5),(id_hall_135, 4, 6),(id_hall_135, 4, 7),(id_hall_135, 4, 8),
		(id_hall_135, 5, 1),(id_hall_135, 5, 2),(id_hall_135, 5, 3),(id_hall_135, 5, 4),(id_hall_135, 5, 5),(id_hall_135, 5, 6),(id_hall_135, 5, 7),(id_hall_135, 5, 8),
		(id_hall_135, 6, 1),(id_hall_135, 6, 2),(id_hall_135, 6, 3),(id_hall_135, 6, 4),(id_hall_135, 6, 5),(id_hall_135, 6, 6),(id_hall_135, 6, 7),(id_hall_135, 6, 8),
		(id_hall_135, 7, 1),(id_hall_135, 7, 2),(id_hall_135, 7, 3),(id_hall_135, 7, 4),(id_hall_135, 7, 5),(id_hall_135, 7, 6),(id_hall_135, 7, 7),(id_hall_135, 7, 8),
		(id_hall_136, 1, 1),(id_hall_136, 1, 2),(id_hall_136, 1, 3),(id_hall_136, 1, 4),(id_hall_136, 1, 5),(id_hall_136, 1, 6),(id_hall_136, 1, 7),(id_hall_136, 1, 8),
		(id_hall_136, 2, 1),(id_hall_136, 2, 2),(id_hall_136, 2, 3),(id_hall_136, 2, 4),(id_hall_136, 2, 5),(id_hall_136, 2, 6),(id_hall_136, 2, 7),(id_hall_136, 2, 8),
		(id_hall_136, 3, 1),(id_hall_136, 3, 2),(id_hall_136, 3, 3),(id_hall_136, 3, 4),(id_hall_136, 3, 5),(id_hall_136, 3, 6),(id_hall_136, 3, 7),(id_hall_136, 3, 8),
		(id_hall_136, 4, 1),(id_hall_136, 4, 2),(id_hall_136, 4, 3),(id_hall_136, 4, 4),(id_hall_136, 4, 5),(id_hall_136, 4, 6),(id_hall_136, 4, 7),(id_hall_136, 4, 8),
		(id_hall_136, 5, 1),(id_hall_136, 5, 2),(id_hall_136, 5, 3),(id_hall_136, 5, 4),(id_hall_136, 5, 5),(id_hall_136, 5, 6),(id_hall_136, 5, 7),(id_hall_136, 5, 8),
		(id_hall_136, 6, 1),(id_hall_136, 6, 2),(id_hall_136, 6, 3),(id_hall_136, 6, 4),(id_hall_136, 6, 5),(id_hall_136, 6, 6),(id_hall_136, 6, 7),(id_hall_136, 6, 8),
		(id_hall_136, 7, 1),(id_hall_136, 7, 2),(id_hall_136, 7, 3),(id_hall_136, 7, 4),(id_hall_136, 7, 5),(id_hall_136, 7, 6),(id_hall_136, 7, 7),(id_hall_136, 7, 8),
		(id_hall_137, 1, 1),(id_hall_137, 1, 2),(id_hall_137, 1, 3),(id_hall_137, 1, 4),(id_hall_137, 1, 5),(id_hall_137, 1, 6),(id_hall_137, 1, 7),(id_hall_137, 1, 8),
		(id_hall_137, 2, 1),(id_hall_137, 2, 2),(id_hall_137, 2, 3),(id_hall_137, 2, 4),(id_hall_137, 2, 5),(id_hall_137, 2, 6),(id_hall_137, 2, 7),(id_hall_137, 2, 8),
		(id_hall_137, 3, 1),(id_hall_137, 3, 2),(id_hall_137, 3, 3),(id_hall_137, 3, 4),(id_hall_137, 3, 5),(id_hall_137, 3, 6),(id_hall_137, 3, 7),(id_hall_137, 3, 8),
		(id_hall_137, 4, 1),(id_hall_137, 4, 2),(id_hall_137, 4, 3),(id_hall_137, 4, 4),(id_hall_137, 4, 5),(id_hall_137, 4, 6),(id_hall_137, 4, 7),(id_hall_137, 4, 8),
		(id_hall_137, 5, 1),(id_hall_137, 5, 2),(id_hall_137, 5, 3),(id_hall_137, 5, 4),(id_hall_137, 5, 5),(id_hall_137, 5, 6),(id_hall_137, 5, 7),(id_hall_137, 5, 8),
		(id_hall_137, 6, 1),(id_hall_137, 6, 2),(id_hall_137, 6, 3),(id_hall_137, 6, 4),(id_hall_137, 6, 5),(id_hall_137, 6, 6),(id_hall_137, 6, 7),(id_hall_137, 6, 8),
		(id_hall_137, 7, 1),(id_hall_137, 7, 2),(id_hall_137, 7, 3),(id_hall_137, 7, 4),(id_hall_137, 7, 5),(id_hall_137, 7, 6),(id_hall_137, 7, 7),(id_hall_137, 7, 8),
		(id_hall_138, 1, 1),(id_hall_138, 1, 2),(id_hall_138, 1, 3),(id_hall_138, 1, 4),(id_hall_138, 1, 5),(id_hall_138, 1, 6),(id_hall_138, 1, 7),(id_hall_138, 1, 8),
		(id_hall_138, 2, 1),(id_hall_138, 2, 2),(id_hall_138, 2, 3),(id_hall_138, 2, 4),(id_hall_138, 2, 5),(id_hall_138, 2, 6),(id_hall_138, 2, 7),(id_hall_138, 2, 8),
		(id_hall_138, 3, 1),(id_hall_138, 3, 2),(id_hall_138, 3, 3),(id_hall_138, 3, 4),(id_hall_138, 3, 5),(id_hall_138, 3, 6),(id_hall_138, 3, 7),(id_hall_138, 3, 8),
		(id_hall_138, 4, 1),(id_hall_138, 4, 2),(id_hall_138, 4, 3),(id_hall_138, 4, 4),(id_hall_138, 4, 5),(id_hall_138, 4, 6),(id_hall_138, 4, 7),(id_hall_138, 4, 8),
		(id_hall_138, 5, 1),(id_hall_138, 5, 2),(id_hall_138, 5, 3),(id_hall_138, 5, 4),(id_hall_138, 5, 5),(id_hall_138, 5, 6),(id_hall_138, 5, 7),(id_hall_138, 5, 8),
		(id_hall_138, 6, 1),(id_hall_138, 6, 2),(id_hall_138, 6, 3),(id_hall_138, 6, 4),(id_hall_138, 6, 5),(id_hall_138, 6, 6),(id_hall_138, 6, 7),(id_hall_138, 6, 8),
		(id_hall_138, 7, 1),(id_hall_138, 7, 2),(id_hall_138, 7, 3),(id_hall_138, 7, 4),(id_hall_138, 7, 5),(id_hall_138, 7, 6),(id_hall_138, 7, 7),(id_hall_138, 7, 8),
		(id_hall_139, 1, 1),(id_hall_139, 1, 2),(id_hall_139, 1, 3),(id_hall_139, 1, 4),(id_hall_139, 1, 5),(id_hall_139, 1, 6),(id_hall_139, 1, 7),(id_hall_139, 1, 8),
		(id_hall_139, 2, 1),(id_hall_139, 2, 2),(id_hall_139, 2, 3),(id_hall_139, 2, 4),(id_hall_139, 2, 5),(id_hall_139, 2, 6),(id_hall_139, 2, 7),(id_hall_139, 2, 8),
		(id_hall_139, 3, 1),(id_hall_139, 3, 2),(id_hall_139, 3, 3),(id_hall_139, 3, 4),(id_hall_139, 3, 5),(id_hall_139, 3, 6),(id_hall_139, 3, 7),(id_hall_139, 3, 8),
		(id_hall_139, 4, 1),(id_hall_139, 4, 2),(id_hall_139, 4, 3),(id_hall_139, 4, 4),(id_hall_139, 4, 5),(id_hall_139, 4, 6),(id_hall_139, 4, 7),(id_hall_139, 4, 8),
		(id_hall_139, 5, 1),(id_hall_139, 5, 2),(id_hall_139, 5, 3),(id_hall_139, 5, 4),(id_hall_139, 5, 5),(id_hall_139, 5, 6),(id_hall_139, 5, 7),(id_hall_139, 5, 8),
		(id_hall_139, 6, 1),(id_hall_139, 6, 2),(id_hall_139, 6, 3),(id_hall_139, 6, 4),(id_hall_139, 6, 5),(id_hall_139, 6, 6),(id_hall_139, 6, 7),(id_hall_139, 6, 8),
		(id_hall_139, 7, 1),(id_hall_139, 7, 2),(id_hall_139, 7, 3),(id_hall_139, 7, 4),(id_hall_139, 7, 5),(id_hall_139, 7, 6),(id_hall_139, 7, 7),(id_hall_139, 7, 8),
		(id_hall_140, 1, 1),(id_hall_140, 1, 2),(id_hall_140, 1, 3),(id_hall_140, 1, 4),(id_hall_140, 1, 5),(id_hall_140, 1, 6),(id_hall_140, 1, 7),(id_hall_140, 1, 8),
		(id_hall_140, 2, 1),(id_hall_140, 2, 2),(id_hall_140, 2, 3),(id_hall_140, 2, 4),(id_hall_140, 2, 5),(id_hall_140, 2, 6),(id_hall_140, 2, 7),(id_hall_140, 2, 8),
		(id_hall_140, 3, 1),(id_hall_140, 3, 2),(id_hall_140, 3, 3),(id_hall_140, 3, 4),(id_hall_140, 3, 5),(id_hall_140, 3, 6),(id_hall_140, 3, 7),(id_hall_140, 3, 8),
		(id_hall_140, 4, 1),(id_hall_140, 4, 2),(id_hall_140, 4, 3),(id_hall_140, 4, 4),(id_hall_140, 4, 5),(id_hall_140, 4, 6),(id_hall_140, 4, 7),(id_hall_140, 4, 8),
		(id_hall_140, 5, 1),(id_hall_140, 5, 2),(id_hall_140, 5, 3),(id_hall_140, 5, 4),(id_hall_140, 5, 5),(id_hall_140, 5, 6),(id_hall_140, 5, 7),(id_hall_140, 5, 8),
		(id_hall_140, 6, 1),(id_hall_140, 6, 2),(id_hall_140, 6, 3),(id_hall_140, 6, 4),(id_hall_140, 6, 5),(id_hall_140, 6, 6),(id_hall_140, 6, 7),(id_hall_140, 6, 8),
		(id_hall_140, 7, 1),(id_hall_140, 7, 2),(id_hall_140, 7, 3),(id_hall_140, 7, 4),(id_hall_140, 7, 5),(id_hall_140, 7, 6),(id_hall_140, 7, 7),(id_hall_140, 7, 8),
		(id_hall_141, 1, 1),(id_hall_141, 1, 2),(id_hall_141, 1, 3),(id_hall_141, 1, 4),(id_hall_141, 1, 5),(id_hall_141, 1, 6),(id_hall_141, 1, 7),(id_hall_141, 1, 8),
		(id_hall_141, 2, 1),(id_hall_141, 2, 2),(id_hall_141, 2, 3),(id_hall_141, 2, 4),(id_hall_141, 2, 5),(id_hall_141, 2, 6),(id_hall_141, 2, 7),(id_hall_141, 2, 8),
		(id_hall_141, 3, 1),(id_hall_141, 3, 2),(id_hall_141, 3, 3),(id_hall_141, 3, 4),(id_hall_141, 3, 5),(id_hall_141, 3, 6),(id_hall_141, 3, 7),(id_hall_141, 3, 8),
		(id_hall_141, 4, 1),(id_hall_141, 4, 2),(id_hall_141, 4, 3),(id_hall_141, 4, 4),(id_hall_141, 4, 5),(id_hall_141, 4, 6),(id_hall_141, 4, 7),(id_hall_141, 4, 8),
		(id_hall_141, 5, 1),(id_hall_141, 5, 2),(id_hall_141, 5, 3),(id_hall_141, 5, 4),(id_hall_141, 5, 5),(id_hall_141, 5, 6),(id_hall_141, 5, 7),(id_hall_141, 5, 8),
		(id_hall_141, 6, 1),(id_hall_141, 6, 2),(id_hall_141, 6, 3),(id_hall_141, 6, 4),(id_hall_141, 6, 5),(id_hall_141, 6, 6),(id_hall_141, 6, 7),(id_hall_141, 6, 8),
		(id_hall_141, 7, 1),(id_hall_141, 7, 2),(id_hall_141, 7, 3),(id_hall_141, 7, 4),(id_hall_141, 7, 5),(id_hall_141, 7, 6),(id_hall_141, 7, 7),(id_hall_141, 7, 8),
		(id_hall_142, 1, 1),(id_hall_142, 1, 2),(id_hall_142, 1, 3),(id_hall_142, 1, 4),(id_hall_142, 1, 5),(id_hall_142, 1, 6),(id_hall_142, 1, 7),(id_hall_142, 1, 8),
		(id_hall_142, 2, 1),(id_hall_142, 2, 2),(id_hall_142, 2, 3),(id_hall_142, 2, 4),(id_hall_142, 2, 5),(id_hall_142, 2, 6),(id_hall_142, 2, 7),(id_hall_142, 2, 8),
		(id_hall_142, 3, 1),(id_hall_142, 3, 2),(id_hall_142, 3, 3),(id_hall_142, 3, 4),(id_hall_142, 3, 5),(id_hall_142, 3, 6),(id_hall_142, 3, 7),(id_hall_142, 3, 8),
		(id_hall_142, 4, 1),(id_hall_142, 4, 2),(id_hall_142, 4, 3),(id_hall_142, 4, 4),(id_hall_142, 4, 5),(id_hall_142, 4, 6),(id_hall_142, 4, 7),(id_hall_142, 4, 8),
		(id_hall_142, 5, 1),(id_hall_142, 5, 2),(id_hall_142, 5, 3),(id_hall_142, 5, 4),(id_hall_142, 5, 5),(id_hall_142, 5, 6),(id_hall_142, 5, 7),(id_hall_142, 5, 8),
		(id_hall_142, 6, 1),(id_hall_142, 6, 2),(id_hall_142, 6, 3),(id_hall_142, 6, 4),(id_hall_142, 6, 5),(id_hall_142, 6, 6),(id_hall_142, 6, 7),(id_hall_142, 6, 8),
		(id_hall_142, 7, 1),(id_hall_142, 7, 2),(id_hall_142, 7, 3),(id_hall_142, 7, 4),(id_hall_142, 7, 5),(id_hall_142, 7, 6),(id_hall_142, 7, 7),(id_hall_142, 7, 8),
		(id_hall_143, 1, 1),(id_hall_143, 1, 2),(id_hall_143, 1, 3),(id_hall_143, 1, 4),(id_hall_143, 1, 5),(id_hall_143, 1, 6),(id_hall_143, 1, 7),(id_hall_143, 1, 8),
		(id_hall_143, 2, 1),(id_hall_143, 2, 2),(id_hall_143, 2, 3),(id_hall_143, 2, 4),(id_hall_143, 2, 5),(id_hall_143, 2, 6),(id_hall_143, 2, 7),(id_hall_143, 2, 8),
		(id_hall_143, 3, 1),(id_hall_143, 3, 2),(id_hall_143, 3, 3),(id_hall_143, 3, 4),(id_hall_143, 3, 5),(id_hall_143, 3, 6),(id_hall_143, 3, 7),(id_hall_143, 3, 8),
		(id_hall_143, 4, 1),(id_hall_143, 4, 2),(id_hall_143, 4, 3),(id_hall_143, 4, 4),(id_hall_143, 4, 5),(id_hall_143, 4, 6),(id_hall_143, 4, 7),(id_hall_143, 4, 8),
		(id_hall_143, 5, 1),(id_hall_143, 5, 2),(id_hall_143, 5, 3),(id_hall_143, 5, 4),(id_hall_143, 5, 5),(id_hall_143, 5, 6),(id_hall_143, 5, 7),(id_hall_143, 5, 8),
		(id_hall_143, 6, 1),(id_hall_143, 6, 2),(id_hall_143, 6, 3),(id_hall_143, 6, 4),(id_hall_143, 6, 5),(id_hall_143, 6, 6),(id_hall_143, 6, 7),(id_hall_143, 6, 8),
		(id_hall_143, 7, 1),(id_hall_143, 7, 2),(id_hall_143, 7, 3),(id_hall_143, 7, 4),(id_hall_143, 7, 5),(id_hall_143, 7, 6),(id_hall_143, 7, 7),(id_hall_143, 7, 8),
		(id_hall_144, 1, 1),(id_hall_144, 1, 2),(id_hall_144, 1, 3),(id_hall_144, 1, 4),(id_hall_144, 1, 5),(id_hall_144, 1, 6),(id_hall_144, 1, 7),(id_hall_144, 1, 8),
		(id_hall_144, 2, 1),(id_hall_144, 2, 2),(id_hall_144, 2, 3),(id_hall_144, 2, 4),(id_hall_144, 2, 5),(id_hall_144, 2, 6),(id_hall_144, 2, 7),(id_hall_144, 2, 8),
		(id_hall_144, 3, 1),(id_hall_144, 3, 2),(id_hall_144, 3, 3),(id_hall_144, 3, 4),(id_hall_144, 3, 5),(id_hall_144, 3, 6),(id_hall_144, 3, 7),(id_hall_144, 3, 8),
		(id_hall_144, 4, 1),(id_hall_144, 4, 2),(id_hall_144, 4, 3),(id_hall_144, 4, 4),(id_hall_144, 4, 5),(id_hall_144, 4, 6),(id_hall_144, 4, 7),(id_hall_144, 4, 8),
		(id_hall_144, 5, 1),(id_hall_144, 5, 2),(id_hall_144, 5, 3),(id_hall_144, 5, 4),(id_hall_144, 5, 5),(id_hall_144, 5, 6),(id_hall_144, 5, 7),(id_hall_144, 5, 8),
		(id_hall_144, 6, 1),(id_hall_144, 6, 2),(id_hall_144, 6, 3),(id_hall_144, 6, 4),(id_hall_144, 6, 5),(id_hall_144, 6, 6),(id_hall_144, 6, 7),(id_hall_144, 6, 8),
		(id_hall_144, 7, 1),(id_hall_144, 7, 2),(id_hall_144, 7, 3),(id_hall_144, 7, 4),(id_hall_144, 7, 5),(id_hall_144, 7, 6),(id_hall_144, 7, 7),(id_hall_144, 7, 8),
		(id_hall_145, 1, 1),(id_hall_145, 1, 2),(id_hall_145, 1, 3),(id_hall_145, 1, 4),(id_hall_145, 1, 5),(id_hall_145, 1, 6),(id_hall_145, 1, 7),(id_hall_145, 1, 8),
		(id_hall_145, 2, 1),(id_hall_145, 2, 2),(id_hall_145, 2, 3),(id_hall_145, 2, 4),(id_hall_145, 2, 5),(id_hall_145, 2, 6),(id_hall_145, 2, 7),(id_hall_145, 2, 8),
		(id_hall_145, 3, 1),(id_hall_145, 3, 2),(id_hall_145, 3, 3),(id_hall_145, 3, 4),(id_hall_145, 3, 5),(id_hall_145, 3, 6),(id_hall_145, 3, 7),(id_hall_145, 3, 8),
		(id_hall_145, 4, 1),(id_hall_145, 4, 2),(id_hall_145, 4, 3),(id_hall_145, 4, 4),(id_hall_145, 4, 5),(id_hall_145, 4, 6),(id_hall_145, 4, 7),(id_hall_145, 4, 8),
		(id_hall_145, 5, 1),(id_hall_145, 5, 2),(id_hall_145, 5, 3),(id_hall_145, 5, 4),(id_hall_145, 5, 5),(id_hall_145, 5, 6),(id_hall_145, 5, 7),(id_hall_145, 5, 8),
		(id_hall_145, 6, 1),(id_hall_145, 6, 2),(id_hall_145, 6, 3),(id_hall_145, 6, 4),(id_hall_145, 6, 5),(id_hall_145, 6, 6),(id_hall_145, 6, 7),(id_hall_145, 6, 8),
		(id_hall_145, 7, 1),(id_hall_145, 7, 2),(id_hall_145, 7, 3),(id_hall_145, 7, 4),(id_hall_145, 7, 5),(id_hall_145, 7, 6),(id_hall_145, 7, 7),(id_hall_145, 7, 8),
		(id_hall_146, 1, 1),(id_hall_146, 1, 2),(id_hall_146, 1, 3),(id_hall_146, 1, 4),(id_hall_146, 1, 5),(id_hall_146, 1, 6),(id_hall_146, 1, 7),(id_hall_146, 1, 8),
		(id_hall_146, 2, 1),(id_hall_146, 2, 2),(id_hall_146, 2, 3),(id_hall_146, 2, 4),(id_hall_146, 2, 5),(id_hall_146, 2, 6),(id_hall_146, 2, 7),(id_hall_146, 2, 8),
		(id_hall_146, 3, 1),(id_hall_146, 3, 2),(id_hall_146, 3, 3),(id_hall_146, 3, 4),(id_hall_146, 3, 5),(id_hall_146, 3, 6),(id_hall_146, 3, 7),(id_hall_146, 3, 8),
		(id_hall_146, 4, 1),(id_hall_146, 4, 2),(id_hall_146, 4, 3),(id_hall_146, 4, 4),(id_hall_146, 4, 5),(id_hall_146, 4, 6),(id_hall_146, 4, 7),(id_hall_146, 4, 8),
		(id_hall_146, 5, 1),(id_hall_146, 5, 2),(id_hall_146, 5, 3),(id_hall_146, 5, 4),(id_hall_146, 5, 5),(id_hall_146, 5, 6),(id_hall_146, 5, 7),(id_hall_146, 5, 8),
		(id_hall_146, 6, 1),(id_hall_146, 6, 2),(id_hall_146, 6, 3),(id_hall_146, 6, 4),(id_hall_146, 6, 5),(id_hall_146, 6, 6),(id_hall_146, 6, 7),(id_hall_146, 6, 8),
		(id_hall_146, 7, 1),(id_hall_146, 7, 2),(id_hall_146, 7, 3),(id_hall_146, 7, 4),(id_hall_146, 7, 5),(id_hall_146, 7, 6),(id_hall_146, 7, 7),(id_hall_146, 7, 8),
		(id_hall_147, 1, 1),(id_hall_147, 1, 2),(id_hall_147, 1, 3),(id_hall_147, 1, 4),(id_hall_147, 1, 5),(id_hall_147, 1, 6),(id_hall_147, 1, 7),(id_hall_147, 1, 8),
		(id_hall_147, 2, 1),(id_hall_147, 2, 2),(id_hall_147, 2, 3),(id_hall_147, 2, 4),(id_hall_147, 2, 5),(id_hall_147, 2, 6),(id_hall_147, 2, 7),(id_hall_147, 2, 8),
		(id_hall_147, 3, 1),(id_hall_147, 3, 2),(id_hall_147, 3, 3),(id_hall_147, 3, 4),(id_hall_147, 3, 5),(id_hall_147, 3, 6),(id_hall_147, 3, 7),(id_hall_147, 3, 8),
		(id_hall_147, 4, 1),(id_hall_147, 4, 2),(id_hall_147, 4, 3),(id_hall_147, 4, 4),(id_hall_147, 4, 5),(id_hall_147, 4, 6),(id_hall_147, 4, 7),(id_hall_147, 4, 8),
		(id_hall_147, 5, 1),(id_hall_147, 5, 2),(id_hall_147, 5, 3),(id_hall_147, 5, 4),(id_hall_147, 5, 5),(id_hall_147, 5, 6),(id_hall_147, 5, 7),(id_hall_147, 5, 8),
		(id_hall_147, 6, 1),(id_hall_147, 6, 2),(id_hall_147, 6, 3),(id_hall_147, 6, 4),(id_hall_147, 6, 5),(id_hall_147, 6, 6),(id_hall_147, 6, 7),(id_hall_147, 6, 8),
		(id_hall_147, 7, 1),(id_hall_147, 7, 2),(id_hall_147, 7, 3),(id_hall_147, 7, 4),(id_hall_147, 7, 5),(id_hall_147, 7, 6),(id_hall_147, 7, 7),(id_hall_147, 7, 8),
		(id_hall_148, 1, 1),(id_hall_148, 1, 2),(id_hall_148, 1, 3),(id_hall_148, 1, 4),(id_hall_148, 1, 5),(id_hall_148, 1, 6),(id_hall_148, 1, 7),(id_hall_148, 1, 8),
		(id_hall_148, 2, 1),(id_hall_148, 2, 2),(id_hall_148, 2, 3),(id_hall_148, 2, 4),(id_hall_148, 2, 5),(id_hall_148, 2, 6),(id_hall_148, 2, 7),(id_hall_148, 2, 8),
		(id_hall_148, 3, 1),(id_hall_148, 3, 2),(id_hall_148, 3, 3),(id_hall_148, 3, 4),(id_hall_148, 3, 5),(id_hall_148, 3, 6),(id_hall_148, 3, 7),(id_hall_148, 3, 8),
		(id_hall_148, 4, 1),(id_hall_148, 4, 2),(id_hall_148, 4, 3),(id_hall_148, 4, 4),(id_hall_148, 4, 5),(id_hall_148, 4, 6),(id_hall_148, 4, 7),(id_hall_148, 4, 8),
		(id_hall_148, 5, 1),(id_hall_148, 5, 2),(id_hall_148, 5, 3),(id_hall_148, 5, 4),(id_hall_148, 5, 5),(id_hall_148, 5, 6),(id_hall_148, 5, 7),(id_hall_148, 5, 8),
		(id_hall_148, 6, 1),(id_hall_148, 6, 2),(id_hall_148, 6, 3),(id_hall_148, 6, 4),(id_hall_148, 6, 5),(id_hall_148, 6, 6),(id_hall_148, 6, 7),(id_hall_148, 6, 8),
		(id_hall_148, 7, 1),(id_hall_148, 7, 2),(id_hall_148, 7, 3),(id_hall_148, 7, 4),(id_hall_148, 7, 5),(id_hall_148, 7, 6),(id_hall_148, 7, 7),(id_hall_148, 7, 8),
		(id_hall_149, 1, 1),(id_hall_149, 1, 2),(id_hall_149, 1, 3),(id_hall_149, 1, 4),(id_hall_149, 1, 5),(id_hall_149, 1, 6),(id_hall_149, 1, 7),(id_hall_149, 1, 8),
		(id_hall_149, 2, 1),(id_hall_149, 2, 2),(id_hall_149, 2, 3),(id_hall_149, 2, 4),(id_hall_149, 2, 5),(id_hall_149, 2, 6),(id_hall_149, 2, 7),(id_hall_149, 2, 8),
		(id_hall_149, 3, 1),(id_hall_149, 3, 2),(id_hall_149, 3, 3),(id_hall_149, 3, 4),(id_hall_149, 3, 5),(id_hall_149, 3, 6),(id_hall_149, 3, 7),(id_hall_149, 3, 8),
		(id_hall_149, 4, 1),(id_hall_149, 4, 2),(id_hall_149, 4, 3),(id_hall_149, 4, 4),(id_hall_149, 4, 5),(id_hall_149, 4, 6),(id_hall_149, 4, 7),(id_hall_149, 4, 8),
		(id_hall_149, 5, 1),(id_hall_149, 5, 2),(id_hall_149, 5, 3),(id_hall_149, 5, 4),(id_hall_149, 5, 5),(id_hall_149, 5, 6),(id_hall_149, 5, 7),(id_hall_149, 5, 8),
		(id_hall_149, 6, 1),(id_hall_149, 6, 2),(id_hall_149, 6, 3),(id_hall_149, 6, 4),(id_hall_149, 6, 5),(id_hall_149, 6, 6),(id_hall_149, 6, 7),(id_hall_149, 6, 8),
		(id_hall_149, 7, 1),(id_hall_149, 7, 2),(id_hall_149, 7, 3),(id_hall_149, 7, 4),(id_hall_149, 7, 5),(id_hall_149, 7, 6),(id_hall_149, 7, 7),(id_hall_149, 7, 8),
		(id_hall_150, 1, 1),(id_hall_150, 1, 2),(id_hall_150, 1, 3),(id_hall_150, 1, 4),(id_hall_150, 1, 5),(id_hall_150, 1, 6),(id_hall_150, 1, 7),(id_hall_150, 1, 8),
		(id_hall_150, 2, 1),(id_hall_150, 2, 2),(id_hall_150, 2, 3),(id_hall_150, 2, 4),(id_hall_150, 2, 5),(id_hall_150, 2, 6),(id_hall_150, 2, 7),(id_hall_150, 2, 8),
		(id_hall_150, 3, 1),(id_hall_150, 3, 2),(id_hall_150, 3, 3),(id_hall_150, 3, 4),(id_hall_150, 3, 5),(id_hall_150, 3, 6),(id_hall_150, 3, 7),(id_hall_150, 3, 8),
		(id_hall_150, 4, 1),(id_hall_150, 4, 2),(id_hall_150, 4, 3),(id_hall_150, 4, 4),(id_hall_150, 4, 5),(id_hall_150, 4, 6),(id_hall_150, 4, 7),(id_hall_150, 4, 8),
		(id_hall_150, 5, 1),(id_hall_150, 5, 2),(id_hall_150, 5, 3),(id_hall_150, 5, 4),(id_hall_150, 5, 5),(id_hall_150, 5, 6),(id_hall_150, 5, 7),(id_hall_150, 5, 8),
		(id_hall_150, 6, 1),(id_hall_150, 6, 2),(id_hall_150, 6, 3),(id_hall_150, 6, 4),(id_hall_150, 6, 5),(id_hall_150, 6, 6),(id_hall_150, 6, 7),(id_hall_150, 6, 8),
		(id_hall_150, 7, 1),(id_hall_150, 7, 2),(id_hall_150, 7, 3),(id_hall_150, 7, 4),(id_hall_150, 7, 5),(id_hall_150, 7, 6),(id_hall_150, 7, 7),(id_hall_150, 7, 8),
		(id_hall_151, 1, 1),(id_hall_151, 1, 2),(id_hall_151, 1, 3),(id_hall_151, 1, 4),(id_hall_151, 1, 5),(id_hall_151, 1, 6),(id_hall_151, 1, 7),(id_hall_151, 1, 8),
		(id_hall_151, 2, 1),(id_hall_151, 2, 2),(id_hall_151, 2, 3),(id_hall_151, 2, 4),(id_hall_151, 2, 5),(id_hall_151, 2, 6),(id_hall_151, 2, 7),(id_hall_151, 2, 8),
		(id_hall_151, 3, 1),(id_hall_151, 3, 2),(id_hall_151, 3, 3),(id_hall_151, 3, 4),(id_hall_151, 3, 5),(id_hall_151, 3, 6),(id_hall_151, 3, 7),(id_hall_151, 3, 8),
		(id_hall_151, 4, 1),(id_hall_151, 4, 2),(id_hall_151, 4, 3),(id_hall_151, 4, 4),(id_hall_151, 4, 5),(id_hall_151, 4, 6),(id_hall_151, 4, 7),(id_hall_151, 4, 8),
		(id_hall_151, 5, 1),(id_hall_151, 5, 2),(id_hall_151, 5, 3),(id_hall_151, 5, 4),(id_hall_151, 5, 5),(id_hall_151, 5, 6),(id_hall_151, 5, 7),(id_hall_151, 5, 8),
		(id_hall_151, 6, 1),(id_hall_151, 6, 2),(id_hall_151, 6, 3),(id_hall_151, 6, 4),(id_hall_151, 6, 5),(id_hall_151, 6, 6),(id_hall_151, 6, 7),(id_hall_151, 6, 8),
		(id_hall_151, 7, 1),(id_hall_151, 7, 2),(id_hall_151, 7, 3),(id_hall_151, 7, 4),(id_hall_151, 7, 5),(id_hall_151, 7, 6),(id_hall_151, 7, 7),(id_hall_151, 7, 8),
		(id_hall_152, 1, 1),(id_hall_152, 1, 2),(id_hall_152, 1, 3),(id_hall_152, 1, 4),(id_hall_152, 1, 5),(id_hall_152, 1, 6),(id_hall_152, 1, 7),(id_hall_152, 1, 8),
		(id_hall_152, 2, 1),(id_hall_152, 2, 2),(id_hall_152, 2, 3),(id_hall_152, 2, 4),(id_hall_152, 2, 5),(id_hall_152, 2, 6),(id_hall_152, 2, 7),(id_hall_152, 2, 8),
		(id_hall_152, 3, 1),(id_hall_152, 3, 2),(id_hall_152, 3, 3),(id_hall_152, 3, 4),(id_hall_152, 3, 5),(id_hall_152, 3, 6),(id_hall_152, 3, 7),(id_hall_152, 3, 8),
		(id_hall_152, 4, 1),(id_hall_152, 4, 2),(id_hall_152, 4, 3),(id_hall_152, 4, 4),(id_hall_152, 4, 5),(id_hall_152, 4, 6),(id_hall_152, 4, 7),(id_hall_152, 4, 8),
		(id_hall_152, 5, 1),(id_hall_152, 5, 2),(id_hall_152, 5, 3),(id_hall_152, 5, 4),(id_hall_152, 5, 5),(id_hall_152, 5, 6),(id_hall_152, 5, 7),(id_hall_152, 5, 8),
		(id_hall_152, 6, 1),(id_hall_152, 6, 2),(id_hall_152, 6, 3),(id_hall_152, 6, 4),(id_hall_152, 6, 5),(id_hall_152, 6, 6),(id_hall_152, 6, 7),(id_hall_152, 6, 8),
		(id_hall_152, 7, 1),(id_hall_152, 7, 2),(id_hall_152, 7, 3),(id_hall_152, 7, 4),(id_hall_152, 7, 5),(id_hall_152, 7, 6),(id_hall_152, 7, 7),(id_hall_152, 7, 8),
		(id_hall_153, 1, 1),(id_hall_153, 1, 2),(id_hall_153, 1, 3),(id_hall_153, 1, 4),(id_hall_153, 1, 5),(id_hall_153, 1, 6),(id_hall_153, 1, 7),(id_hall_153, 1, 8),
		(id_hall_153, 2, 1),(id_hall_153, 2, 2),(id_hall_153, 2, 3),(id_hall_153, 2, 4),(id_hall_153, 2, 5),(id_hall_153, 2, 6),(id_hall_153, 2, 7),(id_hall_153, 2, 8),
		(id_hall_153, 3, 1),(id_hall_153, 3, 2),(id_hall_153, 3, 3),(id_hall_153, 3, 4),(id_hall_153, 3, 5),(id_hall_153, 3, 6),(id_hall_153, 3, 7),(id_hall_153, 3, 8),
		(id_hall_153, 4, 1),(id_hall_153, 4, 2),(id_hall_153, 4, 3),(id_hall_153, 4, 4),(id_hall_153, 4, 5),(id_hall_153, 4, 6),(id_hall_153, 4, 7),(id_hall_153, 4, 8),
		(id_hall_153, 5, 1),(id_hall_153, 5, 2),(id_hall_153, 5, 3),(id_hall_153, 5, 4),(id_hall_153, 5, 5),(id_hall_153, 5, 6),(id_hall_153, 5, 7),(id_hall_153, 5, 8),
		(id_hall_153, 6, 1),(id_hall_153, 6, 2),(id_hall_153, 6, 3),(id_hall_153, 6, 4),(id_hall_153, 6, 5),(id_hall_153, 6, 6),(id_hall_153, 6, 7),(id_hall_153, 6, 8),
		(id_hall_153, 7, 1),(id_hall_153, 7, 2),(id_hall_153, 7, 3),(id_hall_153, 7, 4),(id_hall_153, 7, 5),(id_hall_153, 7, 6),(id_hall_153, 7, 7),(id_hall_153, 7, 8),
		(id_hall_154, 1, 1),(id_hall_154, 1, 2),(id_hall_154, 1, 3),(id_hall_154, 1, 4),(id_hall_154, 1, 5),(id_hall_154, 1, 6),(id_hall_154, 1, 7),(id_hall_154, 1, 8),
		(id_hall_154, 2, 1),(id_hall_154, 2, 2),(id_hall_154, 2, 3),(id_hall_154, 2, 4),(id_hall_154, 2, 5),(id_hall_154, 2, 6),(id_hall_154, 2, 7),(id_hall_154, 2, 8),
		(id_hall_154, 3, 1),(id_hall_154, 3, 2),(id_hall_154, 3, 3),(id_hall_154, 3, 4),(id_hall_154, 3, 5),(id_hall_154, 3, 6),(id_hall_154, 3, 7),(id_hall_154, 3, 8),
		(id_hall_154, 4, 1),(id_hall_154, 4, 2),(id_hall_154, 4, 3),(id_hall_154, 4, 4),(id_hall_154, 4, 5),(id_hall_154, 4, 6),(id_hall_154, 4, 7),(id_hall_154, 4, 8),
		(id_hall_154, 5, 1),(id_hall_154, 5, 2),(id_hall_154, 5, 3),(id_hall_154, 5, 4),(id_hall_154, 5, 5),(id_hall_154, 5, 6),(id_hall_154, 5, 7),(id_hall_154, 5, 8),
		(id_hall_154, 6, 1),(id_hall_154, 6, 2),(id_hall_154, 6, 3),(id_hall_154, 6, 4),(id_hall_154, 6, 5),(id_hall_154, 6, 6),(id_hall_154, 6, 7),(id_hall_154, 6, 8),
		(id_hall_154, 7, 1),(id_hall_154, 7, 2),(id_hall_154, 7, 3),(id_hall_154, 7, 4),(id_hall_154, 7, 5),(id_hall_154, 7, 6),(id_hall_154, 7, 7),(id_hall_154, 7, 8),
		(id_hall_155, 1, 1),(id_hall_155, 1, 2),(id_hall_155, 1, 3),(id_hall_155, 1, 4),(id_hall_155, 1, 5),(id_hall_155, 1, 6),(id_hall_155, 1, 7),(id_hall_155, 1, 8),
		(id_hall_155, 2, 1),(id_hall_155, 2, 2),(id_hall_155, 2, 3),(id_hall_155, 2, 4),(id_hall_155, 2, 5),(id_hall_155, 2, 6),(id_hall_155, 2, 7),(id_hall_155, 2, 8),
		(id_hall_155, 3, 1),(id_hall_155, 3, 2),(id_hall_155, 3, 3),(id_hall_155, 3, 4),(id_hall_155, 3, 5),(id_hall_155, 3, 6),(id_hall_155, 3, 7),(id_hall_155, 3, 8),
		(id_hall_155, 4, 1),(id_hall_155, 4, 2),(id_hall_155, 4, 3),(id_hall_155, 4, 4),(id_hall_155, 4, 5),(id_hall_155, 4, 6),(id_hall_155, 4, 7),(id_hall_155, 4, 8),
		(id_hall_155, 5, 1),(id_hall_155, 5, 2),(id_hall_155, 5, 3),(id_hall_155, 5, 4),(id_hall_155, 5, 5),(id_hall_155, 5, 6),(id_hall_155, 5, 7),(id_hall_155, 5, 8),
		(id_hall_155, 6, 1),(id_hall_155, 6, 2),(id_hall_155, 6, 3),(id_hall_155, 6, 4),(id_hall_155, 6, 5),(id_hall_155, 6, 6),(id_hall_155, 6, 7),(id_hall_155, 6, 8),
		(id_hall_155, 7, 1),(id_hall_155, 7, 2),(id_hall_155, 7, 3),(id_hall_155, 7, 4),(id_hall_155, 7, 5),(id_hall_155, 7, 6),(id_hall_155, 7, 7),(id_hall_155, 7, 8),
		(id_hall_156, 1, 1),(id_hall_156, 1, 2),(id_hall_156, 1, 3),(id_hall_156, 1, 4),(id_hall_156, 1, 5),(id_hall_156, 1, 6),(id_hall_156, 1, 7),(id_hall_156, 1, 8),
		(id_hall_156, 2, 1),(id_hall_156, 2, 2),(id_hall_156, 2, 3),(id_hall_156, 2, 4),(id_hall_156, 2, 5),(id_hall_156, 2, 6),(id_hall_156, 2, 7),(id_hall_156, 2, 8),
		(id_hall_156, 3, 1),(id_hall_156, 3, 2),(id_hall_156, 3, 3),(id_hall_156, 3, 4),(id_hall_156, 3, 5),(id_hall_156, 3, 6),(id_hall_156, 3, 7),(id_hall_156, 3, 8),
		(id_hall_156, 4, 1),(id_hall_156, 4, 2),(id_hall_156, 4, 3),(id_hall_156, 4, 4),(id_hall_156, 4, 5),(id_hall_156, 4, 6),(id_hall_156, 4, 7),(id_hall_156, 4, 8),
		(id_hall_156, 5, 1),(id_hall_156, 5, 2),(id_hall_156, 5, 3),(id_hall_156, 5, 4),(id_hall_156, 5, 5),(id_hall_156, 5, 6),(id_hall_156, 5, 7),(id_hall_156, 5, 8),
		(id_hall_156, 6, 1),(id_hall_156, 6, 2),(id_hall_156, 6, 3),(id_hall_156, 6, 4),(id_hall_156, 6, 5),(id_hall_156, 6, 6),(id_hall_156, 6, 7),(id_hall_156, 6, 8),
		(id_hall_156, 7, 1),(id_hall_156, 7, 2),(id_hall_156, 7, 3),(id_hall_156, 7, 4),(id_hall_156, 7, 5),(id_hall_156, 7, 6),(id_hall_156, 7, 7),(id_hall_156, 7, 8),
		(id_hall_157, 1, 1),(id_hall_157, 1, 2),(id_hall_157, 1, 3),(id_hall_157, 1, 4),(id_hall_157, 1, 5),(id_hall_157, 1, 6),(id_hall_157, 1, 7),(id_hall_157, 1, 8),
		(id_hall_157, 2, 1),(id_hall_157, 2, 2),(id_hall_157, 2, 3),(id_hall_157, 2, 4),(id_hall_157, 2, 5),(id_hall_157, 2, 6),(id_hall_157, 2, 7),(id_hall_157, 2, 8),
		(id_hall_157, 3, 1),(id_hall_157, 3, 2),(id_hall_157, 3, 3),(id_hall_157, 3, 4),(id_hall_157, 3, 5),(id_hall_157, 3, 6),(id_hall_157, 3, 7),(id_hall_157, 3, 8),
		(id_hall_157, 4, 1),(id_hall_157, 4, 2),(id_hall_157, 4, 3),(id_hall_157, 4, 4),(id_hall_157, 4, 5),(id_hall_157, 4, 6),(id_hall_157, 4, 7),(id_hall_157, 4, 8),
		(id_hall_157, 5, 1),(id_hall_157, 5, 2),(id_hall_157, 5, 3),(id_hall_157, 5, 4),(id_hall_157, 5, 5),(id_hall_157, 5, 6),(id_hall_157, 5, 7),(id_hall_157, 5, 8),
		(id_hall_157, 6, 1),(id_hall_157, 6, 2),(id_hall_157, 6, 3),(id_hall_157, 6, 4),(id_hall_157, 6, 5),(id_hall_157, 6, 6),(id_hall_157, 6, 7),(id_hall_157, 6, 8),
		(id_hall_157, 7, 1),(id_hall_157, 7, 2),(id_hall_157, 7, 3),(id_hall_157, 7, 4),(id_hall_157, 7, 5),(id_hall_157, 7, 6),(id_hall_157, 7, 7),(id_hall_157, 7, 8),
		(id_hall_158, 1, 1),(id_hall_158, 1, 2),(id_hall_158, 1, 3),(id_hall_158, 1, 4),(id_hall_158, 1, 5),(id_hall_158, 1, 6),(id_hall_158, 1, 7),(id_hall_158, 1, 8),
		(id_hall_158, 2, 1),(id_hall_158, 2, 2),(id_hall_158, 2, 3),(id_hall_158, 2, 4),(id_hall_158, 2, 5),(id_hall_158, 2, 6),(id_hall_158, 2, 7),(id_hall_158, 2, 8),
		(id_hall_158, 3, 1),(id_hall_158, 3, 2),(id_hall_158, 3, 3),(id_hall_158, 3, 4),(id_hall_158, 3, 5),(id_hall_158, 3, 6),(id_hall_158, 3, 7),(id_hall_158, 3, 8),
		(id_hall_158, 4, 1),(id_hall_158, 4, 2),(id_hall_158, 4, 3),(id_hall_158, 4, 4),(id_hall_158, 4, 5),(id_hall_158, 4, 6),(id_hall_158, 4, 7),(id_hall_158, 4, 8),
		(id_hall_158, 5, 1),(id_hall_158, 5, 2),(id_hall_158, 5, 3),(id_hall_158, 5, 4),(id_hall_158, 5, 5),(id_hall_158, 5, 6),(id_hall_158, 5, 7),(id_hall_158, 5, 8),
		(id_hall_158, 6, 1),(id_hall_158, 6, 2),(id_hall_158, 6, 3),(id_hall_158, 6, 4),(id_hall_158, 6, 5),(id_hall_158, 6, 6),(id_hall_158, 6, 7),(id_hall_158, 6, 8),
		(id_hall_158, 7, 1),(id_hall_158, 7, 2),(id_hall_158, 7, 3),(id_hall_158, 7, 4),(id_hall_158, 7, 5),(id_hall_158, 7, 6),(id_hall_158, 7, 7),(id_hall_158, 7, 8),
		(id_hall_159, 1, 1),(id_hall_159, 1, 2),(id_hall_159, 1, 3),(id_hall_159, 1, 4),(id_hall_159, 1, 5),(id_hall_159, 1, 6),(id_hall_159, 1, 7),(id_hall_159, 1, 8),
		(id_hall_159, 2, 1),(id_hall_159, 2, 2),(id_hall_159, 2, 3),(id_hall_159, 2, 4),(id_hall_159, 2, 5),(id_hall_159, 2, 6),(id_hall_159, 2, 7),(id_hall_159, 2, 8),
		(id_hall_159, 3, 1),(id_hall_159, 3, 2),(id_hall_159, 3, 3),(id_hall_159, 3, 4),(id_hall_159, 3, 5),(id_hall_159, 3, 6),(id_hall_159, 3, 7),(id_hall_159, 3, 8),
		(id_hall_159, 4, 1),(id_hall_159, 4, 2),(id_hall_159, 4, 3),(id_hall_159, 4, 4),(id_hall_159, 4, 5),(id_hall_159, 4, 6),(id_hall_159, 4, 7),(id_hall_159, 4, 8),
		(id_hall_159, 5, 1),(id_hall_159, 5, 2),(id_hall_159, 5, 3),(id_hall_159, 5, 4),(id_hall_159, 5, 5),(id_hall_159, 5, 6),(id_hall_159, 5, 7),(id_hall_159, 5, 8),
		(id_hall_159, 6, 1),(id_hall_159, 6, 2),(id_hall_159, 6, 3),(id_hall_159, 6, 4),(id_hall_159, 6, 5),(id_hall_159, 6, 6),(id_hall_159, 6, 7),(id_hall_159, 6, 8),
		(id_hall_159, 7, 1),(id_hall_159, 7, 2),(id_hall_159, 7, 3),(id_hall_159, 7, 4),(id_hall_159, 7, 5),(id_hall_159, 7, 6),(id_hall_159, 7, 7),(id_hall_159, 7, 8),
		(id_hall_160, 1, 1),(id_hall_160, 1, 2),(id_hall_160, 1, 3),(id_hall_160, 1, 4),(id_hall_160, 1, 5),(id_hall_160, 1, 6),(id_hall_160, 1, 7),(id_hall_160, 1, 8),
		(id_hall_160, 2, 1),(id_hall_160, 2, 2),(id_hall_160, 2, 3),(id_hall_160, 2, 4),(id_hall_160, 2, 5),(id_hall_160, 2, 6),(id_hall_160, 2, 7),(id_hall_160, 2, 8),
		(id_hall_160, 3, 1),(id_hall_160, 3, 2),(id_hall_160, 3, 3),(id_hall_160, 3, 4),(id_hall_160, 3, 5),(id_hall_160, 3, 6),(id_hall_160, 3, 7),(id_hall_160, 3, 8),
		(id_hall_160, 4, 1),(id_hall_160, 4, 2),(id_hall_160, 4, 3),(id_hall_160, 4, 4),(id_hall_160, 4, 5),(id_hall_160, 4, 6),(id_hall_160, 4, 7),(id_hall_160, 4, 8),
		(id_hall_160, 5, 1),(id_hall_160, 5, 2),(id_hall_160, 5, 3),(id_hall_160, 5, 4),(id_hall_160, 5, 5),(id_hall_160, 5, 6),(id_hall_160, 5, 7),(id_hall_160, 5, 8),
		(id_hall_160, 6, 1),(id_hall_160, 6, 2),(id_hall_160, 6, 3),(id_hall_160, 6, 4),(id_hall_160, 6, 5),(id_hall_160, 6, 6),(id_hall_160, 6, 7),(id_hall_160, 6, 8),
		(id_hall_160, 7, 1),(id_hall_160, 7, 2),(id_hall_160, 7, 3),(id_hall_160, 7, 4),(id_hall_160, 7, 5),(id_hall_160, 7, 6),(id_hall_160, 7, 7),(id_hall_160, 7, 8),
		(id_hall_161, 1, 1),(id_hall_161, 1, 2),(id_hall_161, 1, 3),(id_hall_161, 1, 4),(id_hall_161, 1, 5),(id_hall_161, 1, 6),(id_hall_161, 1, 7),(id_hall_161, 1, 8),
		(id_hall_161, 2, 1),(id_hall_161, 2, 2),(id_hall_161, 2, 3),(id_hall_161, 2, 4),(id_hall_161, 2, 5),(id_hall_161, 2, 6),(id_hall_161, 2, 7),(id_hall_161, 2, 8),
		(id_hall_161, 3, 1),(id_hall_161, 3, 2),(id_hall_161, 3, 3),(id_hall_161, 3, 4),(id_hall_161, 3, 5),(id_hall_161, 3, 6),(id_hall_161, 3, 7),(id_hall_161, 3, 8),
		(id_hall_161, 4, 1),(id_hall_161, 4, 2),(id_hall_161, 4, 3),(id_hall_161, 4, 4),(id_hall_161, 4, 5),(id_hall_161, 4, 6),(id_hall_161, 4, 7),(id_hall_161, 4, 8),
		(id_hall_161, 5, 1),(id_hall_161, 5, 2),(id_hall_161, 5, 3),(id_hall_161, 5, 4),(id_hall_161, 5, 5),(id_hall_161, 5, 6),(id_hall_161, 5, 7),(id_hall_161, 5, 8),
		(id_hall_161, 6, 1),(id_hall_161, 6, 2),(id_hall_161, 6, 3),(id_hall_161, 6, 4),(id_hall_161, 6, 5),(id_hall_161, 6, 6),(id_hall_161, 6, 7),(id_hall_161, 6, 8),
		(id_hall_161, 7, 1),(id_hall_161, 7, 2),(id_hall_161, 7, 3),(id_hall_161, 7, 4),(id_hall_161, 7, 5),(id_hall_161, 7, 6),(id_hall_161, 7, 7),(id_hall_161, 7, 8),
		(id_hall_162, 1, 1),(id_hall_162, 1, 2),(id_hall_162, 1, 3),(id_hall_162, 1, 4),(id_hall_162, 1, 5),(id_hall_162, 1, 6),(id_hall_162, 1, 7),(id_hall_162, 1, 8),
		(id_hall_162, 2, 1),(id_hall_162, 2, 2),(id_hall_162, 2, 3),(id_hall_162, 2, 4),(id_hall_162, 2, 5),(id_hall_162, 2, 6),(id_hall_162, 2, 7),(id_hall_162, 2, 8),
		(id_hall_162, 3, 1),(id_hall_162, 3, 2),(id_hall_162, 3, 3),(id_hall_162, 3, 4),(id_hall_162, 3, 5),(id_hall_162, 3, 6),(id_hall_162, 3, 7),(id_hall_162, 3, 8),
		(id_hall_162, 4, 1),(id_hall_162, 4, 2),(id_hall_162, 4, 3),(id_hall_162, 4, 4),(id_hall_162, 4, 5),(id_hall_162, 4, 6),(id_hall_162, 4, 7),(id_hall_162, 4, 8),
		(id_hall_162, 5, 1),(id_hall_162, 5, 2),(id_hall_162, 5, 3),(id_hall_162, 5, 4),(id_hall_162, 5, 5),(id_hall_162, 5, 6),(id_hall_162, 5, 7),(id_hall_162, 5, 8),
		(id_hall_162, 6, 1),(id_hall_162, 6, 2),(id_hall_162, 6, 3),(id_hall_162, 6, 4),(id_hall_162, 6, 5),(id_hall_162, 6, 6),(id_hall_162, 6, 7),(id_hall_162, 6, 8),
		(id_hall_162, 7, 1),(id_hall_162, 7, 2),(id_hall_162, 7, 3),(id_hall_162, 7, 4),(id_hall_162, 7, 5),(id_hall_162, 7, 6),(id_hall_162, 7, 7),(id_hall_162, 7, 8),
		(id_hall_163, 1, 1),(id_hall_163, 1, 2),(id_hall_163, 1, 3),(id_hall_163, 1, 4),(id_hall_163, 1, 5),(id_hall_163, 1, 6),(id_hall_163, 1, 7),(id_hall_163, 1, 8),
		(id_hall_163, 2, 1),(id_hall_163, 2, 2),(id_hall_163, 2, 3),(id_hall_163, 2, 4),(id_hall_163, 2, 5),(id_hall_163, 2, 6),(id_hall_163, 2, 7),(id_hall_163, 2, 8),
		(id_hall_163, 3, 1),(id_hall_163, 3, 2),(id_hall_163, 3, 3),(id_hall_163, 3, 4),(id_hall_163, 3, 5),(id_hall_163, 3, 6),(id_hall_163, 3, 7),(id_hall_163, 3, 8),
		(id_hall_163, 4, 1),(id_hall_163, 4, 2),(id_hall_163, 4, 3),(id_hall_163, 4, 4),(id_hall_163, 4, 5),(id_hall_163, 4, 6),(id_hall_163, 4, 7),(id_hall_163, 4, 8),
		(id_hall_163, 5, 1),(id_hall_163, 5, 2),(id_hall_163, 5, 3),(id_hall_163, 5, 4),(id_hall_163, 5, 5),(id_hall_163, 5, 6),(id_hall_163, 5, 7),(id_hall_163, 5, 8),
		(id_hall_163, 6, 1),(id_hall_163, 6, 2),(id_hall_163, 6, 3),(id_hall_163, 6, 4),(id_hall_163, 6, 5),(id_hall_163, 6, 6),(id_hall_163, 6, 7),(id_hall_163, 6, 8),
		(id_hall_163, 7, 1),(id_hall_163, 7, 2),(id_hall_163, 7, 3),(id_hall_163, 7, 4),(id_hall_163, 7, 5),(id_hall_163, 7, 6),(id_hall_163, 7, 7),(id_hall_163, 7, 8),
		(id_hall_164, 1, 1),(id_hall_164, 1, 2),(id_hall_164, 1, 3),(id_hall_164, 1, 4),(id_hall_164, 1, 5),(id_hall_164, 1, 6),(id_hall_164, 1, 7),(id_hall_164, 1, 8),
		(id_hall_164, 2, 1),(id_hall_164, 2, 2),(id_hall_164, 2, 3),(id_hall_164, 2, 4),(id_hall_164, 2, 5),(id_hall_164, 2, 6),(id_hall_164, 2, 7),(id_hall_164, 2, 8),
		(id_hall_164, 3, 1),(id_hall_164, 3, 2),(id_hall_164, 3, 3),(id_hall_164, 3, 4),(id_hall_164, 3, 5),(id_hall_164, 3, 6),(id_hall_164, 3, 7),(id_hall_164, 3, 8),
		(id_hall_164, 4, 1),(id_hall_164, 4, 2),(id_hall_164, 4, 3),(id_hall_164, 4, 4),(id_hall_164, 4, 5),(id_hall_164, 4, 6),(id_hall_164, 4, 7),(id_hall_164, 4, 8),
		(id_hall_164, 5, 1),(id_hall_164, 5, 2),(id_hall_164, 5, 3),(id_hall_164, 5, 4),(id_hall_164, 5, 5),(id_hall_164, 5, 6),(id_hall_164, 5, 7),(id_hall_164, 5, 8),
		(id_hall_164, 6, 1),(id_hall_164, 6, 2),(id_hall_164, 6, 3),(id_hall_164, 6, 4),(id_hall_164, 6, 5),(id_hall_164, 6, 6),(id_hall_164, 6, 7),(id_hall_164, 6, 8),
		(id_hall_164, 7, 1),(id_hall_164, 7, 2),(id_hall_164, 7, 3),(id_hall_164, 7, 4),(id_hall_164, 7, 5),(id_hall_164, 7, 6),(id_hall_164, 7, 7),(id_hall_164, 7, 8),
		(id_hall_165, 1, 1),(id_hall_165, 1, 2),(id_hall_165, 1, 3),(id_hall_165, 1, 4),(id_hall_165, 1, 5),(id_hall_165, 1, 6),(id_hall_165, 1, 7),(id_hall_165, 1, 8),
		(id_hall_165, 2, 1),(id_hall_165, 2, 2),(id_hall_165, 2, 3),(id_hall_165, 2, 4),(id_hall_165, 2, 5),(id_hall_165, 2, 6),(id_hall_165, 2, 7),(id_hall_165, 2, 8),
		(id_hall_165, 3, 1),(id_hall_165, 3, 2),(id_hall_165, 3, 3),(id_hall_165, 3, 4),(id_hall_165, 3, 5),(id_hall_165, 3, 6),(id_hall_165, 3, 7),(id_hall_165, 3, 8),
		(id_hall_165, 4, 1),(id_hall_165, 4, 2),(id_hall_165, 4, 3),(id_hall_165, 4, 4),(id_hall_165, 4, 5),(id_hall_165, 4, 6),(id_hall_165, 4, 7),(id_hall_165, 4, 8),
		(id_hall_165, 5, 1),(id_hall_165, 5, 2),(id_hall_165, 5, 3),(id_hall_165, 5, 4),(id_hall_165, 5, 5),(id_hall_165, 5, 6),(id_hall_165, 5, 7),(id_hall_165, 5, 8),
		(id_hall_165, 6, 1),(id_hall_165, 6, 2),(id_hall_165, 6, 3),(id_hall_165, 6, 4),(id_hall_165, 6, 5),(id_hall_165, 6, 6),(id_hall_165, 6, 7),(id_hall_165, 6, 8),
		(id_hall_165, 7, 1),(id_hall_165, 7, 2),(id_hall_165, 7, 3),(id_hall_165, 7, 4),(id_hall_165, 7, 5),(id_hall_165, 7, 6),(id_hall_165, 7, 7),(id_hall_165, 7, 8),
		(id_hall_166, 1, 1),(id_hall_166, 1, 2),(id_hall_166, 1, 3),(id_hall_166, 1, 4),(id_hall_166, 1, 5),(id_hall_166, 1, 6),(id_hall_166, 1, 7),(id_hall_166, 1, 8),
		(id_hall_166, 2, 1),(id_hall_166, 2, 2),(id_hall_166, 2, 3),(id_hall_166, 2, 4),(id_hall_166, 2, 5),(id_hall_166, 2, 6),(id_hall_166, 2, 7),(id_hall_166, 2, 8),
		(id_hall_166, 3, 1),(id_hall_166, 3, 2),(id_hall_166, 3, 3),(id_hall_166, 3, 4),(id_hall_166, 3, 5),(id_hall_166, 3, 6),(id_hall_166, 3, 7),(id_hall_166, 3, 8),
		(id_hall_166, 4, 1),(id_hall_166, 4, 2),(id_hall_166, 4, 3),(id_hall_166, 4, 4),(id_hall_166, 4, 5),(id_hall_166, 4, 6),(id_hall_166, 4, 7),(id_hall_166, 4, 8),
		(id_hall_166, 5, 1),(id_hall_166, 5, 2),(id_hall_166, 5, 3),(id_hall_166, 5, 4),(id_hall_166, 5, 5),(id_hall_166, 5, 6),(id_hall_166, 5, 7),(id_hall_166, 5, 8),
		(id_hall_166, 6, 1),(id_hall_166, 6, 2),(id_hall_166, 6, 3),(id_hall_166, 6, 4),(id_hall_166, 6, 5),(id_hall_166, 6, 6),(id_hall_166, 6, 7),(id_hall_166, 6, 8),
		(id_hall_166, 7, 1),(id_hall_166, 7, 2),(id_hall_166, 7, 3),(id_hall_166, 7, 4),(id_hall_166, 7, 5),(id_hall_166, 7, 6),(id_hall_166, 7, 7),(id_hall_166, 7, 8),
		(id_hall_167, 1, 1),(id_hall_167, 1, 2),(id_hall_167, 1, 3),(id_hall_167, 1, 4),(id_hall_167, 1, 5),(id_hall_167, 1, 6),(id_hall_167, 1, 7),(id_hall_167, 1, 8),
		(id_hall_167, 2, 1),(id_hall_167, 2, 2),(id_hall_167, 2, 3),(id_hall_167, 2, 4),(id_hall_167, 2, 5),(id_hall_167, 2, 6),(id_hall_167, 2, 7),(id_hall_167, 2, 8),
		(id_hall_167, 3, 1),(id_hall_167, 3, 2),(id_hall_167, 3, 3),(id_hall_167, 3, 4),(id_hall_167, 3, 5),(id_hall_167, 3, 6),(id_hall_167, 3, 7),(id_hall_167, 3, 8),
		(id_hall_167, 4, 1),(id_hall_167, 4, 2),(id_hall_167, 4, 3),(id_hall_167, 4, 4),(id_hall_167, 4, 5),(id_hall_167, 4, 6),(id_hall_167, 4, 7),(id_hall_167, 4, 8),
		(id_hall_167, 5, 1),(id_hall_167, 5, 2),(id_hall_167, 5, 3),(id_hall_167, 5, 4),(id_hall_167, 5, 5),(id_hall_167, 5, 6),(id_hall_167, 5, 7),(id_hall_167, 5, 8),
		(id_hall_167, 6, 1),(id_hall_167, 6, 2),(id_hall_167, 6, 3),(id_hall_167, 6, 4),(id_hall_167, 6, 5),(id_hall_167, 6, 6),(id_hall_167, 6, 7),(id_hall_167, 6, 8),
		(id_hall_167, 7, 1),(id_hall_167, 7, 2),(id_hall_167, 7, 3),(id_hall_167, 7, 4),(id_hall_167, 7, 5),(id_hall_167, 7, 6),(id_hall_167, 7, 7),(id_hall_167, 7, 8),
		(id_hall_168, 1, 1),(id_hall_168, 1, 2),(id_hall_168, 1, 3),(id_hall_168, 1, 4),(id_hall_168, 1, 5),(id_hall_168, 1, 6),(id_hall_168, 1, 7),(id_hall_168, 1, 8),
		(id_hall_168, 2, 1),(id_hall_168, 2, 2),(id_hall_168, 2, 3),(id_hall_168, 2, 4),(id_hall_168, 2, 5),(id_hall_168, 2, 6),(id_hall_168, 2, 7),(id_hall_168, 2, 8),
		(id_hall_168, 3, 1),(id_hall_168, 3, 2),(id_hall_168, 3, 3),(id_hall_168, 3, 4),(id_hall_168, 3, 5),(id_hall_168, 3, 6),(id_hall_168, 3, 7),(id_hall_168, 3, 8),
		(id_hall_168, 4, 1),(id_hall_168, 4, 2),(id_hall_168, 4, 3),(id_hall_168, 4, 4),(id_hall_168, 4, 5),(id_hall_168, 4, 6),(id_hall_168, 4, 7),(id_hall_168, 4, 8),
		(id_hall_168, 5, 1),(id_hall_168, 5, 2),(id_hall_168, 5, 3),(id_hall_168, 5, 4),(id_hall_168, 5, 5),(id_hall_168, 5, 6),(id_hall_168, 5, 7),(id_hall_168, 5, 8),
		(id_hall_168, 6, 1),(id_hall_168, 6, 2),(id_hall_168, 6, 3),(id_hall_168, 6, 4),(id_hall_168, 6, 5),(id_hall_168, 6, 6),(id_hall_168, 6, 7),(id_hall_168, 6, 8),
		(id_hall_168, 7, 1),(id_hall_168, 7, 2),(id_hall_168, 7, 3),(id_hall_168, 7, 4),(id_hall_168, 7, 5),(id_hall_168, 7, 6),(id_hall_168, 7, 7),(id_hall_168, 7, 8),
		(id_hall_169, 1, 1),(id_hall_169, 1, 2),(id_hall_169, 1, 3),(id_hall_169, 1, 4),(id_hall_169, 1, 5),(id_hall_169, 1, 6),(id_hall_169, 1, 7),(id_hall_169, 1, 8),
		(id_hall_169, 2, 1),(id_hall_169, 2, 2),(id_hall_169, 2, 3),(id_hall_169, 2, 4),(id_hall_169, 2, 5),(id_hall_169, 2, 6),(id_hall_169, 2, 7),(id_hall_169, 2, 8),
		(id_hall_169, 3, 1),(id_hall_169, 3, 2),(id_hall_169, 3, 3),(id_hall_169, 3, 4),(id_hall_169, 3, 5),(id_hall_169, 3, 6),(id_hall_169, 3, 7),(id_hall_169, 3, 8),
		(id_hall_169, 4, 1),(id_hall_169, 4, 2),(id_hall_169, 4, 3),(id_hall_169, 4, 4),(id_hall_169, 4, 5),(id_hall_169, 4, 6),(id_hall_169, 4, 7),(id_hall_169, 4, 8),
		(id_hall_169, 5, 1),(id_hall_169, 5, 2),(id_hall_169, 5, 3),(id_hall_169, 5, 4),(id_hall_169, 5, 5),(id_hall_169, 5, 6),(id_hall_169, 5, 7),(id_hall_169, 5, 8),
		(id_hall_169, 6, 1),(id_hall_169, 6, 2),(id_hall_169, 6, 3),(id_hall_169, 6, 4),(id_hall_169, 6, 5),(id_hall_169, 6, 6),(id_hall_169, 6, 7),(id_hall_169, 6, 8),
		(id_hall_169, 7, 1),(id_hall_169, 7, 2),(id_hall_169, 7, 3),(id_hall_169, 7, 4),(id_hall_169, 7, 5),(id_hall_169, 7, 6),(id_hall_169, 7, 7),(id_hall_169, 7, 8),
		(id_hall_170, 1, 1),(id_hall_170, 1, 2),(id_hall_170, 1, 3),(id_hall_170, 1, 4),(id_hall_170, 1, 5),(id_hall_170, 1, 6),(id_hall_170, 1, 7),(id_hall_170, 1, 8),
		(id_hall_170, 2, 1),(id_hall_170, 2, 2),(id_hall_170, 2, 3),(id_hall_170, 2, 4),(id_hall_170, 2, 5),(id_hall_170, 2, 6),(id_hall_170, 2, 7),(id_hall_170, 2, 8),
		(id_hall_170, 3, 1),(id_hall_170, 3, 2),(id_hall_170, 3, 3),(id_hall_170, 3, 4),(id_hall_170, 3, 5),(id_hall_170, 3, 6),(id_hall_170, 3, 7),(id_hall_170, 3, 8),
		(id_hall_170, 4, 1),(id_hall_170, 4, 2),(id_hall_170, 4, 3),(id_hall_170, 4, 4),(id_hall_170, 4, 5),(id_hall_170, 4, 6),(id_hall_170, 4, 7),(id_hall_170, 4, 8),
		(id_hall_170, 5, 1),(id_hall_170, 5, 2),(id_hall_170, 5, 3),(id_hall_170, 5, 4),(id_hall_170, 5, 5),(id_hall_170, 5, 6),(id_hall_170, 5, 7),(id_hall_170, 5, 8),
		(id_hall_170, 6, 1),(id_hall_170, 6, 2),(id_hall_170, 6, 3),(id_hall_170, 6, 4),(id_hall_170, 6, 5),(id_hall_170, 6, 6),(id_hall_170, 6, 7),(id_hall_170, 6, 8),
		(id_hall_170, 7, 1),(id_hall_170, 7, 2),(id_hall_170, 7, 3),(id_hall_170, 7, 4),(id_hall_170, 7, 5),(id_hall_170, 7, 6),(id_hall_170, 7, 7),(id_hall_170, 7, 8),
		(id_hall_171, 1, 1),(id_hall_171, 1, 2),(id_hall_171, 1, 3),(id_hall_171, 1, 4),(id_hall_171, 1, 5),(id_hall_171, 1, 6),(id_hall_171, 1, 7),(id_hall_171, 1, 8),
		(id_hall_171, 2, 1),(id_hall_171, 2, 2),(id_hall_171, 2, 3),(id_hall_171, 2, 4),(id_hall_171, 2, 5),(id_hall_171, 2, 6),(id_hall_171, 2, 7),(id_hall_171, 2, 8),
		(id_hall_171, 3, 1),(id_hall_171, 3, 2),(id_hall_171, 3, 3),(id_hall_171, 3, 4),(id_hall_171, 3, 5),(id_hall_171, 3, 6),(id_hall_171, 3, 7),(id_hall_171, 3, 8),
		(id_hall_171, 4, 1),(id_hall_171, 4, 2),(id_hall_171, 4, 3),(id_hall_171, 4, 4),(id_hall_171, 4, 5),(id_hall_171, 4, 6),(id_hall_171, 4, 7),(id_hall_171, 4, 8),
		(id_hall_171, 5, 1),(id_hall_171, 5, 2),(id_hall_171, 5, 3),(id_hall_171, 5, 4),(id_hall_171, 5, 5),(id_hall_171, 5, 6),(id_hall_171, 5, 7),(id_hall_171, 5, 8),
		(id_hall_171, 6, 1),(id_hall_171, 6, 2),(id_hall_171, 6, 3),(id_hall_171, 6, 4),(id_hall_171, 6, 5),(id_hall_171, 6, 6),(id_hall_171, 6, 7),(id_hall_171, 6, 8),
		(id_hall_171, 7, 1),(id_hall_171, 7, 2),(id_hall_171, 7, 3),(id_hall_171, 7, 4),(id_hall_171, 7, 5),(id_hall_171, 7, 6),(id_hall_171, 7, 7),(id_hall_171, 7, 8),
		(id_hall_172, 1, 1),(id_hall_172, 1, 2),(id_hall_172, 1, 3),(id_hall_172, 1, 4),(id_hall_172, 1, 5),(id_hall_172, 1, 6),(id_hall_172, 1, 7),(id_hall_172, 1, 8),
		(id_hall_172, 2, 1),(id_hall_172, 2, 2),(id_hall_172, 2, 3),(id_hall_172, 2, 4),(id_hall_172, 2, 5),(id_hall_172, 2, 6),(id_hall_172, 2, 7),(id_hall_172, 2, 8),
		(id_hall_172, 3, 1),(id_hall_172, 3, 2),(id_hall_172, 3, 3),(id_hall_172, 3, 4),(id_hall_172, 3, 5),(id_hall_172, 3, 6),(id_hall_172, 3, 7),(id_hall_172, 3, 8),
		(id_hall_172, 4, 1),(id_hall_172, 4, 2),(id_hall_172, 4, 3),(id_hall_172, 4, 4),(id_hall_172, 4, 5),(id_hall_172, 4, 6),(id_hall_172, 4, 7),(id_hall_172, 4, 8),
		(id_hall_172, 5, 1),(id_hall_172, 5, 2),(id_hall_172, 5, 3),(id_hall_172, 5, 4),(id_hall_172, 5, 5),(id_hall_172, 5, 6),(id_hall_172, 5, 7),(id_hall_172, 5, 8),
		(id_hall_172, 6, 1),(id_hall_172, 6, 2),(id_hall_172, 6, 3),(id_hall_172, 6, 4),(id_hall_172, 6, 5),(id_hall_172, 6, 6),(id_hall_172, 6, 7),(id_hall_172, 6, 8),
		(id_hall_172, 7, 1),(id_hall_172, 7, 2),(id_hall_172, 7, 3),(id_hall_172, 7, 4),(id_hall_172, 7, 5),(id_hall_172, 7, 6),(id_hall_172, 7, 7),(id_hall_172, 7, 8),
		(id_hall_173, 1, 1),(id_hall_173, 1, 2),(id_hall_173, 1, 3),(id_hall_173, 1, 4),(id_hall_173, 1, 5),(id_hall_173, 1, 6),(id_hall_173, 1, 7),(id_hall_173, 1, 8),
		(id_hall_173, 2, 1),(id_hall_173, 2, 2),(id_hall_173, 2, 3),(id_hall_173, 2, 4),(id_hall_173, 2, 5),(id_hall_173, 2, 6),(id_hall_173, 2, 7),(id_hall_173, 2, 8),
		(id_hall_173, 3, 1),(id_hall_173, 3, 2),(id_hall_173, 3, 3),(id_hall_173, 3, 4),(id_hall_173, 3, 5),(id_hall_173, 3, 6),(id_hall_173, 3, 7),(id_hall_173, 3, 8),
		(id_hall_173, 4, 1),(id_hall_173, 4, 2),(id_hall_173, 4, 3),(id_hall_173, 4, 4),(id_hall_173, 4, 5),(id_hall_173, 4, 6),(id_hall_173, 4, 7),(id_hall_173, 4, 8),
		(id_hall_173, 5, 1),(id_hall_173, 5, 2),(id_hall_173, 5, 3),(id_hall_173, 5, 4),(id_hall_173, 5, 5),(id_hall_173, 5, 6),(id_hall_173, 5, 7),(id_hall_173, 5, 8),
		(id_hall_173, 6, 1),(id_hall_173, 6, 2),(id_hall_173, 6, 3),(id_hall_173, 6, 4),(id_hall_173, 6, 5),(id_hall_173, 6, 6),(id_hall_173, 6, 7),(id_hall_173, 6, 8),
		(id_hall_173, 7, 1),(id_hall_173, 7, 2),(id_hall_173, 7, 3),(id_hall_173, 7, 4),(id_hall_173, 7, 5),(id_hall_173, 7, 6),(id_hall_173, 7, 7),(id_hall_173, 7, 8),
		(id_hall_174, 1, 1),(id_hall_174, 1, 2),(id_hall_174, 1, 3),(id_hall_174, 1, 4),(id_hall_174, 1, 5),(id_hall_174, 1, 6),(id_hall_174, 1, 7),(id_hall_174, 1, 8),
		(id_hall_174, 2, 1),(id_hall_174, 2, 2),(id_hall_174, 2, 3),(id_hall_174, 2, 4),(id_hall_174, 2, 5),(id_hall_174, 2, 6),(id_hall_174, 2, 7),(id_hall_174, 2, 8),
		(id_hall_174, 3, 1),(id_hall_174, 3, 2),(id_hall_174, 3, 3),(id_hall_174, 3, 4),(id_hall_174, 3, 5),(id_hall_174, 3, 6),(id_hall_174, 3, 7),(id_hall_174, 3, 8),
		(id_hall_174, 4, 1),(id_hall_174, 4, 2),(id_hall_174, 4, 3),(id_hall_174, 4, 4),(id_hall_174, 4, 5),(id_hall_174, 4, 6),(id_hall_174, 4, 7),(id_hall_174, 4, 8),
		(id_hall_174, 5, 1),(id_hall_174, 5, 2),(id_hall_174, 5, 3),(id_hall_174, 5, 4),(id_hall_174, 5, 5),(id_hall_174, 5, 6),(id_hall_174, 5, 7),(id_hall_174, 5, 8),
		(id_hall_174, 6, 1),(id_hall_174, 6, 2),(id_hall_174, 6, 3),(id_hall_174, 6, 4),(id_hall_174, 6, 5),(id_hall_174, 6, 6),(id_hall_174, 6, 7),(id_hall_174, 6, 8),
		(id_hall_174, 7, 1),(id_hall_174, 7, 2),(id_hall_174, 7, 3),(id_hall_174, 7, 4),(id_hall_174, 7, 5),(id_hall_174, 7, 6),(id_hall_174, 7, 7),(id_hall_174, 7, 8),
		(id_hall_175, 1, 1),(id_hall_175, 1, 2),(id_hall_175, 1, 3),(id_hall_175, 1, 4),(id_hall_175, 1, 5),(id_hall_175, 1, 6),(id_hall_175, 1, 7),(id_hall_175, 1, 8),
		(id_hall_175, 2, 1),(id_hall_175, 2, 2),(id_hall_175, 2, 3),(id_hall_175, 2, 4),(id_hall_175, 2, 5),(id_hall_175, 2, 6),(id_hall_175, 2, 7),(id_hall_175, 2, 8),
		(id_hall_175, 3, 1),(id_hall_175, 3, 2),(id_hall_175, 3, 3),(id_hall_175, 3, 4),(id_hall_175, 3, 5),(id_hall_175, 3, 6),(id_hall_175, 3, 7),(id_hall_175, 3, 8),
		(id_hall_175, 4, 1),(id_hall_175, 4, 2),(id_hall_175, 4, 3),(id_hall_175, 4, 4),(id_hall_175, 4, 5),(id_hall_175, 4, 6),(id_hall_175, 4, 7),(id_hall_175, 4, 8),
		(id_hall_175, 5, 1),(id_hall_175, 5, 2),(id_hall_175, 5, 3),(id_hall_175, 5, 4),(id_hall_175, 5, 5),(id_hall_175, 5, 6),(id_hall_175, 5, 7),(id_hall_175, 5, 8),
		(id_hall_175, 6, 1),(id_hall_175, 6, 2),(id_hall_175, 6, 3),(id_hall_175, 6, 4),(id_hall_175, 6, 5),(id_hall_175, 6, 6),(id_hall_175, 6, 7),(id_hall_175, 6, 8),
		(id_hall_175, 7, 1),(id_hall_175, 7, 2),(id_hall_175, 7, 3),(id_hall_175, 7, 4),(id_hall_175, 7, 5),(id_hall_175, 7, 6),(id_hall_175, 7, 7),(id_hall_175, 7, 8),
		(id_hall_176, 1, 1),(id_hall_176, 1, 2),(id_hall_176, 1, 3),(id_hall_176, 1, 4),(id_hall_176, 1, 5),(id_hall_176, 1, 6),(id_hall_176, 1, 7),(id_hall_176, 1, 8),
		(id_hall_176, 2, 1),(id_hall_176, 2, 2),(id_hall_176, 2, 3),(id_hall_176, 2, 4),(id_hall_176, 2, 5),(id_hall_176, 2, 6),(id_hall_176, 2, 7),(id_hall_176, 2, 8),
		(id_hall_176, 3, 1),(id_hall_176, 3, 2),(id_hall_176, 3, 3),(id_hall_176, 3, 4),(id_hall_176, 3, 5),(id_hall_176, 3, 6),(id_hall_176, 3, 7),(id_hall_176, 3, 8),
		(id_hall_176, 4, 1),(id_hall_176, 4, 2),(id_hall_176, 4, 3),(id_hall_176, 4, 4),(id_hall_176, 4, 5),(id_hall_176, 4, 6),(id_hall_176, 4, 7),(id_hall_176, 4, 8),
		(id_hall_176, 5, 1),(id_hall_176, 5, 2),(id_hall_176, 5, 3),(id_hall_176, 5, 4),(id_hall_176, 5, 5),(id_hall_176, 5, 6),(id_hall_176, 5, 7),(id_hall_176, 5, 8),
		(id_hall_176, 6, 1),(id_hall_176, 6, 2),(id_hall_176, 6, 3),(id_hall_176, 6, 4),(id_hall_176, 6, 5),(id_hall_176, 6, 6),(id_hall_176, 6, 7),(id_hall_176, 6, 8),
		(id_hall_176, 7, 1),(id_hall_176, 7, 2),(id_hall_176, 7, 3),(id_hall_176, 7, 4),(id_hall_176, 7, 5),(id_hall_176, 7, 6),(id_hall_176, 7, 7),(id_hall_176, 7, 8),
		(id_hall_177, 1, 1),(id_hall_177, 1, 2),(id_hall_177, 1, 3),(id_hall_177, 1, 4),(id_hall_177, 1, 5),(id_hall_177, 1, 6),(id_hall_177, 1, 7),(id_hall_177, 1, 8),
		(id_hall_177, 2, 1),(id_hall_177, 2, 2),(id_hall_177, 2, 3),(id_hall_177, 2, 4),(id_hall_177, 2, 5),(id_hall_177, 2, 6),(id_hall_177, 2, 7),(id_hall_177, 2, 8),
		(id_hall_177, 3, 1),(id_hall_177, 3, 2),(id_hall_177, 3, 3),(id_hall_177, 3, 4),(id_hall_177, 3, 5),(id_hall_177, 3, 6),(id_hall_177, 3, 7),(id_hall_177, 3, 8),
		(id_hall_177, 4, 1),(id_hall_177, 4, 2),(id_hall_177, 4, 3),(id_hall_177, 4, 4),(id_hall_177, 4, 5),(id_hall_177, 4, 6),(id_hall_177, 4, 7),(id_hall_177, 4, 8),
		(id_hall_177, 5, 1),(id_hall_177, 5, 2),(id_hall_177, 5, 3),(id_hall_177, 5, 4),(id_hall_177, 5, 5),(id_hall_177, 5, 6),(id_hall_177, 5, 7),(id_hall_177, 5, 8),
		(id_hall_177, 6, 1),(id_hall_177, 6, 2),(id_hall_177, 6, 3),(id_hall_177, 6, 4),(id_hall_177, 6, 5),(id_hall_177, 6, 6),(id_hall_177, 6, 7),(id_hall_177, 6, 8),
		(id_hall_177, 7, 1),(id_hall_177, 7, 2),(id_hall_177, 7, 3),(id_hall_177, 7, 4),(id_hall_177, 7, 5),(id_hall_177, 7, 6),(id_hall_177, 7, 7),(id_hall_177, 7, 8),
		(id_hall_178, 1, 1),(id_hall_178, 1, 2),(id_hall_178, 1, 3),(id_hall_178, 1, 4),(id_hall_178, 1, 5),(id_hall_178, 1, 6),(id_hall_178, 1, 7),(id_hall_178, 1, 8),
		(id_hall_178, 2, 1),(id_hall_178, 2, 2),(id_hall_178, 2, 3),(id_hall_178, 2, 4),(id_hall_178, 2, 5),(id_hall_178, 2, 6),(id_hall_178, 2, 7),(id_hall_178, 2, 8),
		(id_hall_178, 3, 1),(id_hall_178, 3, 2),(id_hall_178, 3, 3),(id_hall_178, 3, 4),(id_hall_178, 3, 5),(id_hall_178, 3, 6),(id_hall_178, 3, 7),(id_hall_178, 3, 8),
		(id_hall_178, 4, 1),(id_hall_178, 4, 2),(id_hall_178, 4, 3),(id_hall_178, 4, 4),(id_hall_178, 4, 5),(id_hall_178, 4, 6),(id_hall_178, 4, 7),(id_hall_178, 4, 8),
		(id_hall_178, 5, 1),(id_hall_178, 5, 2),(id_hall_178, 5, 3),(id_hall_178, 5, 4),(id_hall_178, 5, 5),(id_hall_178, 5, 6),(id_hall_178, 5, 7),(id_hall_178, 5, 8),
		(id_hall_178, 6, 1),(id_hall_178, 6, 2),(id_hall_178, 6, 3),(id_hall_178, 6, 4),(id_hall_178, 6, 5),(id_hall_178, 6, 6),(id_hall_178, 6, 7),(id_hall_178, 6, 8),
		(id_hall_178, 7, 1),(id_hall_178, 7, 2),(id_hall_178, 7, 3),(id_hall_178, 7, 4),(id_hall_178, 7, 5),(id_hall_178, 7, 6),(id_hall_178, 7, 7),(id_hall_178, 7, 8),
		(id_hall_179, 1, 1),(id_hall_179, 1, 2),(id_hall_179, 1, 3),(id_hall_179, 1, 4),(id_hall_179, 1, 5),(id_hall_179, 1, 6),(id_hall_179, 1, 7),(id_hall_179, 1, 8),
		(id_hall_179, 2, 1),(id_hall_179, 2, 2),(id_hall_179, 2, 3),(id_hall_179, 2, 4),(id_hall_179, 2, 5),(id_hall_179, 2, 6),(id_hall_179, 2, 7),(id_hall_179, 2, 8),
		(id_hall_179, 3, 1),(id_hall_179, 3, 2),(id_hall_179, 3, 3),(id_hall_179, 3, 4),(id_hall_179, 3, 5),(id_hall_179, 3, 6),(id_hall_179, 3, 7),(id_hall_179, 3, 8),
		(id_hall_179, 4, 1),(id_hall_179, 4, 2),(id_hall_179, 4, 3),(id_hall_179, 4, 4),(id_hall_179, 4, 5),(id_hall_179, 4, 6),(id_hall_179, 4, 7),(id_hall_179, 4, 8),
		(id_hall_179, 5, 1),(id_hall_179, 5, 2),(id_hall_179, 5, 3),(id_hall_179, 5, 4),(id_hall_179, 5, 5),(id_hall_179, 5, 6),(id_hall_179, 5, 7),(id_hall_179, 5, 8),
		(id_hall_179, 6, 1),(id_hall_179, 6, 2),(id_hall_179, 6, 3),(id_hall_179, 6, 4),(id_hall_179, 6, 5),(id_hall_179, 6, 6),(id_hall_179, 6, 7),(id_hall_179, 6, 8),
		(id_hall_179, 7, 1),(id_hall_179, 7, 2),(id_hall_179, 7, 3),(id_hall_179, 7, 4),(id_hall_179, 7, 5),(id_hall_179, 7, 6),(id_hall_179, 7, 7),(id_hall_179, 7, 8),
		(id_hall_180, 1, 1),(id_hall_180, 1, 2),(id_hall_180, 1, 3),(id_hall_180, 1, 4),(id_hall_180, 1, 5),(id_hall_180, 1, 6),(id_hall_180, 1, 7),(id_hall_180, 1, 8),
		(id_hall_180, 2, 1),(id_hall_180, 2, 2),(id_hall_180, 2, 3),(id_hall_180, 2, 4),(id_hall_180, 2, 5),(id_hall_180, 2, 6),(id_hall_180, 2, 7),(id_hall_180, 2, 8),
		(id_hall_180, 3, 1),(id_hall_180, 3, 2),(id_hall_180, 3, 3),(id_hall_180, 3, 4),(id_hall_180, 3, 5),(id_hall_180, 3, 6),(id_hall_180, 3, 7),(id_hall_180, 3, 8),
		(id_hall_180, 4, 1),(id_hall_180, 4, 2),(id_hall_180, 4, 3),(id_hall_180, 4, 4),(id_hall_180, 4, 5),(id_hall_180, 4, 6),(id_hall_180, 4, 7),(id_hall_180, 4, 8),
		(id_hall_180, 5, 1),(id_hall_180, 5, 2),(id_hall_180, 5, 3),(id_hall_180, 5, 4),(id_hall_180, 5, 5),(id_hall_180, 5, 6),(id_hall_180, 5, 7),(id_hall_180, 5, 8),
		(id_hall_180, 6, 1),(id_hall_180, 6, 2),(id_hall_180, 6, 3),(id_hall_180, 6, 4),(id_hall_180, 6, 5),(id_hall_180, 6, 6),(id_hall_180, 6, 7),(id_hall_180, 6, 8),
		(id_hall_180, 7, 1),(id_hall_180, 7, 2),(id_hall_180, 7, 3),(id_hall_180, 7, 4),(id_hall_180, 7, 5),(id_hall_180, 7, 6),(id_hall_180, 7, 7),(id_hall_180, 7, 8),
		(id_hall_181, 1, 1),(id_hall_181, 1, 2),(id_hall_181, 1, 3),(id_hall_181, 1, 4),(id_hall_181, 1, 5),(id_hall_181, 1, 6),(id_hall_181, 1, 7),(id_hall_181, 1, 8),
		(id_hall_181, 2, 1),(id_hall_181, 2, 2),(id_hall_181, 2, 3),(id_hall_181, 2, 4),(id_hall_181, 2, 5),(id_hall_181, 2, 6),(id_hall_181, 2, 7),(id_hall_181, 2, 8),
		(id_hall_181, 3, 1),(id_hall_181, 3, 2),(id_hall_181, 3, 3),(id_hall_181, 3, 4),(id_hall_181, 3, 5),(id_hall_181, 3, 6),(id_hall_181, 3, 7),(id_hall_181, 3, 8),
		(id_hall_181, 4, 1),(id_hall_181, 4, 2),(id_hall_181, 4, 3),(id_hall_181, 4, 4),(id_hall_181, 4, 5),(id_hall_181, 4, 6),(id_hall_181, 4, 7),(id_hall_181, 4, 8),
		(id_hall_181, 5, 1),(id_hall_181, 5, 2),(id_hall_181, 5, 3),(id_hall_181, 5, 4),(id_hall_181, 5, 5),(id_hall_181, 5, 6),(id_hall_181, 5, 7),(id_hall_181, 5, 8),
		(id_hall_181, 6, 1),(id_hall_181, 6, 2),(id_hall_181, 6, 3),(id_hall_181, 6, 4),(id_hall_181, 6, 5),(id_hall_181, 6, 6),(id_hall_181, 6, 7),(id_hall_181, 6, 8),
		(id_hall_181, 7, 1),(id_hall_181, 7, 2),(id_hall_181, 7, 3),(id_hall_181, 7, 4),(id_hall_181, 7, 5),(id_hall_181, 7, 6),(id_hall_181, 7, 7),(id_hall_181, 7, 8),
		(id_hall_182, 1, 1),(id_hall_182, 1, 2),(id_hall_182, 1, 3),(id_hall_182, 1, 4),(id_hall_182, 1, 5),(id_hall_182, 1, 6),(id_hall_182, 1, 7),(id_hall_182, 1, 8),
		(id_hall_182, 2, 1),(id_hall_182, 2, 2),(id_hall_182, 2, 3),(id_hall_182, 2, 4),(id_hall_182, 2, 5),(id_hall_182, 2, 6),(id_hall_182, 2, 7),(id_hall_182, 2, 8),
		(id_hall_182, 3, 1),(id_hall_182, 3, 2),(id_hall_182, 3, 3),(id_hall_182, 3, 4),(id_hall_182, 3, 5),(id_hall_182, 3, 6),(id_hall_182, 3, 7),(id_hall_182, 3, 8),
		(id_hall_182, 4, 1),(id_hall_182, 4, 2),(id_hall_182, 4, 3),(id_hall_182, 4, 4),(id_hall_182, 4, 5),(id_hall_182, 4, 6),(id_hall_182, 4, 7),(id_hall_182, 4, 8),
		(id_hall_182, 5, 1),(id_hall_182, 5, 2),(id_hall_182, 5, 3),(id_hall_182, 5, 4),(id_hall_182, 5, 5),(id_hall_182, 5, 6),(id_hall_182, 5, 7),(id_hall_182, 5, 8),
		(id_hall_182, 6, 1),(id_hall_182, 6, 2),(id_hall_182, 6, 3),(id_hall_182, 6, 4),(id_hall_182, 6, 5),(id_hall_182, 6, 6),(id_hall_182, 6, 7),(id_hall_182, 6, 8),
		(id_hall_182, 7, 1),(id_hall_182, 7, 2),(id_hall_182, 7, 3),(id_hall_182, 7, 4),(id_hall_182, 7, 5),(id_hall_182, 7, 6),(id_hall_182, 7, 7),(id_hall_182, 7, 8),
		(id_hall_183, 1, 1),(id_hall_183, 1, 2),(id_hall_183, 1, 3),(id_hall_183, 1, 4),(id_hall_183, 1, 5),(id_hall_183, 1, 6),(id_hall_183, 1, 7),(id_hall_183, 1, 8),
		(id_hall_183, 2, 1),(id_hall_183, 2, 2),(id_hall_183, 2, 3),(id_hall_183, 2, 4),(id_hall_183, 2, 5),(id_hall_183, 2, 6),(id_hall_183, 2, 7),(id_hall_183, 2, 8),
		(id_hall_183, 3, 1),(id_hall_183, 3, 2),(id_hall_183, 3, 3),(id_hall_183, 3, 4),(id_hall_183, 3, 5),(id_hall_183, 3, 6),(id_hall_183, 3, 7),(id_hall_183, 3, 8),
		(id_hall_183, 4, 1),(id_hall_183, 4, 2),(id_hall_183, 4, 3),(id_hall_183, 4, 4),(id_hall_183, 4, 5),(id_hall_183, 4, 6),(id_hall_183, 4, 7),(id_hall_183, 4, 8),
		(id_hall_183, 5, 1),(id_hall_183, 5, 2),(id_hall_183, 5, 3),(id_hall_183, 5, 4),(id_hall_183, 5, 5),(id_hall_183, 5, 6),(id_hall_183, 5, 7),(id_hall_183, 5, 8),
		(id_hall_183, 6, 1),(id_hall_183, 6, 2),(id_hall_183, 6, 3),(id_hall_183, 6, 4),(id_hall_183, 6, 5),(id_hall_183, 6, 6),(id_hall_183, 6, 7),(id_hall_183, 6, 8),
		(id_hall_183, 7, 1),(id_hall_183, 7, 2),(id_hall_183, 7, 3),(id_hall_183, 7, 4),(id_hall_183, 7, 5),(id_hall_183, 7, 6),(id_hall_183, 7, 7),(id_hall_183, 7, 8),
		(id_hall_184, 1, 1),(id_hall_184, 1, 2),(id_hall_184, 1, 3),(id_hall_184, 1, 4),(id_hall_184, 1, 5),(id_hall_184, 1, 6),(id_hall_184, 1, 7),(id_hall_184, 1, 8),
		(id_hall_184, 2, 1),(id_hall_184, 2, 2),(id_hall_184, 2, 3),(id_hall_184, 2, 4),(id_hall_184, 2, 5),(id_hall_184, 2, 6),(id_hall_184, 2, 7),(id_hall_184, 2, 8),
		(id_hall_184, 3, 1),(id_hall_184, 3, 2),(id_hall_184, 3, 3),(id_hall_184, 3, 4),(id_hall_184, 3, 5),(id_hall_184, 3, 6),(id_hall_184, 3, 7),(id_hall_184, 3, 8),
		(id_hall_184, 4, 1),(id_hall_184, 4, 2),(id_hall_184, 4, 3),(id_hall_184, 4, 4),(id_hall_184, 4, 5),(id_hall_184, 4, 6),(id_hall_184, 4, 7),(id_hall_184, 4, 8),
		(id_hall_184, 5, 1),(id_hall_184, 5, 2),(id_hall_184, 5, 3),(id_hall_184, 5, 4),(id_hall_184, 5, 5),(id_hall_184, 5, 6),(id_hall_184, 5, 7),(id_hall_184, 5, 8),
		(id_hall_184, 6, 1),(id_hall_184, 6, 2),(id_hall_184, 6, 3),(id_hall_184, 6, 4),(id_hall_184, 6, 5),(id_hall_184, 6, 6),(id_hall_184, 6, 7),(id_hall_184, 6, 8),
		(id_hall_184, 7, 1),(id_hall_184, 7, 2),(id_hall_184, 7, 3),(id_hall_184, 7, 4),(id_hall_184, 7, 5),(id_hall_184, 7, 6),(id_hall_184, 7, 7),(id_hall_184, 7, 8),
		(id_hall_185, 1, 1),(id_hall_185, 1, 2),(id_hall_185, 1, 3),(id_hall_185, 1, 4),(id_hall_185, 1, 5),(id_hall_185, 1, 6),(id_hall_185, 1, 7),(id_hall_185, 1, 8),
		(id_hall_185, 2, 1),(id_hall_185, 2, 2),(id_hall_185, 2, 3),(id_hall_185, 2, 4),(id_hall_185, 2, 5),(id_hall_185, 2, 6),(id_hall_185, 2, 7),(id_hall_185, 2, 8),
		(id_hall_185, 3, 1),(id_hall_185, 3, 2),(id_hall_185, 3, 3),(id_hall_185, 3, 4),(id_hall_185, 3, 5),(id_hall_185, 3, 6),(id_hall_185, 3, 7),(id_hall_185, 3, 8),
		(id_hall_185, 4, 1),(id_hall_185, 4, 2),(id_hall_185, 4, 3),(id_hall_185, 4, 4),(id_hall_185, 4, 5),(id_hall_185, 4, 6),(id_hall_185, 4, 7),(id_hall_185, 4, 8),
		(id_hall_185, 5, 1),(id_hall_185, 5, 2),(id_hall_185, 5, 3),(id_hall_185, 5, 4),(id_hall_185, 5, 5),(id_hall_185, 5, 6),(id_hall_185, 5, 7),(id_hall_185, 5, 8),
		(id_hall_185, 6, 1),(id_hall_185, 6, 2),(id_hall_185, 6, 3),(id_hall_185, 6, 4),(id_hall_185, 6, 5),(id_hall_185, 6, 6),(id_hall_185, 6, 7),(id_hall_185, 6, 8),
		(id_hall_185, 7, 1),(id_hall_185, 7, 2),(id_hall_185, 7, 3),(id_hall_185, 7, 4),(id_hall_185, 7, 5),(id_hall_185, 7, 6),(id_hall_185, 7, 7),(id_hall_185, 7, 8),
		(id_hall_186, 1, 1),(id_hall_186, 1, 2),(id_hall_186, 1, 3),(id_hall_186, 1, 4),(id_hall_186, 1, 5),(id_hall_186, 1, 6),(id_hall_186, 1, 7),(id_hall_186, 1, 8),
		(id_hall_186, 2, 1),(id_hall_186, 2, 2),(id_hall_186, 2, 3),(id_hall_186, 2, 4),(id_hall_186, 2, 5),(id_hall_186, 2, 6),(id_hall_186, 2, 7),(id_hall_186, 2, 8),
		(id_hall_186, 3, 1),(id_hall_186, 3, 2),(id_hall_186, 3, 3),(id_hall_186, 3, 4),(id_hall_186, 3, 5),(id_hall_186, 3, 6),(id_hall_186, 3, 7),(id_hall_186, 3, 8),
		(id_hall_186, 4, 1),(id_hall_186, 4, 2),(id_hall_186, 4, 3),(id_hall_186, 4, 4),(id_hall_186, 4, 5),(id_hall_186, 4, 6),(id_hall_186, 4, 7),(id_hall_186, 4, 8),
		(id_hall_186, 5, 1),(id_hall_186, 5, 2),(id_hall_186, 5, 3),(id_hall_186, 5, 4),(id_hall_186, 5, 5),(id_hall_186, 5, 6),(id_hall_186, 5, 7),(id_hall_186, 5, 8),
		(id_hall_186, 6, 1),(id_hall_186, 6, 2),(id_hall_186, 6, 3),(id_hall_186, 6, 4),(id_hall_186, 6, 5),(id_hall_186, 6, 6),(id_hall_186, 6, 7),(id_hall_186, 6, 8),
		(id_hall_186, 7, 1),(id_hall_186, 7, 2),(id_hall_186, 7, 3),(id_hall_186, 7, 4),(id_hall_186, 7, 5),(id_hall_186, 7, 6),(id_hall_186, 7, 7),(id_hall_186, 7, 8),
		(id_hall_187, 1, 1),(id_hall_187, 1, 2),(id_hall_187, 1, 3),(id_hall_187, 1, 4),(id_hall_187, 1, 5),(id_hall_187, 1, 6),(id_hall_187, 1, 7),(id_hall_187, 1, 8),
		(id_hall_187, 2, 1),(id_hall_187, 2, 2),(id_hall_187, 2, 3),(id_hall_187, 2, 4),(id_hall_187, 2, 5),(id_hall_187, 2, 6),(id_hall_187, 2, 7),(id_hall_187, 2, 8),
		(id_hall_187, 3, 1),(id_hall_187, 3, 2),(id_hall_187, 3, 3),(id_hall_187, 3, 4),(id_hall_187, 3, 5),(id_hall_187, 3, 6),(id_hall_187, 3, 7),(id_hall_187, 3, 8),
		(id_hall_187, 4, 1),(id_hall_187, 4, 2),(id_hall_187, 4, 3),(id_hall_187, 4, 4),(id_hall_187, 4, 5),(id_hall_187, 4, 6),(id_hall_187, 4, 7),(id_hall_187, 4, 8),
		(id_hall_187, 5, 1),(id_hall_187, 5, 2),(id_hall_187, 5, 3),(id_hall_187, 5, 4),(id_hall_187, 5, 5),(id_hall_187, 5, 6),(id_hall_187, 5, 7),(id_hall_187, 5, 8),
		(id_hall_187, 6, 1),(id_hall_187, 6, 2),(id_hall_187, 6, 3),(id_hall_187, 6, 4),(id_hall_187, 6, 5),(id_hall_187, 6, 6),(id_hall_187, 6, 7),(id_hall_187, 6, 8),
		(id_hall_187, 7, 1),(id_hall_187, 7, 2),(id_hall_187, 7, 3),(id_hall_187, 7, 4),(id_hall_187, 7, 5),(id_hall_187, 7, 6),(id_hall_187, 7, 7),(id_hall_187, 7, 8),
		(id_hall_188, 1, 1),(id_hall_188, 1, 2),(id_hall_188, 1, 3),(id_hall_188, 1, 4),(id_hall_188, 1, 5),(id_hall_188, 1, 6),(id_hall_188, 1, 7),(id_hall_188, 1, 8),
		(id_hall_188, 2, 1),(id_hall_188, 2, 2),(id_hall_188, 2, 3),(id_hall_188, 2, 4),(id_hall_188, 2, 5),(id_hall_188, 2, 6),(id_hall_188, 2, 7),(id_hall_188, 2, 8),
		(id_hall_188, 3, 1),(id_hall_188, 3, 2),(id_hall_188, 3, 3),(id_hall_188, 3, 4),(id_hall_188, 3, 5),(id_hall_188, 3, 6),(id_hall_188, 3, 7),(id_hall_188, 3, 8),
		(id_hall_188, 4, 1),(id_hall_188, 4, 2),(id_hall_188, 4, 3),(id_hall_188, 4, 4),(id_hall_188, 4, 5),(id_hall_188, 4, 6),(id_hall_188, 4, 7),(id_hall_188, 4, 8),
		(id_hall_188, 5, 1),(id_hall_188, 5, 2),(id_hall_188, 5, 3),(id_hall_188, 5, 4),(id_hall_188, 5, 5),(id_hall_188, 5, 6),(id_hall_188, 5, 7),(id_hall_188, 5, 8),
		(id_hall_188, 6, 1),(id_hall_188, 6, 2),(id_hall_188, 6, 3),(id_hall_188, 6, 4),(id_hall_188, 6, 5),(id_hall_188, 6, 6),(id_hall_188, 6, 7),(id_hall_188, 6, 8),
		(id_hall_188, 7, 1),(id_hall_188, 7, 2),(id_hall_188, 7, 3),(id_hall_188, 7, 4),(id_hall_188, 7, 5),(id_hall_188, 7, 6),(id_hall_188, 7, 7),(id_hall_188, 7, 8),
		(id_hall_189, 1, 1),(id_hall_189, 1, 2),(id_hall_189, 1, 3),(id_hall_189, 1, 4),(id_hall_189, 1, 5),(id_hall_189, 1, 6),(id_hall_189, 1, 7),(id_hall_189, 1, 8),
		(id_hall_189, 2, 1),(id_hall_189, 2, 2),(id_hall_189, 2, 3),(id_hall_189, 2, 4),(id_hall_189, 2, 5),(id_hall_189, 2, 6),(id_hall_189, 2, 7),(id_hall_189, 2, 8),
		(id_hall_189, 3, 1),(id_hall_189, 3, 2),(id_hall_189, 3, 3),(id_hall_189, 3, 4),(id_hall_189, 3, 5),(id_hall_189, 3, 6),(id_hall_189, 3, 7),(id_hall_189, 3, 8),
		(id_hall_189, 4, 1),(id_hall_189, 4, 2),(id_hall_189, 4, 3),(id_hall_189, 4, 4),(id_hall_189, 4, 5),(id_hall_189, 4, 6),(id_hall_189, 4, 7),(id_hall_189, 4, 8),
		(id_hall_189, 5, 1),(id_hall_189, 5, 2),(id_hall_189, 5, 3),(id_hall_189, 5, 4),(id_hall_189, 5, 5),(id_hall_189, 5, 6),(id_hall_189, 5, 7),(id_hall_189, 5, 8),
		(id_hall_189, 6, 1),(id_hall_189, 6, 2),(id_hall_189, 6, 3),(id_hall_189, 6, 4),(id_hall_189, 6, 5),(id_hall_189, 6, 6),(id_hall_189, 6, 7),(id_hall_189, 6, 8),
		(id_hall_189, 7, 1),(id_hall_189, 7, 2),(id_hall_189, 7, 3),(id_hall_189, 7, 4),(id_hall_189, 7, 5),(id_hall_189, 7, 6),(id_hall_189, 7, 7),(id_hall_189, 7, 8),
		(id_hall_190, 1, 1),(id_hall_190, 1, 2),(id_hall_190, 1, 3),(id_hall_190, 1, 4),(id_hall_190, 1, 5),(id_hall_190, 1, 6),(id_hall_190, 1, 7),(id_hall_190, 1, 8),
		(id_hall_190, 2, 1),(id_hall_190, 2, 2),(id_hall_190, 2, 3),(id_hall_190, 2, 4),(id_hall_190, 2, 5),(id_hall_190, 2, 6),(id_hall_190, 2, 7),(id_hall_190, 2, 8),
		(id_hall_190, 3, 1),(id_hall_190, 3, 2),(id_hall_190, 3, 3),(id_hall_190, 3, 4),(id_hall_190, 3, 5),(id_hall_190, 3, 6),(id_hall_190, 3, 7),(id_hall_190, 3, 8),
		(id_hall_190, 4, 1),(id_hall_190, 4, 2),(id_hall_190, 4, 3),(id_hall_190, 4, 4),(id_hall_190, 4, 5),(id_hall_190, 4, 6),(id_hall_190, 4, 7),(id_hall_190, 4, 8),
		(id_hall_190, 5, 1),(id_hall_190, 5, 2),(id_hall_190, 5, 3),(id_hall_190, 5, 4),(id_hall_190, 5, 5),(id_hall_190, 5, 6),(id_hall_190, 5, 7),(id_hall_190, 5, 8),
		(id_hall_190, 6, 1),(id_hall_190, 6, 2),(id_hall_190, 6, 3),(id_hall_190, 6, 4),(id_hall_190, 6, 5),(id_hall_190, 6, 6),(id_hall_190, 6, 7),(id_hall_190, 6, 8),
		(id_hall_190, 7, 1),(id_hall_190, 7, 2),(id_hall_190, 7, 3),(id_hall_190, 7, 4),(id_hall_190, 7, 5),(id_hall_190, 7, 6),(id_hall_190, 7, 7),(id_hall_190, 7, 8),
		(id_hall_191, 1, 1),(id_hall_191, 1, 2),(id_hall_191, 1, 3),(id_hall_191, 1, 4),(id_hall_191, 1, 5),(id_hall_191, 1, 6),(id_hall_191, 1, 7),(id_hall_191, 1, 8),
		(id_hall_191, 2, 1),(id_hall_191, 2, 2),(id_hall_191, 2, 3),(id_hall_191, 2, 4),(id_hall_191, 2, 5),(id_hall_191, 2, 6),(id_hall_191, 2, 7),(id_hall_191, 2, 8),
		(id_hall_191, 3, 1),(id_hall_191, 3, 2),(id_hall_191, 3, 3),(id_hall_191, 3, 4),(id_hall_191, 3, 5),(id_hall_191, 3, 6),(id_hall_191, 3, 7),(id_hall_191, 3, 8),
		(id_hall_191, 4, 1),(id_hall_191, 4, 2),(id_hall_191, 4, 3),(id_hall_191, 4, 4),(id_hall_191, 4, 5),(id_hall_191, 4, 6),(id_hall_191, 4, 7),(id_hall_191, 4, 8),
		(id_hall_191, 5, 1),(id_hall_191, 5, 2),(id_hall_191, 5, 3),(id_hall_191, 5, 4),(id_hall_191, 5, 5),(id_hall_191, 5, 6),(id_hall_191, 5, 7),(id_hall_191, 5, 8),
		(id_hall_191, 6, 1),(id_hall_191, 6, 2),(id_hall_191, 6, 3),(id_hall_191, 6, 4),(id_hall_191, 6, 5),(id_hall_191, 6, 6),(id_hall_191, 6, 7),(id_hall_191, 6, 8),
		(id_hall_191, 7, 1),(id_hall_191, 7, 2),(id_hall_191, 7, 3),(id_hall_191, 7, 4),(id_hall_191, 7, 5),(id_hall_191, 7, 6),(id_hall_191, 7, 7),(id_hall_191, 7, 8),
		(id_hall_192, 1, 1),(id_hall_192, 1, 2),(id_hall_192, 1, 3),(id_hall_192, 1, 4),(id_hall_192, 1, 5),(id_hall_192, 1, 6),(id_hall_192, 1, 7),(id_hall_192, 1, 8),
		(id_hall_192, 2, 1),(id_hall_192, 2, 2),(id_hall_192, 2, 3),(id_hall_192, 2, 4),(id_hall_192, 2, 5),(id_hall_192, 2, 6),(id_hall_192, 2, 7),(id_hall_192, 2, 8),
		(id_hall_192, 3, 1),(id_hall_192, 3, 2),(id_hall_192, 3, 3),(id_hall_192, 3, 4),(id_hall_192, 3, 5),(id_hall_192, 3, 6),(id_hall_192, 3, 7),(id_hall_192, 3, 8),
		(id_hall_192, 4, 1),(id_hall_192, 4, 2),(id_hall_192, 4, 3),(id_hall_192, 4, 4),(id_hall_192, 4, 5),(id_hall_192, 4, 6),(id_hall_192, 4, 7),(id_hall_192, 4, 8),
		(id_hall_192, 5, 1),(id_hall_192, 5, 2),(id_hall_192, 5, 3),(id_hall_192, 5, 4),(id_hall_192, 5, 5),(id_hall_192, 5, 6),(id_hall_192, 5, 7),(id_hall_192, 5, 8),
		(id_hall_192, 6, 1),(id_hall_192, 6, 2),(id_hall_192, 6, 3),(id_hall_192, 6, 4),(id_hall_192, 6, 5),(id_hall_192, 6, 6),(id_hall_192, 6, 7),(id_hall_192, 6, 8),
		(id_hall_192, 7, 1),(id_hall_192, 7, 2),(id_hall_192, 7, 3),(id_hall_192, 7, 4),(id_hall_192, 7, 5),(id_hall_192, 7, 6),(id_hall_192, 7, 7),(id_hall_192, 7, 8),
		(id_hall_193, 1, 1),(id_hall_193, 1, 2),(id_hall_193, 1, 3),(id_hall_193, 1, 4),(id_hall_193, 1, 5),(id_hall_193, 1, 6),(id_hall_193, 1, 7),(id_hall_193, 1, 8),
		(id_hall_193, 2, 1),(id_hall_193, 2, 2),(id_hall_193, 2, 3),(id_hall_193, 2, 4),(id_hall_193, 2, 5),(id_hall_193, 2, 6),(id_hall_193, 2, 7),(id_hall_193, 2, 8),
		(id_hall_193, 3, 1),(id_hall_193, 3, 2),(id_hall_193, 3, 3),(id_hall_193, 3, 4),(id_hall_193, 3, 5),(id_hall_193, 3, 6),(id_hall_193, 3, 7),(id_hall_193, 3, 8),
		(id_hall_193, 4, 1),(id_hall_193, 4, 2),(id_hall_193, 4, 3),(id_hall_193, 4, 4),(id_hall_193, 4, 5),(id_hall_193, 4, 6),(id_hall_193, 4, 7),(id_hall_193, 4, 8),
		(id_hall_193, 5, 1),(id_hall_193, 5, 2),(id_hall_193, 5, 3),(id_hall_193, 5, 4),(id_hall_193, 5, 5),(id_hall_193, 5, 6),(id_hall_193, 5, 7),(id_hall_193, 5, 8),
		(id_hall_193, 6, 1),(id_hall_193, 6, 2),(id_hall_193, 6, 3),(id_hall_193, 6, 4),(id_hall_193, 6, 5),(id_hall_193, 6, 6),(id_hall_193, 6, 7),(id_hall_193, 6, 8),
		(id_hall_193, 7, 1),(id_hall_193, 7, 2),(id_hall_193, 7, 3),(id_hall_193, 7, 4),(id_hall_193, 7, 5),(id_hall_193, 7, 6),(id_hall_193, 7, 7),(id_hall_193, 7, 8),
		(id_hall_194, 1, 1),(id_hall_194, 1, 2),(id_hall_194, 1, 3),(id_hall_194, 1, 4),(id_hall_194, 1, 5),(id_hall_194, 1, 6),(id_hall_194, 1, 7),(id_hall_194, 1, 8),
		(id_hall_194, 2, 1),(id_hall_194, 2, 2),(id_hall_194, 2, 3),(id_hall_194, 2, 4),(id_hall_194, 2, 5),(id_hall_194, 2, 6),(id_hall_194, 2, 7),(id_hall_194, 2, 8),
		(id_hall_194, 3, 1),(id_hall_194, 3, 2),(id_hall_194, 3, 3),(id_hall_194, 3, 4),(id_hall_194, 3, 5),(id_hall_194, 3, 6),(id_hall_194, 3, 7),(id_hall_194, 3, 8),
		(id_hall_194, 4, 1),(id_hall_194, 4, 2),(id_hall_194, 4, 3),(id_hall_194, 4, 4),(id_hall_194, 4, 5),(id_hall_194, 4, 6),(id_hall_194, 4, 7),(id_hall_194, 4, 8),
		(id_hall_194, 5, 1),(id_hall_194, 5, 2),(id_hall_194, 5, 3),(id_hall_194, 5, 4),(id_hall_194, 5, 5),(id_hall_194, 5, 6),(id_hall_194, 5, 7),(id_hall_194, 5, 8),
		(id_hall_194, 6, 1),(id_hall_194, 6, 2),(id_hall_194, 6, 3),(id_hall_194, 6, 4),(id_hall_194, 6, 5),(id_hall_194, 6, 6),(id_hall_194, 6, 7),(id_hall_194, 6, 8),
		(id_hall_194, 7, 1),(id_hall_194, 7, 2),(id_hall_194, 7, 3),(id_hall_194, 7, 4),(id_hall_194, 7, 5),(id_hall_194, 7, 6),(id_hall_194, 7, 7),(id_hall_194, 7, 8),
		(id_hall_195, 1, 1),(id_hall_195, 1, 2),(id_hall_195, 1, 3),(id_hall_195, 1, 4),(id_hall_195, 1, 5),(id_hall_195, 1, 6),(id_hall_195, 1, 7),(id_hall_195, 1, 8),
		(id_hall_195, 2, 1),(id_hall_195, 2, 2),(id_hall_195, 2, 3),(id_hall_195, 2, 4),(id_hall_195, 2, 5),(id_hall_195, 2, 6),(id_hall_195, 2, 7),(id_hall_195, 2, 8),
		(id_hall_195, 3, 1),(id_hall_195, 3, 2),(id_hall_195, 3, 3),(id_hall_195, 3, 4),(id_hall_195, 3, 5),(id_hall_195, 3, 6),(id_hall_195, 3, 7),(id_hall_195, 3, 8),
		(id_hall_195, 4, 1),(id_hall_195, 4, 2),(id_hall_195, 4, 3),(id_hall_195, 4, 4),(id_hall_195, 4, 5),(id_hall_195, 4, 6),(id_hall_195, 4, 7),(id_hall_195, 4, 8),
		(id_hall_195, 5, 1),(id_hall_195, 5, 2),(id_hall_195, 5, 3),(id_hall_195, 5, 4),(id_hall_195, 5, 5),(id_hall_195, 5, 6),(id_hall_195, 5, 7),(id_hall_195, 5, 8),
		(id_hall_195, 6, 1),(id_hall_195, 6, 2),(id_hall_195, 6, 3),(id_hall_195, 6, 4),(id_hall_195, 6, 5),(id_hall_195, 6, 6),(id_hall_195, 6, 7),(id_hall_195, 6, 8),
		(id_hall_195, 7, 1),(id_hall_195, 7, 2),(id_hall_195, 7, 3),(id_hall_195, 7, 4),(id_hall_195, 7, 5),(id_hall_195, 7, 6),(id_hall_195, 7, 7),(id_hall_195, 7, 8),
		(id_hall_196, 1, 1),(id_hall_196, 1, 2),(id_hall_196, 1, 3),(id_hall_196, 1, 4),(id_hall_196, 1, 5),(id_hall_196, 1, 6),(id_hall_196, 1, 7),(id_hall_196, 1, 8),
		(id_hall_196, 2, 1),(id_hall_196, 2, 2),(id_hall_196, 2, 3),(id_hall_196, 2, 4),(id_hall_196, 2, 5),(id_hall_196, 2, 6),(id_hall_196, 2, 7),(id_hall_196, 2, 8),
		(id_hall_196, 3, 1),(id_hall_196, 3, 2),(id_hall_196, 3, 3),(id_hall_196, 3, 4),(id_hall_196, 3, 5),(id_hall_196, 3, 6),(id_hall_196, 3, 7),(id_hall_196, 3, 8),
		(id_hall_196, 4, 1),(id_hall_196, 4, 2),(id_hall_196, 4, 3),(id_hall_196, 4, 4),(id_hall_196, 4, 5),(id_hall_196, 4, 6),(id_hall_196, 4, 7),(id_hall_196, 4, 8),
		(id_hall_196, 5, 1),(id_hall_196, 5, 2),(id_hall_196, 5, 3),(id_hall_196, 5, 4),(id_hall_196, 5, 5),(id_hall_196, 5, 6),(id_hall_196, 5, 7),(id_hall_196, 5, 8),
		(id_hall_196, 6, 1),(id_hall_196, 6, 2),(id_hall_196, 6, 3),(id_hall_196, 6, 4),(id_hall_196, 6, 5),(id_hall_196, 6, 6),(id_hall_196, 6, 7),(id_hall_196, 6, 8),
		(id_hall_196, 7, 1),(id_hall_196, 7, 2),(id_hall_196, 7, 3),(id_hall_196, 7, 4),(id_hall_196, 7, 5),(id_hall_196, 7, 6),(id_hall_196, 7, 7),(id_hall_196, 7, 8),
		(id_hall_197, 1, 1),(id_hall_197, 1, 2),(id_hall_197, 1, 3),(id_hall_197, 1, 4),(id_hall_197, 1, 5),(id_hall_197, 1, 6),(id_hall_197, 1, 7),(id_hall_197, 1, 8),
		(id_hall_197, 2, 1),(id_hall_197, 2, 2),(id_hall_197, 2, 3),(id_hall_197, 2, 4),(id_hall_197, 2, 5),(id_hall_197, 2, 6),(id_hall_197, 2, 7),(id_hall_197, 2, 8),
		(id_hall_197, 3, 1),(id_hall_197, 3, 2),(id_hall_197, 3, 3),(id_hall_197, 3, 4),(id_hall_197, 3, 5),(id_hall_197, 3, 6),(id_hall_197, 3, 7),(id_hall_197, 3, 8),
		(id_hall_197, 4, 1),(id_hall_197, 4, 2),(id_hall_197, 4, 3),(id_hall_197, 4, 4),(id_hall_197, 4, 5),(id_hall_197, 4, 6),(id_hall_197, 4, 7),(id_hall_197, 4, 8),
		(id_hall_197, 5, 1),(id_hall_197, 5, 2),(id_hall_197, 5, 3),(id_hall_197, 5, 4),(id_hall_197, 5, 5),(id_hall_197, 5, 6),(id_hall_197, 5, 7),(id_hall_197, 5, 8),
		(id_hall_197, 6, 1),(id_hall_197, 6, 2),(id_hall_197, 6, 3),(id_hall_197, 6, 4),(id_hall_197, 6, 5),(id_hall_197, 6, 6),(id_hall_197, 6, 7),(id_hall_197, 6, 8),
		(id_hall_197, 7, 1),(id_hall_197, 7, 2),(id_hall_197, 7, 3),(id_hall_197, 7, 4),(id_hall_197, 7, 5),(id_hall_197, 7, 6),(id_hall_197, 7, 7),(id_hall_197, 7, 8),
		(id_hall_198, 1, 1),(id_hall_198, 1, 2),(id_hall_198, 1, 3),(id_hall_198, 1, 4),(id_hall_198, 1, 5),(id_hall_198, 1, 6),(id_hall_198, 1, 7),(id_hall_198, 1, 8),
		(id_hall_198, 2, 1),(id_hall_198, 2, 2),(id_hall_198, 2, 3),(id_hall_198, 2, 4),(id_hall_198, 2, 5),(id_hall_198, 2, 6),(id_hall_198, 2, 7),(id_hall_198, 2, 8),
		(id_hall_198, 3, 1),(id_hall_198, 3, 2),(id_hall_198, 3, 3),(id_hall_198, 3, 4),(id_hall_198, 3, 5),(id_hall_198, 3, 6),(id_hall_198, 3, 7),(id_hall_198, 3, 8),
		(id_hall_198, 4, 1),(id_hall_198, 4, 2),(id_hall_198, 4, 3),(id_hall_198, 4, 4),(id_hall_198, 4, 5),(id_hall_198, 4, 6),(id_hall_198, 4, 7),(id_hall_198, 4, 8),
		(id_hall_198, 5, 1),(id_hall_198, 5, 2),(id_hall_198, 5, 3),(id_hall_198, 5, 4),(id_hall_198, 5, 5),(id_hall_198, 5, 6),(id_hall_198, 5, 7),(id_hall_198, 5, 8),
		(id_hall_198, 6, 1),(id_hall_198, 6, 2),(id_hall_198, 6, 3),(id_hall_198, 6, 4),(id_hall_198, 6, 5),(id_hall_198, 6, 6),(id_hall_198, 6, 7),(id_hall_198, 6, 8),
		(id_hall_198, 7, 1),(id_hall_198, 7, 2),(id_hall_198, 7, 3),(id_hall_198, 7, 4),(id_hall_198, 7, 5),(id_hall_198, 7, 6),(id_hall_198, 7, 7),(id_hall_198, 7, 8),
		(id_hall_199, 1, 1),(id_hall_199, 1, 2),(id_hall_199, 1, 3),(id_hall_199, 1, 4),(id_hall_199, 1, 5),(id_hall_199, 1, 6),(id_hall_199, 1, 7),(id_hall_199, 1, 8),
		(id_hall_199, 2, 1),(id_hall_199, 2, 2),(id_hall_199, 2, 3),(id_hall_199, 2, 4),(id_hall_199, 2, 5),(id_hall_199, 2, 6),(id_hall_199, 2, 7),(id_hall_199, 2, 8),
		(id_hall_199, 3, 1),(id_hall_199, 3, 2),(id_hall_199, 3, 3),(id_hall_199, 3, 4),(id_hall_199, 3, 5),(id_hall_199, 3, 6),(id_hall_199, 3, 7),(id_hall_199, 3, 8),
		(id_hall_199, 4, 1),(id_hall_199, 4, 2),(id_hall_199, 4, 3),(id_hall_199, 4, 4),(id_hall_199, 4, 5),(id_hall_199, 4, 6),(id_hall_199, 4, 7),(id_hall_199, 4, 8),
		(id_hall_199, 5, 1),(id_hall_199, 5, 2),(id_hall_199, 5, 3),(id_hall_199, 5, 4),(id_hall_199, 5, 5),(id_hall_199, 5, 6),(id_hall_199, 5, 7),(id_hall_199, 5, 8),
		(id_hall_199, 6, 1),(id_hall_199, 6, 2),(id_hall_199, 6, 3),(id_hall_199, 6, 4),(id_hall_199, 6, 5),(id_hall_199, 6, 6),(id_hall_199, 6, 7),(id_hall_199, 6, 8),
		(id_hall_199, 7, 1),(id_hall_199, 7, 2),(id_hall_199, 7, 3),(id_hall_199, 7, 4),(id_hall_199, 7, 5),(id_hall_199, 7, 6),(id_hall_199, 7, 7),(id_hall_199, 7, 8);
END $$;